

#ifndef Draw_H
#define Draw_H



//-------------------------------------------------------------------------------------------------
// Function name:       Draw_Clr
// Descriptions:        清绘画显示
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Draw_Clr(void);//清绘画显示


//-------------------------------------------------------------------------------------------------
// Function name:       Draw_Line
// Descriptions:        绘直线
// input parameters:    开始座标x1,y1,结束座标x2,x2,座标原点相对LCD左上角
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Draw_Line(u32 x1,u32 y1,u32 x2,u32 y2);//绘直线


//-------------------------------------------------------------------------------------------------
// Function name:       Draw_Round
// Descriptions:        绘园
// input parameters:    圆心座标x,y,半径r,座标原点相对LCD左上角
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Draw_Round(u32 x,u32 y,u32 r);//绘园






#endif

