

#ifndef Menu4_H
#define Menu4_H




//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_2
// Descriptions:        电表有功功率
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_2(void);//菜单4_2

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_1
// Descriptions:        当月正向有功最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_1(void);

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_2
// Descriptions:        当月正向无功最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_2(void);

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_3
// Descriptions:        当月反向有功最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_3(void);

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_4
// Descriptions:        当月反向无功月最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_4(void);

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_5
// Descriptions:        上月正向有功最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_5(void);

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_6
// Descriptions:        上月正向无功最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_6(void);

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_7
// Descriptions:        上月反向有功最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_7(void);

//-------------------------------------------------------------------------------------------------
// Function name:       Menu_4_5_8
// Descriptions:        上月反向无功最大需量
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu_4_5_8(void);



#endif

