//Terminal_ReadMeter_HX_6E_Lib
#include "Project.h"
#include "Terminal_ReadMeter_HX_6E_Lib.h"
#include "Terminal_AFN0E_Event.h"


#if ((Project/100)==3)&&((USER/100)==12)//四川专变

//F0 通用
__asm void ADDR_RM_HX_6E_F0_Lib(void)
{
	dcb 0//实时Fn
	dcb 0//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}

//F129 当前正向有功电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F129_Lib(void)
{
	dcb 129//实时Fn
	dcb 6//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 161//日冻结Fn
	dcb 169//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x0000004c//发登录命令
	dcb 0//返回长度
	dcdu 0x00690152//正向有功总电量
	dcb 0//返回长度
	dcdu 0x00600152//费率1正向有功电量
	dcb 0//返回长度
	dcdu 0x00610152//费率2正向有功电量
	dcb 0//返回长度
	dcdu 0x00620152//费率3正向有功电量
	dcb 0//返回长度
	dcdu 0x00630152//费率4正向有功电量
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0000004c//发登录命令
	dcb 1//返回长度
//	dcdu 0x00690152//正向有功总电量
	dcb 4//返回长度
//	dcdu 0x00600152//费率1正向有功电量
	dcb 4//返回长度
//	dcdu 0x00610152//费率2正向有功电量
	dcb 4//返回长度
//	dcdu 0x00620152//费率3正向有功电量
	dcb 4//返回长度
//	dcdu 0x00630152//费率4正向有功电量
	dcb 4//返回长度
	ALIGN
}	

//F130：当前正向无功（组合无功1）电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F130_Lib(void)
{
	dcb 130//实时Fn
	dcb 5//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 162//日冻结Fn
	dcb 170//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00690352//正向无功总电量
	dcb 0//返回长度
	dcdu 0x00600352//费率1正向无功电量
	dcb 0//返回长度
	dcdu 0x00610352//费率2正向无功电量
	dcb 0//返回长度
	dcdu 0x00620352//费率3正向无功电量
	dcb 0//返回长度
	dcdu 0x00630352//费率4正向无功电量
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00690352//正向无功总电量
	dcb 4//返回长度
//	dcdu 0x00600352//费率1正向无功电量
	dcb 4//返回长度
//	dcdu 0x00610352//费率2正向无功电量
	dcb 4//返回长度
//	dcdu 0x00620352//费率3正向无功电量
	dcb 4//返回长度
//	dcdu 0x00630352//费率4正向无功电量
	dcb 4//返回长度
	ALIGN
}	

//F131：当前反向有功电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F131_Lib(void)
{
	dcb 131//实时Fn
	dcb 5//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 163//日冻结Fn
	dcb 171//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00690052//反向有功总电量
	dcb 0//返回长度
	dcdu 0x00600052//费率1反向有功电量
	dcb 0//返回长度
	dcdu 0x00610052//费率2反向有功电量
	dcb 0//返回长度
	dcdu 0x00620052//费率3反向有功电量
	dcb 0//返回长度
	dcdu 0x00630052//费率4反向有功电量
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00690052//反向有功总电量
	dcb 4//返回长度
//	dcdu 0x00600052//费率1反向有功电量
	dcb 4//返回长度
//	dcdu 0x00610052//费率2反向有功电量
	dcb 4//返回长度
//	dcdu 0x00620052//费率3反向有功电量
	dcb 4//返回长度
//	dcdu 0x00630052//费率4反向有功电量
	dcb 4//返回长度
	ALIGN
}	

//F132：当前反向无功（组合无功2）电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F132_Lib(void)
{
	dcb 132//实时Fn
	dcb 5//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 164//日冻结Fn
	dcb 172//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00690252//反向无功总电量
	dcb 0//返回长度
	dcdu 0x00600252//费率1反向无功电量
	dcb 0//返回长度
	dcdu 0x00610252//费率2反向无功电量
	dcb 0//返回长度
	dcdu 0x00620252//费率3反向无功电量
	dcb 0//返回长度
	dcdu 0x00630252//费率4反向无功电量
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00690252//反向无功总电量
	dcb 4//返回长度
//	dcdu 0x00600252//费率1反向无功电量
	dcb 4//返回长度
//	dcdu 0x00610252//费率2反向无功电量
	dcb 4//返回长度
//	dcdu 0x00620252//费率3反向无功电量
	dcb 4//返回长度
//	dcdu 0x00630252//费率4反向无功电量
	dcb 4//返回长度
	ALIGN
}	

//F133：当前一象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F133_Lib(void)
{
	dcb 133//实时Fn
	dcb 5//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 165//日冻结Fn
	dcb 173//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00690652//一象限无功总电量
	dcb 0//返回长度
	dcdu 0x00600652//一象限费率1反向无功电量
	dcb 0//返回长度
	dcdu 0x00610652//一象限费率2反向无功电量
	dcb 0//返回长度
	dcdu 0x00620652//一象限费率3反向无功电量
	dcb 0//返回长度
	dcdu 0x00630652//一象限费率4反向无功电量
	dcb 0//返回长度	
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00690652//一象限无功总电量
	dcb 4//返回长度
//	dcdu 0x00600652//一象限费率1反向无功电量
	dcb 4//返回长度
//	dcdu 0x00610652//一象限费率2反向无功电量
	dcb 4//返回长度
//	dcdu 0x00620652//一象限费率3反向无功电量
	dcb 4//返回长度
//	dcdu 0x00630652//一象限费率4反向无功电量
	dcb 4//返回长度	
	ALIGN
}	

//F134：当前二象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F134_Lib(void)
{
	dcb 134//实时Fn
	dcb 5//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 166//日冻结Fn
	dcb 174//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00690752//二象限无功总电量
	dcb 0//返回长度
	dcdu 0x00600752//二象限费率1反向无功电量
	dcb 0//返回长度
	dcdu 0x00610752//二象限费率2反向无功电量
	dcb 0//返回长度
	dcdu 0x00620752//二象限费率3反向无功电量
	dcb 0//返回长度
	dcdu 0x00630752//二象限费率4反向无功电量
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00690752//二象限无功总电量
	dcb 4//返回长度
//	dcdu 0x00600752//二象限费率1反向无功电量
	dcb 4//返回长度
//	dcdu 0x00610752//二象限费率2反向无功电量
	dcb 4//返回长度
//	dcdu 0x00620752//二象限费率3反向无功电量
	dcb 4//返回长度
//	dcdu 0x00630752//二象限费率4反向无功电量
	dcb 4//返回长度
	ALIGN
}	

//F135：当前三象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F135_Lib(void)
{
	dcb 135//实时Fn
	dcb 5//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 167//日冻结Fn
	dcb 175//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00690852//三象限无功总电量
	dcb 0//返回长度
	dcdu 0x00600852//三象限费率1反向无功电量
	dcb 0//返回长度
	dcdu 0x00610852//三象限费率2反向无功电量
	dcb 0//返回长度
	dcdu 0x00620852//三象限费率3反向无功电量
	dcb 0//返回长度
	dcdu 0x00630852//三象限费率4反向无功电量
	dcb 0//返回长度	
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00690852//三象限无功总电量
	dcb 4//返回长度
//	dcdu 0x00600852//三象限费率1反向无功电量
	dcb 4//返回长度
//	dcdu 0x00610852//三象限费率2反向无功电量
	dcb 4//返回长度
//	dcdu 0x00620852//三象限费率3反向无功电量
	dcb 4//返回长度
//	dcdu 0x00630852//三象限费率4反向无功电量
	dcb 4//返回长度	
	ALIGN
}	

//F136：当前四象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_HX_6E_F136_Lib(void)
{
	dcb 136//实时Fn
	dcb 5//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00011001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 168//日冻结Fn
	dcb 176//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00690952//四象限无功总电量
	dcb 0//返回长度
	dcdu 0x00600952//四象限费率1反向无功电量
	dcb 0//返回长度
	dcdu 0x00610952//四象限费率2反向无功电量
	dcb 0//返回长度
	dcdu 0x00620952//四象限费率3反向无功电量
	dcb 0//返回长度
	dcdu 0x00630952//四象限费率4反向无功电量
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00690952//四象限无功总电量
	dcb 4//返回长度
//	dcdu 0x00600952//四象限费率1反向无功电量
	dcb 4//返回长度
//	dcdu 0x00610952//四象限费率2反向无功电量
	dcb 4//返回长度
//	dcdu 0x00620952//四象限费率3反向无功电量
	dcb 4//返回长度
//	dcdu 0x00630952//四象限费率4反向无功电量
	dcb 4//返回长度
	ALIGN
}	

//F145：当月正向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_HX_6E_F145_Lib(void)
{
	dcb 145//实时Fn
	dcb 10//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 189//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00091152//当前正向有功总最大需量
	dcb 0//返回长度
	dcdu 0x00098152//当前正向有功总最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00001152//当前费率1正向有功最大需量
	dcb 0//返回长度
	dcdu 0x00008152//当前费率1正向有功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00011152//当前费率2正向有功最大需量
	dcb 0//返回长度
	dcdu 0x00018152//当前费率2正向有功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00021152//当前费率3正向有功最大需量
	dcb 0//返回长度
	dcdu 0x00028152//当前费率3正向有功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00031152//当前费率4正向有功最大需量
	dcb 0//返回长度
	dcdu 0x00038152//当前费率4正向有功最大需量发生时间
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00091152//当前正向有功总最大需量
	dcb 4//返回长度
//	dcdu 0x00098152//当前正向有功总最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00001152//当前费率1正向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00008152//当前费率1正向有功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00011152//当前费率2正向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00018152//当前费率2正向有功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00021152//当前费率3正向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00028152//当前费率3正向有功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00031152//当前费率4正向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00038152//当前费率4正向有功最大需量发生时间
	dcb 6//返回长度
	ALIGN
}	

//F146：当月正向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_HX_6E_F146_Lib(void)
{
	dcb 146//实时Fn
	dcb 10//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 190//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00091352//当前正向无功总最大需量
	dcb 0//返回长度
	dcdu 0x00098352//当前正向无功总最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00001352//当前费率1正向无功最大需量
	dcb 0//返回长度
	dcdu 0x00008352//当前费率1正向无功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00011352//当前费率2正向无功最大需量
	dcb 0//返回长度
	dcdu 0x00018352//当前费率2正向无功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00021352//当前费率3正向无功最大需量
	dcb 0//返回长度
	dcdu 0x00028352//当前费率3正向无功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00031352//当前费率4正向无功最大需量
	dcb 0//返回长度
	dcdu 0x00038352//当前费率4正向无功最大需量发生时间
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00091352//当前正向无功总最大需量
	dcb 4//返回长度
//	dcdu 0x00098352//当前正向无功总最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00001352//当前费率1正向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00008352//当前费率1正向无功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00011352//当前费率2正向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00018352//当前费率2正向无功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00021352//当前费率3正向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00028352//当前费率3正向无功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00031352//当前费率4正向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00038352//当前费率4正向无功最大需量发生时间
	dcb 6//返回长度
	ALIGN
}	

//F147：当月反向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_HX_6E_F147_Lib(void)
{
	dcb 147//实时Fn
	dcb 10//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 191//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00091052//当前反向有功总最大需量
	dcb 0//返回长度
	dcdu 0x00098052//当前反向有功总最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00001052//当前费率1反向有功最大需量
	dcb 0//返回长度
	dcdu 0x00008052//当前费率1反向有功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00011052//当前费率2反向有功最大需量
	dcb 0//返回长度
	dcdu 0x00018052//当前费率2反向有功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00021052//当前费率3反向有功最大需量
	dcb 0//返回长度
	dcdu 0x00028052//当前费率3反向有功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00031052//当前费率4反向有功最大需量
	dcb 0//返回长度
	dcdu 0x00038052//当前费率4反向有功最大需量发生时间
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00091052//当前反向有功总最大需量
	dcb 4//返回长度
//	dcdu 0x00098052//当前反向有功总最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00001052//当前费率1反向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00008052//当前费率1反向有功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00011052//当前费率2反向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00018052//当前费率2反向有功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00021052//当前费率3反向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00028052//当前费率3反向有功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00031052//当前费率4反向有功最大需量
	dcb 4//返回长度
//	dcdu 0x00038052//当前费率4反向有功最大需量发生时间
	dcb 6//返回长度
	ALIGN
}	

//F148：当月反向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_HX_6E_F148_Lib(void)
{
	dcb 148//实时Fn
	dcb 10//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 192//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00091252//当前反向无功总最大需量
	dcb 0//返回长度
	dcdu 0x00098252//当前反向无功总最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00001252//当前费率1反向无功最大需量
	dcb 0//返回长度
	dcdu 0x00008252//当前费率1反向无功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00011252//当前费率2反向无功最大需量
	dcb 0//返回长度
	dcdu 0x00018252//当前费率2反向无功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00021252//当前费率3反向无功最大需量
	dcb 0//返回长度
	dcdu 0x00028252//当前费率3反向无功最大需量发生时间
	dcb 0//返回长度
	dcdu 0x00031252//当前费率4反向无功最大需量
	dcb 0//返回长度
	dcdu 0x00038252//当前费率4反向无功最大需量发生时间
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00091252//当前反向无功总最大需量
	dcb 4//返回长度
//	dcdu 0x00098252//当前反向无功总最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00001252//当前费率1反向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00008252//当前费率1反向无功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00011252//当前费率2反向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00018252//当前费率2反向无功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00021252//当前费率3反向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00028252//当前费率3反向无功最大需量发生时间
	dcb 6//返回长度
//	dcdu 0x00031252//当前费率4反向无功最大需量
	dcb 4//返回长度
//	dcdu 0x00038252//当前费率4反向无功最大需量发生时间
	dcb 6//返回长度
	ALIGN
}	

__asm void ADDR_RM_HX_6E_F25_Lib(void)
{
	dcb 25//实时Fn
	dcb 15//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	
	dcdu 0x0033E052//当前总有功功率
	dcb 0//返回长度
	dcdu 0x0030E052//当前A相有功功率
	dcb 0//返回长度
	dcdu 0x0031E052//当前B相有功功率
	dcb 0//返回长度
	dcdu 0x0032E052//当前C相有功功率
	dcb 0//返回长度
	dcdu 0x0043E052//当前总无功功率
	dcb 0//返回长度
	dcdu 0x0040E052//当前A相无功功率
	dcb 0//返回长度
	dcdu 0x0041E052//当前B相无功功率
	dcb 0//返回长度
	dcdu 0x0042E052//当前C相无功功率
	dcb 0//返回长度
	dcdu 0x0026E052//当前功率因数
	dcb 0//返回长度
	dcdu 0x0000E052//A相电压
	dcb 0//返回长度
	dcdu 0x0001E052//B相电压
	dcb 0//返回长度
	dcdu 0x0002E052//C相电压
	dcb 0//返回长度
	dcdu 0x0010E052//A相电流
	dcb 0//返回长度
	dcdu 0x0011E052//B相电流
	dcb 0//返回长度
	dcdu 0x0012E052//C相电流
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0033E052
	dcb 4//返回长度
//	dcdu 0x0030E052
	dcb 4//返回长度
//	dcdu 0x0031E052
	dcb 4//返回长度
//	dcdu 0x0032E052
	dcb 4//返回长度
//	dcdu 0x0043E052
	dcb 4//返回长度
//	dcdu 0x0040E052
	dcb 4//返回长度
//	dcdu 0x0041E052
	dcb 4//返回长度
//	dcdu 0x0042E052
	dcb 4//返回长度
//	dcdu 0x0026E052
	dcb 4//返回长度
//	dcdu 0x0000E052
	dcb 4//返回长度
//	dcdu 0x0001E052
	dcb 4//返回长度
//	dcdu 0x0002E052
	dcb 4//返回长度
//	dcdu 0x0010E052
	dcb 4//返回长度
//	dcdu 0x0011E052
	dcb 4//返回长度
//	dcdu 0x0012E052
	dcb 4//返回长度
	ALIGN
}

__asm void ADDR_RM_HX_6E_F27_Lib(void)
{
	dcb 27//实时Fn
	dcb 2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	
	dcdu 0x0011f052//时间（时分秒）
	dcb 0//返回长度
	dcdu 0x0010f052//日期（日月年）
	dcb 0//返回长度
//	dcdu 0x0032f052//复位次数 //MK6  dcdu 0x003df052  //这个是mk3
//	dcb 0//返回长度
//	dcdu 0x0000fc52//最近一次计费复位时间 日月年时分秒	6
//	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0011f052//时间
	dcb 3//返回长度
//	dcdu 0x0010f052//日期
	dcb 3//返回长度
////	dcdu 0x0032f052//MK6  dcdu 0x003df052  //这个是mk3
//	dcb 4//返回长度
////	dcdu 0x0000fc52
//	dcb 6//返回长度
	ALIGN
}

__asm void ADDR_RM_HX_6E_F49_Lib(void)
{
	dcb 49//实时Fn
	dcb 6//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	
	dcdu 0x002ae052//Ua相位角（MK6）
	dcb 0//返回长度
	dcdu 0x002be052//Ub相位角（MK6）
	dcb 0//返回长度
	dcdu 0x002ce052//Uc相位角（MK6）
	dcb 0//返回长度
	dcdu 0x0027e052//Ia相位角（MK6）
	dcb 0//返回长度
	dcdu 0x0028e052//Ib相位角（MK6）
	dcb 0//返回长度
	dcdu 0x0029e052//Ic相位角（MK6）
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x002ae052
	dcb 4//返回长度
//	dcdu 0x002be052
	dcb 4//返回长度
//	dcdu 0x002ce052
	dcb 4//返回长度
//	dcdu 0x0027e052
	dcb 4//返回长度
//	dcdu 0x0028e052
	dcb 4//返回长度
//	dcdu 0x0029e052
	dcb 4//返回长度
	ALIGN
}

__asm void ADDR_RM_HX_6E_F162_Lib(void)
{
	dcb 162//实时Fn
	dcb 2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	
	dcdu 0x0011f052//时间（时分秒）
	dcb 0//返回长度
	dcdu 0x0010f052//日期（日月年）
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0011f052//时间
	dcb 3//返回长度
//	dcdu 0x0010f052//日期
	dcb 3//返回长度
	ALIGN
}

const u32 HX_6E_RMLib[]=
{
//F0 通用
//	(u32)ADDR_RM_HX_6E_F0_Lib,


//F129第1个抄,用以判断通信是否正常
//0 F129 当前正向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F129_Lib,
//	(u32)ADDR_RM_HX_6E_F148_Lib,
//1 F130 当前正向无功（组合无功1）电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F130_Lib,
//2 F131 当前反向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F131_Lib,
//3 F132 当前反向无功（组合无功2）电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F132_Lib,
//4 F133 当前一象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F133_Lib,
//5 F134 当前二象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F134_Lib,
//6 F135 当前三象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F135_Lib,
//7 F136 当前四象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F136_Lib,
//8 F137 上月（上一结算日）正向有功电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F137_Lib,
//9 F138 上月（上一结算日）正向无功（组合无功1）电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F138_Lib,
//10 F139 上月（上一结算日）反向有功电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F139_Lib,
//11 F140 上月（上一结算日）反向无功（组合无功2）电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F140_Lib,
//12 F141 上月（上一结算日）一象限无功电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F141_Lib,
//13 F142 上月（上一结算日）二象限无功电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F142_Lib,
//14 F143 上月（上一结算日）三象限无功电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F143_Lib,
//15 F144 上月（上一结算日）四象限无功电能示值（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F144_Lib,
//16 F145 当月正向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F145_Lib,
//17 F146 当月正向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F146_Lib,
//18 F147 当月反向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F147_Lib,
//19 F148 当月反向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_HX_6E_F148_Lib,
//20 F149 上月（上一结算日）正向有功最大需量及发生时间（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F149_Lib,
//21 F150 上月（上一结算日）正向无功最大需量及发生时间（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F150_Lib,
//22 F151 上月（上一结算日）反向有功最大需量及发生时间（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F151_Lib,
//23 F152 上月（上一结算日）反向无功最大需量及发生时间（总、费率1～M）
//	(u32)ADDR_RM_HX_6E_F152_Lib,
//
////24 F28 电表运行状态字及其变位标志
//	(u32)ADDR_RM_HX_6E_F28_Lib,
//25 F25 当前三相及总有/无功功率、功率因数，三相电压、电流、零序电流、视在功率
	(u32)ADDR_RM_HX_6E_F25_Lib,
//26 F26 A、B、C三相断相统计数据及最近一次断相记录
//	(u32)ADDR_RM_HX_6E_F26_Lib,
//27 F27 电能表日历时钟、编程次数及其最近一次操作时间
	(u32)ADDR_RM_HX_6E_F27_Lib,
////28 F29 当前铜损、铁损有功总电能示值
//	(u32)ADDR_RM_HX_6E_F29_Lib,
////29 F30 上一结算日铜损、铁损有功总电能示值
//	(u32)ADDR_RM_HX_6E_F30_Lib,
////30 F31 当前A、B、C三相正/反向有功电能示值、组合无功1/2电能示值
//	(u32)ADDR_RM_HX_6E_F31_Lib,
////31 F32 上一结算日A、B、C三相正/反向有功电能示值、组合无功1/2电能示值
//	(u32)ADDR_RM_HX_6E_F32_Lib,
//
//32 F49 当前电压、电流相位角(外部458表)
	(u32)ADDR_RM_HX_6E_F49_Lib,
//33 F162 电能表日历时钟
	(u32)ADDR_RM_HX_6E_F162_Lib,

};


u32 Get_RM_HX_6E_MaxFn(void)
{
	return (sizeof(HX_6E_RMLib)/4);
}

u32 Get_RM_HX_6E_FnCount(u32 Fn)//得到Fn值的相应抄表计数号;返回0xffffffff表示没找到
{
	u32 i;
	u32 MaxFnCount;
	u8 * p8RMLib;

	MaxFnCount=Get_RM_HX_6E_MaxFn();
	for(i=0;i<MaxFnCount;i++)
	{
		p8RMLib=(u8 *)HX_6E_RMLib[i];
		if(Fn==p8RMLib[0])
		{
			return i;
		}
	}
	return 0xffffffff;
}

#endif

													












