
//Terminal_ReadMeter_DL645_2007_Lib
#include "Project.h"
#include "Terminal_ReadMeter_DL645_2007_Lib.h"
#include "Terminal_AFN0E_Event.h"


//F0 通用
__asm void ADDR_RM_DL645_2007_F0_Lib(void)
{
	dcb 0//实时Fn
	dcb 0//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}

//F1 重点户曲线(仅对无曲线冻结的单相表)			   
__asm void ADDR_RM_DL645_2007_F1_Lib(void)
{
	dcb 1//实时Fn
#if (USER==600)||((USER/100)==5)//是湖南但不是湘潭,或上海
	dcb 4//通信标识个数
#else
	dcb 3//通信标识个数
#endif
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb HourTask<<2//2_00000100//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x02010100//A相电压
	dcb 2//返回长度
	dcdu 0x00010000//当前正向有功总电能示值
	dcb 4//返回长度
	dcdu 0x00020000//当前反向有功总电能示值
	dcb 4//返回长度
#if (USER==600)||((USER/100)==5)//是湖南但不是湘潭,或上海
	dcdu 0x02020100//A相电流
	dcb 3//返回长度
#endif
	ALIGN
}

//F2 电能表主动上报事件
__asm void ADDR_RM_DL645_2007_F2_Lib(void)
{
	dcb 2//实时Fn
	dcb 2+(96*2)+2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if EnMeterAutoAutoReport==0//允许电能表主动上报事件:0=不允许,1=允许
	dcb 0//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	
	dcdu 0//保留
	dcb 0//返回长度
	dcdu 0x04001501//读主动上报状态字(仅当鼎信模块时)
	dcb 0//返回长度
	
	dcdu 0x03360000//1 B0负荷开关误动或拒动次数
	dcb 3//返回长度
	dcdu 0x03360001//B0负荷开关误动或拒动
	dcb 29//返回长度
	dcdu 0//B1 ESAM错误次数
	dcb 0//返回长度
	dcdu 0//B1 ESAM错误
	dcb 0//返回长度
	dcdu 0//B2 内卡初始化错误次数
	dcb 0//返回长度
	dcdu 0//B2 内卡初始化错误
	dcb 0//返回长度
	dcdu 0//B3 时钟电池电压低次数
	dcb 0//返回长度
	dcdu 0//B3 时钟电池电压低
	dcb 0//返回长度
	dcdu 0//B4 内部程序错误次数
	dcb 0//返回长度
	dcdu 0//B4 内部程序错误
	dcb 0//返回长度
	dcdu 0//B5 存储器故障或损坏次数
	dcb 0//返回长度
	dcdu 0//B5 存储器故障或损坏
	dcb 0//返回长度
	dcdu 0//B6保留
	dcb 0//返回长度
	dcdu 0//B6保留
	dcb 0//返回长度
	dcdu 0//B7 时钟故障次数
	dcb 0//返回长度
	dcdu 0//B7 时钟故障
	dcb 0//返回长度
	dcdu 0//B8 停电抄表电池欠压次数
	dcb 0//返回长度
	dcdu 0//B8 停电抄表电池欠压
	dcb 0//返回长度
	dcdu 0//B9 透支状态次数
	dcb 0//返回长度
	dcdu 0//B9 透支状态
	dcb 0//返回长度
	dcdu 0x03300D00//2 B10开表盖次数
	dcb 3//返回长度
	dcdu 0x03300D01//B10开表盖
	dcb 60//返回长度
	dcdu 0x03300E00//3 B11开端钮盖次数
	dcb 3//返回长度
	dcdu 0x03300E01//B11开端钮盖
	dcb 60//返回长度
	dcdu 0x03350000//4 B12恒定磁场干扰次数
	dcb 3//返回长度
	dcdu 0x03350001//B12恒定磁场干扰
	dcb 28//返回长度
	dcdu 0x03370000//5 B13电源异常次数
	dcb 3//返回长度
	dcdu 0x03370001//B13电源异常
	dcb 20//返回长度
	dcdu 0x1D000001//6 B14跳闸成功次数
	dcb 3//返回长度
	dcdu 0x1D00FF01//B14跳闸成功
	dcb 34//返回长度
	dcdu 0x1E000001//7 B15合闸成功次数
	dcb 3//返回长度
	dcdu 0x1E00FF01//B15合闸成功
	dcb 34//返回长度
	dcdu 0x10010001//8 B16 A相失压次数
	dcb 3//返回长度
	dcdu 0x1001FF01//B16 A相失压
	dcb 195//返回长度
	dcdu 0x11010001//9 B17 A相欠压次数
	dcb 3//返回长度
	dcdu 0x1101FF01//B17 A相欠压
	dcb 195//返回长度
	dcdu 0x12010001//10 B18 A相过压次数
	dcb 3//返回长度
	dcdu 0x1201FF01//B18 A相过压
	dcb 195//返回长度
	dcdu 0x18010001//11 B19 A相失流次数
	dcb 3//返回长度
	dcdu 0x1801FF01//B19 A相失流
	dcb 179//返回长度
	dcdu 0x19010001//12 B20 A相过流次数
	dcb 3//返回长度
	dcdu 0x1901FF01//B20 A相过流
	dcb 179//返回长度
	dcdu 0x1C010001//13 B21 A相过载次数
	dcb 3//返回长度
	dcdu 0x1C01FF01//B21 A相过载
	dcb 140//返回长度
	dcdu 0x1B010001//14 B22 A相功率反向次数
	dcb 3//返回长度
	dcdu 0x1B01FF01//B22 A相功率反向
	dcb 140//返回长度
	dcdu 0x13010001//15 B23 A相断相次数
	dcb 3//返回长度
	dcdu 0x1301FF01//B23 A相断相
	dcb 195//返回长度
	dcdu 0x1A010001//16 B24 A相断流次数
	dcb 3//返回长度
	dcdu 0x1A01FF01//B24 A相断流
	dcb 179//返回长度
	dcdu 0//B25保留
	dcb 0//返回长度
	dcdu 0//B25保留
	dcb 0//返回长度
	dcdu 0//B26保留
	dcb 0//返回长度
	dcdu 0//B26保留
	dcb 0//返回长度
	dcdu 0//B27保留
	dcb 0//返回长度
	dcdu 0//B27保留
	dcb 0//返回长度
	dcdu 0//B28保留
	dcb 0//返回长度
	dcdu 0//B28保留
	dcb 0//返回长度
	dcdu 0//B29保留
	dcb 0//返回长度
	dcdu 0//B29保留
	dcb 0//返回长度
	dcdu 0//B30保留
	dcb 0//返回长度
	dcdu 0//B30保留
	dcb 0//返回长度
	dcdu 0//B31保留
	dcb 0//返回长度
	dcdu 0//B31保留
	dcb 0//返回长度
	dcdu 0x10020001//17 B32 B相失压次数
	dcb 3//返回长度
	dcdu 0x1002FF01//B32 B相失压
	dcb 195//返回长度
	dcdu 0x11020001//18 B33 B相欠压次数
	dcb 3//返回长度
	dcdu 0x1102FF01//B33 B相欠压
	dcb 195//返回长度
	dcdu 0x12020001//19 B34 B相过压次数
	dcb 3//返回长度
	dcdu 0x1202FF01//B34 B相过压
	dcb 195//返回长度
	dcdu 0x18020001//20 B35 B相失流次数
	dcb 3//返回长度
	dcdu 0x1802FF01//B35 B相失流
	dcb 179//返回长度
	dcdu 0x19020001//21 B36 B相过流次数
	dcb 3//返回长度
	dcdu 0x1902FF01//B36 B相过流
	dcb 179//返回长度
	dcdu 0x1C020001//22 B37 B相过载次数
	dcb 3//返回长度
	dcdu 0x1C02FF01//B37 B相过载
	dcb 140//返回长度
	dcdu 0x1B020001//23 B38 B相功率反向次数
	dcb 3//返回长度
	dcdu 0x1B02FF01//B38 B相功率反向
	dcb 140//返回长度
	dcdu 0x13020001//24 B39 B相断相次数
	dcb 3//返回长度
	dcdu 0x1302FF01//B39 B相断相
	dcb 195//返回长度
	dcdu 0x1A020001//25 B40 B相断流次数
	dcb 3//返回长度
	dcdu 0x1A02FF01//B40 B相断流
	dcb 179//返回长度
	dcdu 0//B41 保留
	dcb 0//返回长度
	dcdu 0//B41 保留
	dcb 0//返回长度
	dcdu 0//B42 保留
	dcb 0//返回长度
	dcdu 0//B42 保留
	dcb 0//返回长度
	dcdu 0//B43保留
	dcb 0//返回长度
	dcdu 0//B43保留
	dcb 0//返回长度
	dcdu 0//B44保留
	dcb 0//返回长度
	dcdu 0//B44保留
	dcb 0//返回长度
	dcdu 0//B45保留
	dcb 0//返回长度
	dcdu 0//B45保留
	dcb 0//返回长度
	dcdu 0//B46保留
	dcb 0//返回长度
	dcdu 0//B46保留
	dcb 0//返回长度
	dcdu 0//B47保留
	dcb 0//返回长度
	dcdu 0//B47保留
	dcb 0//返回长度
	dcdu 0x10030001//26 B48 C相失压次数
	dcb 3//返回长度
	dcdu 0x1003FF01//B48 C相失压
	dcb 195//返回长度
	dcdu 0x11030001//27 B49 C相欠压次数
	dcb 3//返回长度
	dcdu 0x1103FF01//B49 C相欠压
	dcb 195//返回长度
	dcdu 0x12030001//28 B50 C相过压次数
	dcb 3//返回长度
	dcdu 0x1203FF01//B50 C相过压
	dcb 195//返回长度
	dcdu 0x18030001//29 B51 C相失流次数
	dcb 3//返回长度
	dcdu 0x1803FF01//B51 C相失流
	dcb 179//返回长度
	dcdu 0x19030001//30 B52 C相过流次数
	dcb 3//返回长度
	dcdu 0x1903FF01//B52 C相过流
	dcb 179//返回长度
	dcdu 0x1C030001//31 B53 C相过载次数
	dcb 3//返回长度
	dcdu 0x1C03FF01//B53 C相过载
	dcb 140//返回长度
	dcdu 0x1B030001//32 B54 C相功率反向次数
	dcb 3//返回长度
	dcdu 0x1B03FF01//B54 C相功率反向
	dcb 140//返回长度
	dcdu 0x13030001//33 B55 C相断相次数
	dcb 3//返回长度
	dcdu 0x1303FF01//B55 C相断相
	dcb 195//返回长度
	dcdu 0x1A030001//34 B56 C相断流次数
	dcb 3//返回长度
	dcdu 0x1A03FF01//B56 C相断流
	dcb 179//返回长度
	dcdu 0//B57 保留
	dcb 0//返回长度
	dcdu 0//B57 保留
	dcb 0//返回长度
	dcdu 0//B58 保留
	dcb 0//返回长度
	dcdu 0//B58 保留
	dcb 0//返回长度
	dcdu 0//B59 保留
	dcb 0//返回长度
	dcdu 0//B59 保留
	dcb 0//返回长度
	dcdu 0//B60 保留
	dcb 0//返回长度
	dcdu 0//B60 保留
	dcb 0//返回长度
	dcdu 0//B61 保留
	dcb 0//返回长度
	dcdu 0//B61 保留
	dcb 0//返回长度
	dcdu 0//B62 保留
	dcb 0//返回长度
	dcdu 0//B62 保留
	dcb 0//返回长度
	dcdu 0//B63 保留
	dcb 0//返回长度
	dcdu 0//B63 保留
	dcb 0//返回长度
	dcdu 0x14000001//35 B64电压逆相序次数
	dcb 3//返回长度
	dcdu 0x1400FF01//B64电压逆相序
	dcb 140//返回长度
	dcdu 0x15000001//36 B65电流逆相序次数
	dcb 3//返回长度
	dcdu 0x1500FF01//B65电流逆相序
	dcb 140//返回长度
	dcdu 0x16000001//37 B66电压不平衡次数
	dcb 3//返回长度
	dcdu 0x1600FF01//B66电压不平衡
	dcb 143//返回长度
	dcdu 0x17000001//38 B67电流不平衡次数
	dcb 3//返回长度
	dcdu 0x1700FF01//B67电流不平衡
	dcb 143//返回长度
	dcdu 0x03060000//39 B68辅助电源失电次数
	dcb 6//总次数3总累计时间3//返回长度
	dcdu 0x03060001//B68辅助电源失电
	dcb 12//返回长度
	dcdu 0x03110000//40 B69掉电次数
	dcb 3//返回长度
	dcdu 0x03110001//B69掉电
	dcb 12//返回长度
	dcdu 0x03120000//41 B70需量超限次数(有正反向有功或4象限无功???)
	dcb 18//返回长度
	dcdu 0x03120101//B70需量超限(有正反向有功或4象限无功???)
	dcb 20//返回长度
	dcdu 0x1F000001//42 B71总功率因数超下限次数
	dcb 3//返回长度
	dcdu 0x1F00FF01//B71总功率因数超下限
	dcb 44//返回长度
	dcdu 0x20000001//43 B72电流严重不平衡次数
	dcb 3//返回长度
	dcdu 0x2000FF01//B72电流严重不平衡
	dcb 143//返回长度
	dcdu 0x21000000//44 B73潮流反向次数
	dcb 3//返回长度
	dcdu 0x21000001//B73潮流反向
	dcb 71//返回长度
	dcdu 0x03050000//45 B74全失压次数
	dcb 6//总次数3总累计时间3//返回长度
	dcdu 0x03050001//B74全失压
	dcb 15//返回长度
	dcdu 0//B75保留
	dcb 0//返回长度
	dcdu 0//B75保留
	dcb 0//返回长度
	dcdu 0//B76保留
	dcb 0//返回长度
	dcdu 0//B76保留
	dcb 0//返回长度
	dcdu 0//B77保留
	dcb 0//返回长度
	dcdu 0//B77保留
	dcb 0//返回长度
	dcdu 0//B78保留
	dcb 0//返回长度
	dcdu 0//B78保留
	dcb 0//返回长度
	dcdu 0//B79保留
	dcb 0//返回长度
	dcdu 0//B79保留
	dcb 0//返回长度
	dcdu 0x03300000//46 B80编程次数
	dcb 3//返回长度
	dcdu 0x03300001//B80编程
	dcb 50//返回长度
	dcdu 0x03300100//47 B81电表清零次数
	dcb 3//返回长度
	dcdu 0x03300101//B81电表清零
	dcb 106//返回长度
	dcdu 0x03300200//48 B82需量清零次数
	dcb 3//返回长度
	dcdu 0x03300201//B82需量清零
	dcb 0//202//返回长度
	dcdu 0x03300300//49 B83事件清零次数
	dcb 3//返回长度
	dcdu 0x03300301//B83事件清零
	dcb 14//返回长度
	dcdu 0x03300400//50 B84校时次数
	dcb 3//返回长度
	dcdu 0x03300401//B84校时
	dcb 16//返回长度
	dcdu 0x03300500//51 B85时段表编程次数
	dcb 3//返回长度
	dcdu 0x03300501//B85时段表编程
	dcb 0//682//返回长度
	dcdu 0x03300600//52 B86时区表编程次数
	dcb 3//返回长度
	dcdu 0x03300601//B86时区表编程
	dcb 94//返回长度
	dcdu 0x03300700//53 B87周休日编程次数
	dcb 3//返回长度
	dcdu 0x03300701//B87周休日编程
	dcb 11//返回长度
	dcdu 0x03300800//54 B88节假日编程次数
	dcb 3//返回长度
	dcdu 0x03300801//B88节假日编程
	dcb 0//1026//返回长度
	dcdu 0x03300900//55 B89有功组合方式编程次数
	dcb 3//返回长度
	dcdu 0x03300901//B89有功组合方式编程
	dcb 11//返回长度
	dcdu 0x03300A00//56 B90无功组合方式1编程次数
	dcb 3//返回长度
	dcdu 0x03300A01//B90无功组合方式1编程
	dcb 11//返回长度
	dcdu 0x03300B00//57 B91无功组合方式2编程次数
	dcb 3//返回长度
	dcdu 0x03300B01//B91无功组合方式2编程
	dcb 11//返回长度
	dcdu 0x03300C00//58 B92结算日编程次数
	dcb 3//返回长度
	dcdu 0x03300C01//B92结算日编程
	dcb 16//返回长度
	dcdu 0x03300F00//59 B93费率参数表编程次数
	dcb 3//返回长度
	dcdu 0x03300F01//B93费率参数表编程
	dcb 42//费率1~N（N<=32）按费率4计算,这里暂用42原因是载波需预计返回字节数
	dcdu 0x03301000//60 B94阶梯表编程次数
	dcb 3//返回长度
	dcdu 0x03301001//B94阶梯表编程
	dcb 138//返回长度//实际帧返回长度非定长,这里暂用138原因是载波需预计返回字节数
	dcdu 0x03301200//61 B95密钥更新次数
	dcb 3//返回长度
	dcdu 0x03301201//B95密钥更新
	dcb 15//返回长度
	
	dcdu 0//62 复位主动上报状态字
	dcb 0//返回长度
	dcdu 0x04001501//63 读主动上报状态字
	dcb 0//返回长度
	
	ALIGN
}


//F3 周期抄读电能表事件
#if ((USER/100)==5)//上海用户
__asm void ADDR_RM_DL645_2007_F3_Lib(void)
{
	dcb 3//实时Fn
#if EnMeterAutoAutoReport==0//允许电能表主动上报事件:0=不允许,1=允许
	dcb (60)*3+4//通信标识个数
#else
	dcb (60)*3//通信标识个数
#endif
#if NUM_MeterEventDI!=(60+6)//抄读的标识个数
	#error "NUM_MeterEventDI!=(60+6)"
#endif
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if EventProject==0//事件记录采集方案:0=原能走台体标准,1=按新智能电能表及采集终端事件记录采集规则
	dcb 0//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	
	dcdu 0x03360000//1 B0负荷开关误动或拒动次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03360001//B0负荷开关误动或拒动
	dcb 29//返回长度

	dcdu 0x03300D00//2 B10开表盖次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300D01//B10开表盖
	dcb 60//返回长度

	dcdu 0x03300E00//3 B11开端钮盖次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300E01//B11开端钮盖
	dcb 60//返回长度

	dcdu 0x03350000//4 B12恒定磁场干扰次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03350001//B12恒定磁场干扰
	dcb 28//返回长度

	dcdu 0x03370000//5 B13电源异常次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03370001//B13电源异常
	dcb 20//返回长度

	dcdu 0x1D000001//6 B14跳闸成功次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1D00FF01//B14跳闸成功
	dcb 34//返回长度

	dcdu 0x1E000001//7 B15合闸成功次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1E00FF01//B15合闸成功
	dcb 34//返回长度

	dcdu 0x10010001//8 B16 A相失压次数
	dcb 3//返回长度
	dcdu 0x10010002//B16 A相失压总累计时间
	dcb 3
	dcdu 0x1001FF01//B16 A相失压
	dcb 195//返回长度

	dcdu 0x11010001//9 B17 A相欠压次数
	dcb 3//返回长度
	dcdu 0x11010002//B17 A相欠压总累计时间
	dcb 3
	dcdu 0x1101FF01//B17 A相欠压
	dcb 195//返回长度

	dcdu 0x12010001//10 B18 A相过压次数
	dcb 3//返回长度
	dcdu 0x12010002//B18 A相过压总累计时间
	dcb 3
	dcdu 0x1201FF01//B18 A相过压
	dcb 195//返回长度

	dcdu 0x18010001//11 B19 A相失流次数
	dcb 3//返回长度
	dcdu 0x18010002//B19 A相失流总累计时间
	dcb 3
	dcdu 0x1801FF01//B19 A相失流
	dcb 179//返回长度

	dcdu 0x19010001//12 B20 A相过流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1901FF01//B20 A相过流
	dcb 179//返回长度

	dcdu 0x1C010001//13 B21 A相过载次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1C01FF01//B21 A相过载
	dcb 140//返回长度

	dcdu 0x1B010001//14 B22 A相功率反向次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1B01FF01//B22 A相功率反向
	dcb 140//返回长度

	dcdu 0x13010001//15 B23 A相断相次数
	dcb 3//返回长度
	dcdu 0x13010002//B23 A相断相总累计时间
	dcb 3
	dcdu 0x1301FF01//B23 A相断相
	dcb 195//返回长度

	dcdu 0x1A010001//16 B24 A相断流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1A01FF01//B24 A相断流
	dcb 179//返回长度

	dcdu 0x10020001//17 B32 B相失压次数
	dcb 3//返回长度
	dcdu 0x10020002//B32 B相失压总累计时间
	dcb 3
	dcdu 0x1002FF01//B32 B相失压
	dcb 195//返回长度

	dcdu 0x11020001//18 B33 B相欠压次数
	dcb 3//返回长度
	dcdu 0x11020002//B33 B相欠压总累计时间
	dcb 3
	dcdu 0x1102FF01//B33 B相欠压
	dcb 195//返回长度

	dcdu 0x12020001//19 B34 B相过压次数
	dcb 3//返回长度
	dcdu 0x12020002//B34 B相过压总累计时间
	dcb 3
	dcdu 0x1202FF01//B34 B相过压
	dcb 195//返回长度

	dcdu 0x18020001//20 B35 B相失流次数
	dcb 3//返回长度
	dcdu 0x18020002//B35 B相失流总累计时间
	dcb 3
	dcdu 0x1802FF01//B35 B相失流
	dcb 179//返回长度

	dcdu 0x19020001//21 B36 B相过流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1902FF01//B36 B相过流
	dcb 179//返回长度

	dcdu 0x1C020001//22 B37 B相过载次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1C02FF01//B37 B相过载
	dcb 140//返回长度

	dcdu 0x1B020001//23 B38 B相功率反向次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1B02FF01//B38 B相功率反向
	dcb 140//返回长度

	dcdu 0x13020001//24 B39 B相断相次数
	dcb 3//返回长度
	dcdu 0x13020002//B39 B相断相总累计时间
	dcb 3
	dcdu 0x1302FF01//B39 B相断相
	dcb 195//返回长度

	dcdu 0x1A020001//25 B40 B相断流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1A02FF01//B40 B相断流
	dcb 179//返回长度

	dcdu 0x10030001//26 B48 C相失压次数
	dcb 3//返回长度
	dcdu 0x10030002//B48 C相失压总累计时间
	dcb 3
	dcdu 0x1003FF01//B48 C相失压
	dcb 195//返回长度

	dcdu 0x11030001//27 B49 C相欠压次数
	dcb 3//返回长度
	dcdu 0x11030002//B49 C相欠压总累计时间
	dcb 3
	dcdu 0x1103FF01//B49 C相欠压
	dcb 195//返回长度

	dcdu 0x12030001//28 B50 C相过压次数
	dcb 3//返回长度
	dcdu 0x12030002//B50 C相过压总累计时间
	dcb 3
	dcdu 0x1203FF01//B50 C相过压
	dcb 195//返回长度

	dcdu 0x18030001//29 B51 C相失流次数
	dcb 3//返回长度
	dcdu 0x18030002//B51 C相失流总累计时间
	dcb 3
	dcdu 0x1803FF01//B51 C相失流
	dcb 179//返回长度

	dcdu 0x19030001//30 B52 C相过流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1903FF01//B52 C相过流
	dcb 179//返回长度

	dcdu 0x1C030001//31 B53 C相过载次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1C03FF01//B53 C相过载
	dcb 140//返回长度

	dcdu 0x1B030001//32 B54 C相功率反向次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1B03FF01//B54 C相功率反向
	dcb 140//返回长度

	dcdu 0x13030001//33 B55 C相断相次数
	dcb 3//返回长度
	dcdu 0x13030002//B55 C相断相总累计时间
	dcb 3
	dcdu 0x1303FF01//B55 C相断相
	dcb 195//返回长度

	dcdu 0x1A030001//34 B56 C相断流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1A03FF01//B56 C相断流
	dcb 179//返回长度

	dcdu 0x14000001//35 B64 电压逆相序次数
	dcb 3//返回长度
	dcdu 0x14000002//B64 电压逆相序总累计时间
	dcb 3
	dcdu 0x1400FF01//B64 电压逆相序
	dcb 140//返回长度

	dcdu 0x15000001//36 B65 电流逆相序次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1500FF01//B65 电流逆相序
	dcb 140//返回长度

	dcdu 0x16000001//37 B66 电压不平衡次数
	dcb 3//返回长度
	dcdu 0x16000002//B66 电压不平衡总累计时间
	dcb 3
	dcdu 0x1600FF01//B66 电压不平衡
	dcb 143//返回长度

	dcdu 0x17000001//38 B67 电流不平衡次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1700FF01//B67 电流不平衡
	dcb 143//返回长度

	dcdu 0x03060000//39 B68 辅助电源失电次数
	dcb 6//总次数3总累计时间3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03060001//B68 辅助电源失电
	dcb 12//返回长度

	dcdu 0x03110000//40 B69 掉电次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03110001//B69 掉电
	dcb 12//返回长度
	
	dcdu 0x1F000001//41 B71 总功率因数超下限次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x1F00FF01//B71 总功率因数超下限
	dcb 44//返回长度

	dcdu 0x20000001//42 B72 电流严重不平衡次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x2000FF01//B72 电流严重不平衡
	dcb 143//返回长度

	dcdu 0x21000000//43 B73 潮流反向次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x21000001//B73 潮流反向
	dcb 71//返回长度

	dcdu 0x03050000//44 B74 全失压次数
	dcb 6//总次数3总累计时间3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03050001//B74 全失压
	dcb 15//返回长度

	dcdu 0x03300000//45 B80 编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300001//B80 编程
	dcb 50//返回长度

	dcdu 0x03300100//46 B81 电表清零次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300101//B81 电表清零
	dcb 106//返回长度

	dcdu 0x03300200//47 B82 需量清零次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300201//B82 需量清零
	dcb 0//202//返回长度

	dcdu 0x03300300//48 B83 事件清零次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300301//B83 事件清零
	dcb 14//返回长度

	dcdu 0x03300400//49 B84 校时次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300401//B84 校时
	dcb 16//返回长度

	dcdu 0x03300500//50 B85 时段表编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300501//B85 时段表编程
	dcb 0//682//返回长度

	dcdu 0x03300600//51 B86 时区表编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300601//B86 时区表编程
	dcb 94//返回长度

	dcdu 0x03300700//52 B87 周休日编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300701//B87 周休日编程
	dcb 11//返回长度

	dcdu 0x03300800//53 B88 节假日编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300801//B88 节假日编程
	dcb 0//1026//返回长度

	dcdu 0x03300900//54 B89 有功组合方式编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300901//B89 有功组合方式编程
	dcb 11//返回长度

	dcdu 0x03300A00//55 B90 无功组合方式1编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300A01//B90 无功组合方式1编程
	dcb 11//返回长度

	dcdu 0x03300B00//56 B91 无功组合方式2编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300B01//B91 无功组合方式2编程
	dcb 11//返回长度

	dcdu 0x03300C00//57 B92 结算日编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300C01//B92 结算日编程
	dcb 16//返回长度

	dcdu 0x03300F00//58 B93 费率参数表编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03300F01//B93 费率参数表编程
	dcb 0//费率1~N（N<=32）按费率4计算//返回长度

	dcdu 0x03301000//59 B94 阶梯表编程次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03301001//B94 阶梯表编程
	dcb 0//返回长度

	dcdu 0x03301200//60 B95 密钥更新次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x03301201//B95 密钥更新
	dcb 15//返回长度

#if EnMeterAutoAutoReport==0//允许电能表主动上报事件:0=不允许,1=允许
	dcdu 0x04001501//读主动上报状态字bit5,bit7
	dcb 0//返回长度
	dcdu 0//复位主动上报状态字bit5,bit7
	dcb 0//返回长度
	dcdu 0
	dcb 0
	dcdu 0x040005ff//电表运行状态字bit2,bit3
	dcb 0//14//18//返回长度
#endif

//当正确返回长度=0时的预计返回字节数
//	dcdu 0x03360000//1 B0负荷开关误动或拒动次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03360001//B0负荷开关误动或拒动
	dcb 29//返回长度

//	dcdu 0x03300D00//2 B10开表盖次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300D01//B10开表盖
	dcb 60//返回长度

//	dcdu 0x03300E00//3 B11开端钮盖次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300E01//B11开端钮盖
	dcb 60//返回长度

//	dcdu 0x03350000//4 B12恒定磁场干扰次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03350001//B12恒定磁场干扰
	dcb 28//返回长度

//	dcdu 0x03370000//5 B13电源异常次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03370001//B13电源异常
	dcb 20//返回长度

//	dcdu 0x1D000001//6 B14跳闸成功次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1D00FF01//B14跳闸成功
	dcb 34//返回长度

//	dcdu 0x1E000001//7 B15合闸成功次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1E00FF01//B15合闸成功
	dcb 34//返回长度

//	dcdu 0x10010001//8 B16 A相失压次数
	dcb 3//返回长度
//	dcdu 0x10010002//B16 A相失压总累计时间
	dcb 3
//	dcdu 0x1001FF01//B16 A相失压
	dcb 195//返回长度

//	dcdu 0x11010001//9 B17 A相欠压次数
	dcb 3//返回长度
//	dcdu 0x11010002//B17 A相欠压总累计时间
	dcb 3
//	dcdu 0x1101FF01//B17 A相欠压
	dcb 195//返回长度

//	dcdu 0x12010001//10 B18 A相过压次数
	dcb 3//返回长度
//	dcdu 0x12010002//B18 A相过压总累计时间
	dcb 3
//	dcdu 0x1201FF01//B18 A相过压
	dcb 195//返回长度

//	dcdu 0x18010001//11 B19 A相失流次数
	dcb 3//返回长度
//	dcdu 0x18010002//B19 A相失流总累计时间
	dcb 3
//	dcdu 0x1801FF01//B19 A相失流
	dcb 179//返回长度

//	dcdu 0x19010001//12 B20 A相过流次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1901FF01//B20 A相过流
	dcb 179//返回长度

//	dcdu 0x1C010001//13 B21 A相过载次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1C01FF01//B21 A相过载
	dcb 140//返回长度

//	dcdu 0x1B010001//14 B22 A相功率反向次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1B01FF01//B22 A相功率反向
	dcb 140//返回长度

//	dcdu 0x13010001//15 B23 A相断相次数
	dcb 3//返回长度
//	dcdu 0x13010002//B23 A相断相总累计时间
	dcb 3
//	dcdu 0x1301FF01//B23 A相断相
	dcb 195//返回长度

//	dcdu 0x1A010001//16 B24 A相断流次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1A01FF01//B24 A相断流
	dcb 179//返回长度

//	dcdu 0x10020001//17 B32 B相失压次数
	dcb 3//返回长度
//	dcdu 0x10020002//B32 B相失压总累计时间
	dcb 3
//	dcdu 0x1002FF01//B32 B相失压
	dcb 195//返回长度

//	dcdu 0x11020001//18 B33 B相欠压次数
	dcb 3//返回长度
//	dcdu 0x11020002//B33 B相欠压总累计时间
	dcb 3
//	dcdu 0x1102FF01//B33 B相欠压
	dcb 195//返回长度

//	dcdu 0x12020001//19 B34 B相过压次数
	dcb 3//返回长度
//	dcdu 0x12020002//B34 B相过压总累计时间
	dcb 3
//	dcdu 0x1202FF01//B34 B相过压
	dcb 195//返回长度

//	dcdu 0x18020001//20 B35 B相失流次数
	dcb 3//返回长度
//	dcdu 0x18020002//B35 B相失流总累计时间
	dcb 3
//	dcdu 0x1802FF01//B35 B相失流
	dcb 179//返回长度

//	dcdu 0x19020001//21 B36 B相过流次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1902FF01//B36 B相过流
	dcb 179//返回长度

//	dcdu 0x1C020001//22 B37 B相过载次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1C02FF01//B37 B相过载
	dcb 140//返回长度

//	dcdu 0x1B020001//23 B38 B相功率反向次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1B02FF01//B38 B相功率反向
	dcb 140//返回长度

//	dcdu 0x13020001//24 B39 B相断相次数
	dcb 3//返回长度
//	dcdu 0x13020002//B39 B相断相总累计时间
	dcb 3
//	dcdu 0x1302FF01//B39 B相断相
	dcb 195//返回长度

//	dcdu 0x1A020001//25 B40 B相断流次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1A02FF01//B40 B相断流
	dcb 179//返回长度

//	dcdu 0x10030001//26 B48 C相失压次数
	dcb 3//返回长度
//	dcdu 0x10030002//B48 C相失压总累计时间
	dcb 3
//	dcdu 0x1003FF01//B48 C相失压
	dcb 195//返回长度

//	dcdu 0x11030001//27 B49 C相欠压次数
	dcb 3//返回长度
//	dcdu 0x11030002//B49 C相欠压总累计时间
	dcb 3
//	dcdu 0x1103FF01//B49 C相欠压
	dcb 195//返回长度

//	dcdu 0x12030001//28 B50 C相过压次数
	dcb 3//返回长度
//	dcdu 0x12030002//B50 C相过压总累计时间
	dcb 3
//	dcdu 0x1203FF01//B50 C相过压
	dcb 195//返回长度

//	dcdu 0x18030001//29 B51 C相失流次数
	dcb 3//返回长度
//	dcdu 0x18030002//B51 C相失流总累计时间
	dcb 3
//	dcdu 0x1803FF01//B51 C相失流
	dcb 179//返回长度

//	dcdu 0x19030001//30 B52 C相过流次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1903FF01//B52 C相过流
	dcb 179//返回长度

//	dcdu 0x1C030001//31 B53 C相过载次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1C03FF01//B53 C相过载
	dcb 140//返回长度

//	dcdu 0x1B030001//32 B54 C相功率反向次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1B03FF01//B54 C相功率反向
	dcb 140//返回长度

//	dcdu 0x13030001//33 B55 C相断相次数
	dcb 3//返回长度
//	dcdu 0x13030002//B55 C相断相总累计时间
	dcb 3
//	dcdu 0x1303FF01//B55 C相断相
	dcb 195//返回长度

//	dcdu 0x1A030001//34 B56 C相断流次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1A03FF01//B56 C相断流
	dcb 179//返回长度

//	dcdu 0x14000001//35 B64 电压逆相序次数
	dcb 3//返回长度
//	dcdu 0x14000002//B64 电压逆相序总累计时间
	dcb 3
//	dcdu 0x1400FF01//B64 电压逆相序
	dcb 140//返回长度

//	dcdu 0x15000001//36 B65 电流逆相序次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1500FF01//B65 电流逆相序
	dcb 140//返回长度

//	dcdu 0x16000001//37 B66 电压不平衡次数
	dcb 3//返回长度
//	dcdu 0x16000002//B66 电压不平衡总累计时间
	dcb 3
//	dcdu 0x1600FF01//B66 电压不平衡
	dcb 143//返回长度

//	dcdu 0x17000001//38 B67 电流不平衡次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1700FF01//B67 电流不平衡
	dcb 143//返回长度

//	dcdu 0x03060000//39 B68 辅助电源失电次数
	dcb 6//总次数3总累计时间3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03060001//B68 辅助电源失电
	dcb 12//返回长度

//	dcdu 0x03110000//40 B69 掉电次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03110001//B69 掉电
	dcb 12//返回长度
	
//	dcdu 0x1F000001//41 B71 总功率因数超下限次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x1F00FF01//B71 总功率因数超下限
	dcb 44//返回长度

//	dcdu 0x20000001//42 B72 电流严重不平衡次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x2000FF01//B72 电流严重不平衡
	dcb 143//返回长度

//	dcdu 0x21000000//43 B73 潮流反向次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x21000001//B73 潮流反向
	dcb 71//返回长度

//	dcdu 0x03050000//44 B74 全失压次数
	dcb 6//总次数3总累计时间3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03050001//B74 全失压
	dcb 15//返回长度

//	dcdu 0x03300000//45 B80 编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300001//B80 编程
	dcb 50//返回长度

//	dcdu 0x03300100//46 B81 电表清零次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300101//B81 电表清零
	dcb 106//返回长度

//	dcdu 0x03300200//47 B82 需量清零次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300201//B82 需量清零
	dcb 0//202//返回长度

//	dcdu 0x03300300//48 B83 事件清零次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300301//B83 事件清零
	dcb 14//返回长度

//	dcdu 0x03300400//49 B84 校时次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300401//B84 校时
	dcb 16//返回长度

//	dcdu 0x03300500//50 B85 时段表编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300501//B85 时段表编程
	dcb 0//682//返回长度

//	dcdu 0x03300600//51 B86 时区表编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300601//B86 时区表编程
	dcb 94//返回长度

//	dcdu 0x03300700//52 B87 周休日编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300701//B87 周休日编程
	dcb 11//返回长度

//	dcdu 0x03300800//53 B88 节假日编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300801//B88 节假日编程
	dcb 0//1026//返回长度

//	dcdu 0x03300900//54 B89 有功组合方式编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300901//B89 有功组合方式编程
	dcb 11//返回长度

//	dcdu 0x03300A00//55 B90 无功组合方式1编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300A01//B90 无功组合方式1编程
	dcb 11//返回长度

//	dcdu 0x03300B00//56 B91 无功组合方式2编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300B01//B91 无功组合方式2编程
	dcb 11//返回长度

//	dcdu 0x03300C00//57 B92 结算日编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300C01//B92 结算日编程
	dcb 16//返回长度

//	dcdu 0x03300F00//58 B93 费率参数表编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03300F01//B93 费率参数表编程
	dcb 42//费率1~N（N<=32）按费率4计算//返回长度

//	dcdu 0x03301000//59 B94 阶梯表编程次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03301001//B94 阶梯表编程
	dcb 138//返回长度

//	dcdu 0x03301200//60 B95 密钥更新次数
	dcb 3//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x03301201//B95 密钥更新
	dcb 15//返回长度

#if EnMeterAutoAutoReport==0//允许电能表主动上报事件:0=不允许,1=允许
//	dcdu 0x04001501//读主动上报状态字bit5,bit7
	dcb 0//返回长度
//	dcdu 0//复位主动上报状态字bit5,bit7
	dcb 0//返回长度
//	dcdu 0
	dcb 0
//	dcdu 0x040005ff//电表运行状态字bit2,bit3
	dcb 18//返回长度
#endif

	ALIGN
}
#else//#if ((USER/100)==5)//上海用户
//不是上海
//事件抄读数据标识规律:
//1.次数DI的格式为xxxxxx00,则事件记录DI的格式为xxxxxx01,事件无分项抄读命令,无FF
//2.次数DI的格式为xxxxxx01,则事件记录DI的格式为xxxxFF01,,事件有分项抄读命令,有FF
__asm void ADDR_RM_DL645_2007_F3_Lib(void)
{
	dcb 3//实时Fn
	dcb (60+6)*2//通信标识个数
#if NUM_MeterEventDI!=(60+6)//抄读的标识个数
	#error "NUM_MeterEventDI!=(60+6)"
#endif
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if EventProject==0//事件记录采集方案:0=原能走台体标准,1=按新智能电能表及采集终端事件记录采集规则
	dcb 0//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	
	dcdu 0x03360000//1 B0负荷开关误动或拒动次数
	dcb 3//返回长度
	dcdu 0x03360001//B0负荷开关误动或拒动事件
	dcb 29//返回长度
//	dcdu 0//B1 ESAM错误次数
//	dcb 0//返回长度
//	dcdu 0//B1 ESAM错误
//	dcb 0//返回长度
//	dcdu 0//B2 内卡初始化错误次数
//	dcb 0//返回长度
//	dcdu 0//B2 内卡初始化错误
//	dcb 0//返回长度
//	dcdu 0//B3 时钟电池电压低次数
//	dcb 0//返回长度
//	dcdu 0//B3 时钟电池电压低
//	dcb 0//返回长度
//	dcdu 0//B4 内部程序错误次数
//	dcb 0//返回长度
//	dcdu 0//B4 内部程序错误
//	dcb 0//返回长度
//	dcdu 0//B5 存储器故障或损坏次数
//	dcb 0//返回长度
//	dcdu 0//B5 存储器故障或损坏
//	dcb 0//返回长度
//	dcdu 0//B6保留
//	dcb 0//返回长度
//	dcdu 0//B6保留
//	dcb 0//返回长度
//	dcdu 0//B7 时钟故障次数
//	dcb 0//返回长度
//	dcdu 0//B7 时钟故障
//	dcb 0//返回长度
//	dcdu 0//B8 停电抄表电池欠压次数
//	dcb 0//返回长度
//	dcdu 0//B8 停电抄表电池欠压
//	dcb 0//返回长度
//	dcdu 0//B9 透支状态次数
//	dcb 0//返回长度
//	dcdu 0//B9 透支状态
//	dcb 0//返回长度
	dcdu 0x03300D00//2 B10开表盖次数
	dcb 3//返回长度
	dcdu 0x03300D01//B10开表盖
	dcb 60//返回长度
	dcdu 0x03300E00//3 B11开端钮盖次数
	dcb 3//返回长度
	dcdu 0x03300E01//B11开端钮盖
	dcb 60//返回长度
	dcdu 0x03350000//4 B12恒定磁场干扰次数
	dcb 3//返回长度
	dcdu 0x03350001//B12恒定磁场干扰
	dcb 28//返回长度
	dcdu 0x03370000//5 B13电源异常次数
	dcb 3//返回长度
	dcdu 0x03370001//B13电源异常
	dcb 20//返回长度
	dcdu 0x1D000001//6 B14跳闸成功次数
	dcb 3//返回长度
	dcdu 0x1D00FF01//B14跳闸成功
	dcb 34//返回长度
	dcdu 0x1E000001//7 B15合闸成功次数
	dcb 3//返回长度
	dcdu 0x1E00FF01//B15合闸成功
	dcb 34//返回长度
	dcdu 0x10010001//8 B16 A相失压次数
	dcb 3//返回长度
	dcdu 0x1001FF01//B16 A相失压
	dcb 195//返回长度
	dcdu 0x11010001//9 B17 A相欠压次数
	dcb 3//返回长度
	dcdu 0x1101FF01//B17 A相欠压
	dcb 195//返回长度
	dcdu 0x12010001//10 B18 A相过压次数
	dcb 3//返回长度
	dcdu 0x1201FF01//B18 A相过压
	dcb 195//返回长度
	dcdu 0x18010001//11 B19 A相失流次数
	dcb 3//返回长度
	dcdu 0x1801FF01//B19 A相失流
	dcb 179//返回长度
	dcdu 0x19010001//12 B20 A相过流次数
	dcb 3//返回长度
	dcdu 0x1901FF01//B20 A相过流
	dcb 179//返回长度
	dcdu 0x1C010001//13 B21 A相过载次数
	dcb 3//返回长度
	dcdu 0x1C01FF01//B21 A相过载
	dcb 140//返回长度
	dcdu 0x1B010001//14 B22 A相功率反向次数
	dcb 3//返回长度
	dcdu 0x1B01FF01//B22 A相功率反向
	dcb 140//返回长度
	dcdu 0x13010001//15 B23 A相断相次数
	dcb 3//返回长度
	dcdu 0x1301FF01//B23 A相断相
	dcb 195//返回长度
	dcdu 0x1A010001//16 B24 A相断流次数
	dcb 3//返回长度
	dcdu 0x1A01FF01//B24 A相断流
	dcb 179//返回长度
//	dcdu 0//B25保留
//	dcb 0//返回长度
//	dcdu 0//B25保留
//	dcb 0//返回长度
//	dcdu 0//B26保留
//	dcb 0//返回长度
//	dcdu 0//B26保留
//	dcb 0//返回长度
//	dcdu 0//B27保留
//	dcb 0//返回长度
//	dcdu 0//B27保留
//	dcb 0//返回长度
//	dcdu 0//B28保留
//	dcb 0//返回长度
//	dcdu 0//B28保留
//	dcb 0//返回长度
//	dcdu 0//B29保留
//	dcb 0//返回长度
//	dcdu 0//B29保留
//	dcb 0//返回长度
//	dcdu 0//B30保留
//	dcb 0//返回长度
//	dcdu 0//B30保留
//	dcb 0//返回长度
//	dcdu 0//B31保留
//	dcb 0//返回长度
//	dcdu 0//B31保留
//	dcb 0//返回长度
	dcdu 0x10020001//17 B32 B相失压次数
	dcb 3//返回长度
	dcdu 0x1002FF01//B32 B相失压
	dcb 195//返回长度
	dcdu 0x11020001//18 B33 B相欠压次数
	dcb 3//返回长度
	dcdu 0x1102FF01//B33 B相欠压
	dcb 195//返回长度
	dcdu 0x12020001//19 B34 B相过压次数
	dcb 3//返回长度
	dcdu 0x1202FF01//B34 B相过压
	dcb 195//返回长度
	dcdu 0x18020001//20 B35 B相失流次数
	dcb 3//返回长度
	dcdu 0x1802FF01//B35 B相失流
	dcb 179//返回长度
	dcdu 0x19020001//21 B36 B相过流次数
	dcb 3//返回长度
	dcdu 0x1902FF01//B36 B相过流
	dcb 179//返回长度
	dcdu 0x1C020001//22 B37 B相过载次数
	dcb 3//返回长度
	dcdu 0x1C02FF01//B37 B相过载
	dcb 140//返回长度
	dcdu 0x1B020001//23 B38 B相功率反向次数
	dcb 3//返回长度
	dcdu 0x1B02FF01//B38 B相功率反向
	dcb 140//返回长度
	dcdu 0x13020001//24 B39 B相断相次数
	dcb 3//返回长度
	dcdu 0x1302FF01//B39 B相断相
	dcb 195//返回长度
	dcdu 0x1A020001//25 B40 B相断流次数
	dcb 3//返回长度
	dcdu 0x1A02FF01//B40 B相断流
	dcb 179//返回长度
//	dcdu 0//B41 保留
//	dcb 0//返回长度
//	dcdu 0//B41 保留
//	dcb 0//返回长度
//	dcdu 0//B42 保留
//	dcb 0//返回长度
//	dcdu 0//B42 保留
//	dcb 0//返回长度
//	dcdu 0//B43保留
//	dcb 0//返回长度
//	dcdu 0//B43保留
//	dcb 0//返回长度
//	dcdu 0//B44保留
//	dcb 0//返回长度
//	dcdu 0//B44保留
//	dcb 0//返回长度
//	dcdu 0//B45保留
//	dcb 0//返回长度
//	dcdu 0//B45保留
//	dcb 0//返回长度
//	dcdu 0//B46保留
//	dcb 0//返回长度
//	dcdu 0//B46保留
//	dcb 0//返回长度
//	dcdu 0//B47保留
//	dcb 0//返回长度
//	dcdu 0//B47保留
//	dcb 0//返回长度
	dcdu 0x10030001//26 B48 C相失压次数
	dcb 3//返回长度
	dcdu 0x1003FF01//B48 C相失压
	dcb 195//返回长度
	dcdu 0x11030001//27 B49 C相欠压次数
	dcb 3//返回长度
	dcdu 0x1103FF01//B49 C相欠压
	dcb 195//返回长度
	dcdu 0x12030001//28 B50 C相过压次数
	dcb 3//返回长度
	dcdu 0x1203FF01//B50 C相过压
	dcb 195//返回长度
	dcdu 0x18030001//29 B51 C相失流次数
	dcb 3//返回长度
	dcdu 0x1803FF01//B51 C相失流
	dcb 179//返回长度
	dcdu 0x19030001//30 B52 C相过流次数
	dcb 3//返回长度
	dcdu 0x1903FF01//B52 C相过流
	dcb 179//返回长度
	dcdu 0x1C030001//31 B53 C相过载次数
	dcb 3//返回长度
	dcdu 0x1C03FF01//B53 C相过载
	dcb 140//返回长度
	dcdu 0x1B030001//32 B54 C相功率反向次数
	dcb 3//返回长度
	dcdu 0x1B03FF01//B54 C相功率反向
	dcb 140//返回长度
	dcdu 0x13030001//33 B55 C相断相次数
	dcb 3//返回长度
	dcdu 0x1303FF01//B55 C相断相
	dcb 195//返回长度
	dcdu 0x1A030001//34 B56 C相断流次数
	dcb 3//返回长度
	dcdu 0x1A03FF01//B56 C相断流
	dcb 179//返回长度
//	dcdu 0//B57 保留
//	dcb 0//返回长度
//	dcdu 0//B57 保留
//	dcb 0//返回长度
//	dcdu 0//B58 保留
//	dcb 0//返回长度
//	dcdu 0//B58 保留
//	dcb 0//返回长度
//	dcdu 0//B59 保留
//	dcb 0//返回长度
//	dcdu 0//B59 保留
//	dcb 0//返回长度
//	dcdu 0//B60 保留
//	dcb 0//返回长度
//	dcdu 0//B60 保留
//	dcb 0//返回长度
//	dcdu 0//B61 保留
//	dcb 0//返回长度
//	dcdu 0//B61 保留
//	dcb 0//返回长度
//	dcdu 0//B62 保留
//	dcb 0//返回长度
//	dcdu 0//B62 保留
//	dcb 0//返回长度
//	dcdu 0//B63 保留
//	dcb 0//返回长度
//	dcdu 0//B63 保留
//	dcb 0//返回长度
	dcdu 0x14000001//35 B64 电压逆相序次数
	dcb 3//返回长度
	dcdu 0x1400FF01//B64 电压逆相序
	dcb 140//返回长度
	dcdu 0x15000001//36 B65 电流逆相序次数
	dcb 3//返回长度
	dcdu 0x1500FF01//B65 电流逆相序
	dcb 140//返回长度
	dcdu 0x16000001//37 B66 电压不平衡次数
	dcb 3//返回长度
	dcdu 0x1600FF01//B66 电压不平衡
	dcb 143//返回长度
	dcdu 0x17000001//38 B67 电流不平衡次数
	dcb 3//返回长度
	dcdu 0x1700FF01//B67 电流不平衡
	dcb 143//返回长度
	dcdu 0x03060000//39 B68 辅助电源失电次数
	dcb 6//总次数3总累计时间3//返回长度
	dcdu 0x03060001//B68 辅助电源失电
	dcb 12//返回长度
	dcdu 0x03110000//40 B69 掉电次数
	dcb 3//返回长度
	dcdu 0x03110001//B69 掉电
	dcb 12//返回长度

	dcdu 0x03120000//41 B70-1 需量超限次数
	dcb 18//返回长度
	dcdu 0x03120101//B70-1 需量超限(正向有功)
	dcb 20//返回长度
	dcdu 0//41 B70-2 (紧接上不能分开)
	dcb 0//18//返回长度
	dcdu 0x03120201//B70-2 需量超限(反向有功)(紧接上不能分开)
	dcb 20//返回长度
	dcdu 0xFFFFFFFF//41 B70-3 (紧接上不能分开);其他非事件类的数据在此定时抄读
	dcb 0//18//返回长度
	dcdu 0x03120301//B70-3 需量超限(1象限无功)(紧接上不能分开)
	dcb 20//返回长度
	dcdu 0//0x03120000//41 B70-4 (紧接上不能分开)
	dcb 0//18//返回长度
	dcdu 0x03120401//B70-4 需量超限(2象限无功)(紧接上不能分开)
	dcb 20//返回长度
	dcdu 0//0x03120000//41 B70-5 (紧接上不能分开)
	dcb 0//18//返回长度
	dcdu 0x03120501//B70-5 需量超限(3象限无功)(紧接上不能分开)
	dcb 20//返回长度
	dcdu 0//0x03120000//41 B70-6 (紧接上不能分开)
	dcb 0//18//返回长度
	dcdu 0x03120601//B70-6 需量超限(4象限无功)(紧接上不能分开)
	dcb 20//返回长度
	
	dcdu 0x1F000001//42 B71 总功率因数超下限次数
	dcb 3//返回长度
	dcdu 0x1F00FF01//B71 总功率因数超下限
	dcb 44//返回长度
	dcdu 0x20000001//43 B72 电流严重不平衡次数
	dcb 3//返回长度
	dcdu 0x2000FF01//B72 电流严重不平衡
	dcb 143//返回长度
	dcdu 0x21000000//44 B73 潮流反向次数
	dcb 3//返回长度
	dcdu 0x21000001//B73 潮流反向
	dcb 71//返回长度
	dcdu 0x03050000//45 B74 全失压次数
	dcb 6//总次数3总累计时间3//返回长度
	dcdu 0x03050001//B74 全失压
	dcb 15//返回长度
//	dcdu 0//B75保留
//	dcb 0//返回长度
//	dcdu 0//B75保留
//	dcb 0//返回长度
//	dcdu 0//B76保留
//	dcb 0//返回长度
//	dcdu 0//B76保留
//	dcb 0//返回长度
//	dcdu 0//B77保留
//	dcb 0//返回长度
//	dcdu 0//B77保留
//	dcb 0//返回长度
//	dcdu 0//B78保留
//	dcb 0//返回长度
//	dcdu 0//B78保留
//	dcb 0//返回长度
//	dcdu 0//B79保留
//	dcb 0//返回长度
//	dcdu 0//B79保留
//	dcb 0//返回长度
	dcdu 0x03300000//46 B80 编程次数
	dcb 3//返回长度
	dcdu 0x03300001//B80 编程
	dcb 50//返回长度
	dcdu 0x03300100//47 B81 电表清零次数
	dcb 3//返回长度
	dcdu 0x03300101//B81 电表清零
	dcb 106//返回长度
	dcdu 0x03300200//48 B82 需量清零次数
	dcb 3//返回长度
	dcdu 0x03300201//B82 需量清零
	dcb 0//202//返回长度
	dcdu 0x03300300//49 B83 事件清零次数
	dcb 3//返回长度
	dcdu 0x03300301//B83 事件清零
	dcb 14//返回长度
	dcdu 0x03300400//50 B84 校时次数
	dcb 3//返回长度
	dcdu 0x03300401//B84 校时
	dcb 16//返回长度
	dcdu 0x03300500//51 B85 时段表编程次数
	dcb 3//返回长度
	dcdu 0x03300501//B85 时段表编程
	dcb 0//682//返回长度
	dcdu 0x03300600//52 B86 时区表编程次数
	dcb 3//返回长度
	dcdu 0x03300601//B86 时区表编程
	dcb 94//返回长度
	dcdu 0x03300700//53 B87 周休日编程次数
	dcb 3//返回长度
	dcdu 0x03300701//B87 周休日编程
	dcb 11//返回长度
	dcdu 0x03300800//54 B88 节假日编程次数
	dcb 3//返回长度
	dcdu 0x03300801//B88 节假日编程
	dcb 0//1026//返回长度
	dcdu 0x03300900//55 B89 有功组合方式编程次数
	dcb 3//返回长度
	dcdu 0x03300901//B89 有功组合方式编程
	dcb 11//返回长度
	dcdu 0x03300A00//56 B90 无功组合方式1编程次数
	dcb 3//返回长度
	dcdu 0x03300A01//B90 无功组合方式1编程
	dcb 11//返回长度
	dcdu 0x03300B00//57 B91 无功组合方式2编程次数
	dcb 3//返回长度
	dcdu 0x03300B01//B91 无功组合方式2编程
	dcb 11//返回长度
	dcdu 0x03300C00//58 B92 结算日编程次数
	dcb 3//返回长度
	dcdu 0x03300C01//B92 结算日编程
	dcb 16//返回长度
	dcdu 0x03300F00//59 B93 费率参数表编程次数
	dcb 3//返回长度
	dcdu 0x03300F01//B93 费率参数表编程
	dcb 0//42//费率1~N（N<=32）按费率4计算//返回长度
	dcdu 0x03301000//60 B94 阶梯表编程次数
	dcb 3//返回长度
	dcdu 0x03301001//B94 阶梯表编程
	dcb 0//138//返回长度
	dcdu 0x03301200//61 B95 密钥更新次数
	dcb 3//返回长度
	dcdu 0x03301201//B95 密钥更新
	dcb 15//返回长度

//当正确返回长度=0时的预计返回字节数
//	dcdu 0x03360000//1 B0负荷开关误动或拒动次数
	dcb 3//返回长度
//	dcdu 0x03360001//B0负荷开关误动或拒动事件
	dcb 29//返回长度
////	dcdu 0//B1 ESAM错误次数
////	dcb 0//返回长度
////	dcdu 0//B1 ESAM错误
////	dcb 0//返回长度
////	dcdu 0//B2 内卡初始化错误次数
////	dcb 0//返回长度
////	dcdu 0//B2 内卡初始化错误
////	dcb 0//返回长度
////	dcdu 0//B3 时钟电池电压低次数
////	dcb 0//返回长度
////	dcdu 0//B3 时钟电池电压低
////	dcb 0//返回长度
////	dcdu 0//B4 内部程序错误次数
////	dcb 0//返回长度
////	dcdu 0//B4 内部程序错误
////	dcb 0//返回长度
////	dcdu 0//B5 存储器故障或损坏次数
////	dcb 0//返回长度
////	dcdu 0//B5 存储器故障或损坏
////	dcb 0//返回长度
////	dcdu 0//B6保留
////	dcb 0//返回长度
////	dcdu 0//B6保留
////	dcb 0//返回长度
////	dcdu 0//B7 时钟故障次数
////	dcb 0//返回长度
////	dcdu 0//B7 时钟故障
////	dcb 0//返回长度
////	dcdu 0//B8 停电抄表电池欠压次数
////	dcb 0//返回长度
////	dcdu 0//B8 停电抄表电池欠压
////	dcb 0//返回长度
////	dcdu 0//B9 透支状态次数
////	dcb 0//返回长度
////	dcdu 0//B9 透支状态
////	dcb 0//返回长度
//	dcdu 0x03300D00//2 B10开表盖次数
	dcb 3//返回长度
//	dcdu 0x03300D01//B10开表盖
	dcb 60//返回长度
//	dcdu 0x03300E00//3 B11开端钮盖次数
	dcb 3//返回长度
//	dcdu 0x03300E01//B11开端钮盖
	dcb 60//返回长度
//	dcdu 0x03350000//4 B12恒定磁场干扰次数
	dcb 3//返回长度
//	dcdu 0x03350001//B12恒定磁场干扰
	dcb 28//返回长度
//	dcdu 0x03370000//5 B13电源异常次数
	dcb 3//返回长度
//	dcdu 0x03370001//B13电源异常
	dcb 20//返回长度
//	dcdu 0x1D000001//6 B14跳闸成功次数
	dcb 3//返回长度
//	dcdu 0x1D00FF01//B14跳闸成功
	dcb 34//返回长度
//	dcdu 0x1E000001//7 B15合闸成功次数
	dcb 3//返回长度
//	dcdu 0x1E00FF01//B15合闸成功
	dcb 34//返回长度
//	dcdu 0x10010001//8 B16 A相失压次数
	dcb 3//返回长度
//	dcdu 0x1001FF01//B16 A相失压
	dcb 195//返回长度
//	dcdu 0x11010001//9 B17 A相欠压次数
	dcb 3//返回长度
//	dcdu 0x1101FF01//B17 A相欠压
	dcb 195//返回长度
//	dcdu 0x12010001//10 B18 A相过压次数
	dcb 3//返回长度
//	dcdu 0x1201FF01//B18 A相过压
	dcb 195//返回长度
//	dcdu 0x18010001//11 B19 A相失流次数
	dcb 3//返回长度
//	dcdu 0x1801FF01//B19 A相失流
	dcb 179//返回长度
//	dcdu 0x19010001//12 B20 A相过流次数
	dcb 3//返回长度
//	dcdu 0x1901FF01//B20 A相过流
	dcb 179//返回长度
//	dcdu 0x1C010001//13 B21 A相过载次数
	dcb 3//返回长度
//	dcdu 0x1C01FF01//B21 A相过载
	dcb 140//返回长度
//	dcdu 0x1B010001//14 B22 A相功率反向次数
	dcb 3//返回长度
//	dcdu 0x1B01FF01//B22 A相功率反向
	dcb 140//返回长度
//	dcdu 0x13010001//15 B23 A相断相次数
	dcb 3//返回长度
//	dcdu 0x1301FF01//B23 A相断相
	dcb 195//返回长度
//	dcdu 0x1A010001//16 B24 A相断流次数
	dcb 3//返回长度
//	dcdu 0x1A01FF01//B24 A相断流
	dcb 179//返回长度
////	dcdu 0//B25保留
////	dcb 0//返回长度
////	dcdu 0//B25保留
////	dcb 0//返回长度
////	dcdu 0//B26保留
////	dcb 0//返回长度
////	dcdu 0//B26保留
////	dcb 0//返回长度
////	dcdu 0//B27保留
////	dcb 0//返回长度
////	dcdu 0//B27保留
////	dcb 0//返回长度
////	dcdu 0//B28保留
////	dcb 0//返回长度
////	dcdu 0//B28保留
////	dcb 0//返回长度
////	dcdu 0//B29保留
////	dcb 0//返回长度
////	dcdu 0//B29保留
////	dcb 0//返回长度
////	dcdu 0//B30保留
////	dcb 0//返回长度
////	dcdu 0//B30保留
////	dcb 0//返回长度
////	dcdu 0//B31保留
////	dcb 0//返回长度
////	dcdu 0//B31保留
////	dcb 0//返回长度
//	dcdu 0x10020001//17 B32 B相失压次数
	dcb 3//返回长度
//	dcdu 0x1002FF01//B32 B相失压
	dcb 195//返回长度
//	dcdu 0x11020001//18 B33 B相欠压次数
	dcb 3//返回长度
//	dcdu 0x1102FF01//B33 B相欠压
	dcb 195//返回长度
//	dcdu 0x12020001//19 B34 B相过压次数
	dcb 3//返回长度
//	dcdu 0x1202FF01//B34 B相过压
	dcb 195//返回长度
//	dcdu 0x18020001//20 B35 B相失流次数
	dcb 3//返回长度
//	dcdu 0x1802FF01//B35 B相失流
	dcb 179//返回长度
//	dcdu 0x19020001//21 B36 B相过流次数
	dcb 3//返回长度
//	dcdu 0x1902FF01//B36 B相过流
	dcb 179//返回长度
//	dcdu 0x1C020001//22 B37 B相过载次数
	dcb 3//返回长度
//	dcdu 0x1C02FF01//B37 B相过载
	dcb 140//返回长度
//	dcdu 0x1B020001//23 B38 B相功率反向次数
	dcb 3//返回长度
//	dcdu 0x1B02FF01//B38 B相功率反向
	dcb 140//返回长度
//	dcdu 0x13020001//24 B39 B相断相次数
	dcb 3//返回长度
//	dcdu 0x1302FF01//B39 B相断相
	dcb 195//返回长度
//	dcdu 0x1A020001//25 B40 B相断流次数
	dcb 3//返回长度
//	dcdu 0x1A02FF01//B40 B相断流
	dcb 179//返回长度
////	dcdu 0//B41 保留
////	dcb 0//返回长度
////	dcdu 0//B41 保留
////	dcb 0//返回长度
////	dcdu 0//B42 保留
////	dcb 0//返回长度
////	dcdu 0//B42 保留
////	dcb 0//返回长度
////	dcdu 0//B43保留
////	dcb 0//返回长度
////	dcdu 0//B43保留
////	dcb 0//返回长度
////	dcdu 0//B44保留
////	dcb 0//返回长度
////	dcdu 0//B44保留
////	dcb 0//返回长度
////	dcdu 0//B45保留
////	dcb 0//返回长度
////	dcdu 0//B45保留
////	dcb 0//返回长度
////	dcdu 0//B46保留
////	dcb 0//返回长度
////	dcdu 0//B46保留
////	dcb 0//返回长度
////	dcdu 0//B47保留
////	dcb 0//返回长度
////	dcdu 0//B47保留
////	dcb 0//返回长度
//	dcdu 0x10030001//26 B48 C相失压次数
	dcb 3//返回长度
//	dcdu 0x1003FF01//B48 C相失压
	dcb 195//返回长度
//	dcdu 0x11030001//27 B49 C相欠压次数
	dcb 3//返回长度
//	dcdu 0x1103FF01//B49 C相欠压
	dcb 195//返回长度
//	dcdu 0x12030001//28 B50 C相过压次数
	dcb 3//返回长度
//	dcdu 0x1203FF01//B50 C相过压
	dcb 195//返回长度
//	dcdu 0x18030001//29 B51 C相失流次数
	dcb 3//返回长度
//	dcdu 0x1803FF01//B51 C相失流
	dcb 179//返回长度
//	dcdu 0x19030001//30 B52 C相过流次数
	dcb 3//返回长度
//	dcdu 0x1903FF01//B52 C相过流
	dcb 179//返回长度
//	dcdu 0x1C030001//31 B53 C相过载次数
	dcb 3//返回长度
//	dcdu 0x1C03FF01//B53 C相过载
	dcb 140//返回长度
//	dcdu 0x1B030001//32 B54 C相功率反向次数
	dcb 3//返回长度
//	dcdu 0x1B03FF01//B54 C相功率反向
	dcb 140//返回长度
//	dcdu 0x13030001//33 B55 C相断相次数
	dcb 3//返回长度
//	dcdu 0x1303FF01//B55 C相断相
	dcb 195//返回长度
//	dcdu 0x1A030001//34 B56 C相断流次数
	dcb 3//返回长度
//	dcdu 0x1A03FF01//B56 C相断流
	dcb 179//返回长度
////	dcdu 0//B57 保留
////	dcb 0//返回长度
////	dcdu 0//B57 保留
////	dcb 0//返回长度
////	dcdu 0//B58 保留
////	dcb 0//返回长度
////	dcdu 0//B58 保留
////	dcb 0//返回长度
////	dcdu 0//B59 保留
////	dcb 0//返回长度
////	dcdu 0//B59 保留
////	dcb 0//返回长度
////	dcdu 0//B60 保留
////	dcb 0//返回长度
////	dcdu 0//B60 保留
////	dcb 0//返回长度
////	dcdu 0//B61 保留
////	dcb 0//返回长度
////	dcdu 0//B61 保留
////	dcb 0//返回长度
////	dcdu 0//B62 保留
////	dcb 0//返回长度
////	dcdu 0//B62 保留
////	dcb 0//返回长度
////	dcdu 0//B63 保留
////	dcb 0//返回长度
////	dcdu 0//B63 保留
////	dcb 0//返回长度
//	dcdu 0x14000001//35 B64 电压逆相序次数
	dcb 3//返回长度
//	dcdu 0x1400FF01//B64 电压逆相序
	dcb 140//返回长度
//	dcdu 0x15000001//36 B65 电流逆相序次数
	dcb 3//返回长度
//	dcdu 0x1500FF01//B65 电流逆相序
	dcb 140//返回长度
//	dcdu 0x16000001//37 B66 电压不平衡次数
	dcb 3//返回长度
//	dcdu 0x1600FF01//B66 电压不平衡
	dcb 143//返回长度
//	dcdu 0x17000001//38 B67 电流不平衡次数
	dcb 3//返回长度
//	dcdu 0x1700FF01//B67 电流不平衡
	dcb 143//返回长度
//	dcdu 0x03060000//39 B68 辅助电源失电次数
	dcb 6//总次数3总累计时间3//返回长度
//	dcdu 0x03060001//B68 辅助电源失电
	dcb 12//返回长度
//	dcdu 0x03110000//40 B69 掉电次数
	dcb 3//返回长度
//	dcdu 0x03110001//B69 掉电
	dcb 12//返回长度

//	dcdu 0x03120000//41 B70-1 需量超限次数
	dcb 18//返回长度
//	dcdu 0x03120101//B70-1 需量超限(正向有功)
	dcb 20//返回长度
//	dcdu 0//41 B70-2 (紧接上不能分开)
	dcb 0//18//返回长度
//	dcdu 0x03120201//B70-2 需量超限(反向有功)(紧接上不能分开)
	dcb 20//返回长度
//	dcdu 0xFFFFFFFF//41 B70-3 (紧接上不能分开);其他非事件类的数据在此定时抄读
	dcb 0//18//返回长度
//	dcdu 0x03120301//B70-3 需量超限(1象限无功)(紧接上不能分开)
	dcb 20//返回长度
//	dcdu 0//0x03120000//41 B70-4 (紧接上不能分开)
	dcb 0//18//返回长度
//	dcdu 0x03120401//B70-4 需量超限(2象限无功)(紧接上不能分开)
	dcb 20//返回长度
//	dcdu 0//0x03120000//41 B70-5 (紧接上不能分开)
	dcb 0//18//返回长度
//	dcdu 0x03120501//B70-5 需量超限(3象限无功)(紧接上不能分开)
	dcb 20//返回长度
//	dcdu 0//0x03120000//41 B70-6 (紧接上不能分开)
	dcb 0//18//返回长度
//	dcdu 0x03120601//B70-6 需量超限(4象限无功)(紧接上不能分开)
	dcb 20//返回长度
	
//	dcdu 0x1F000001//42 B71 总功率因数超下限次数
	dcb 3//返回长度
//	dcdu 0x1F00FF01//B71 总功率因数超下限
	dcb 44//返回长度
//	dcdu 0x20000001//43 B72 电流严重不平衡次数
	dcb 3//返回长度
//	dcdu 0x2000FF01//B72 电流严重不平衡
	dcb 143//返回长度
//	dcdu 0x21000000//44 B73 潮流反向次数
	dcb 3//返回长度
//	dcdu 0x21000001//B73 潮流反向
	dcb 71//返回长度
//	dcdu 0x03050000//45 B74 全失压次数
	dcb 6//总次数3总累计时间3//返回长度
//	dcdu 0x03050001//B74 全失压
	dcb 15//返回长度
////	dcdu 0//B75保留
////	dcb 0//返回长度
////	dcdu 0//B75保留
////	dcb 0//返回长度
////	dcdu 0//B76保留
////	dcb 0//返回长度
////	dcdu 0//B76保留
////	dcb 0//返回长度
////	dcdu 0//B77保留
////	dcb 0//返回长度
////	dcdu 0//B77保留
////	dcb 0//返回长度
////	dcdu 0//B78保留
////	dcb 0//返回长度
////	dcdu 0//B78保留
////	dcb 0//返回长度
////	dcdu 0//B79保留
////	dcb 0//返回长度
////	dcdu 0//B79保留
////	dcb 0//返回长度
//	dcdu 0x03300000//46 B80 编程次数
	dcb 3//返回长度
//	dcdu 0x03300001//B80 编程
	dcb 50//返回长度
//	dcdu 0x03300100//47 B81 电表清零次数
	dcb 3//返回长度
//	dcdu 0x03300101//B81 电表清零
	dcb 106//返回长度
//	dcdu 0x03300200//48 B82 需量清零次数
	dcb 3//返回长度
//	dcdu 0x03300201//B82 需量清零
	dcb 0//202//返回长度
//	dcdu 0x03300300//49 B83 事件清零次数
	dcb 3//返回长度
//	dcdu 0x03300301//B83 事件清零
	dcb 14//返回长度
//	dcdu 0x03300400//50 B84 校时次数
	dcb 3//返回长度
//	dcdu 0x03300401//B84 校时
	dcb 16//返回长度
//	dcdu 0x03300500//51 B85 时段表编程次数
	dcb 3//返回长度
//	dcdu 0x03300501//B85 时段表编程
	dcb 0//682//返回长度
//	dcdu 0x03300600//52 B86 时区表编程次数
	dcb 3//返回长度
//	dcdu 0x03300601//B86 时区表编程
	dcb 94//返回长度
//	dcdu 0x03300700//53 B87 周休日编程次数
	dcb 3//返回长度
//	dcdu 0x03300701//B87 周休日编程
	dcb 11//返回长度
//	dcdu 0x03300800//54 B88 节假日编程次数
	dcb 3//返回长度
//	dcdu 0x03300801//B88 节假日编程
	dcb 0//1026//返回长度
//	dcdu 0x03300900//55 B89 有功组合方式编程次数
	dcb 3//返回长度
//	dcdu 0x03300901//B89 有功组合方式编程
	dcb 11//返回长度
//	dcdu 0x03300A00//56 B90 无功组合方式1编程次数
	dcb 3//返回长度
//	dcdu 0x03300A01//B90 无功组合方式1编程
	dcb 11//返回长度
//	dcdu 0x03300B00//57 B91 无功组合方式2编程次数
	dcb 3//返回长度
//	dcdu 0x03300B01//B91 无功组合方式2编程
	dcb 11//返回长度
//	dcdu 0x03300C00//58 B92 结算日编程次数
	dcb 3//返回长度
//	dcdu 0x03300C01//B92 结算日编程
	dcb 16//返回长度
//	dcdu 0x03300F00//59 B93 费率参数表编程次数
	dcb 3//返回长度
//	dcdu 0x03300F01//B93 费率参数表编程
	dcb 42//费率1~N（N<=32）按费率4计算//返回长度
//	dcdu 0x03301000//60 B94 阶梯表编程次数
	dcb 3//返回长度
//	dcdu 0x03301001//B94 阶梯表编程
	dcb 138//返回长度
//	dcdu 0x03301200//61 B95 密钥更新次数
	dcb 3//返回长度
//	dcdu 0x03301201//B95 密钥更新
	dcb 15//返回长度

	ALIGN
}
#endif

u32 DL645_2007_DI_To_RMCount(u32 DI)//主动上报抄读电能表的事件次数或1-10次记录的数据标识转为与周期抄读相同标识的的抄表计数;返回0xffff(65535)表示没找到
{
	u32 i;
	u32 *p32;
	
	if(DI==0)
	{
		return 0xffff;//无效
	}
	DI&=0xffffff00;
	for(i=0;i<(NUM_MeterEventDI*2);i++)
	{
		p32=(u32 *)((u32)ADDR_RM_DL645_2007_F3_Lib+10+(5*i));
		if((p32[0]&0xffffff00)==DI)
		{
			return i;
		}
	}
	return 0xffff;//无效
}


//F4 保留给读事件
//F5 保留给读事件




//F25 当前三相及总有/无功功率、功率因数，三相电压、电流、零序电流、视在功率
__asm void ADDR_RM_DL645_2007_F25_Lib(void)
{
	dcb 25//实时Fn
	dcb 7//7//23 通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x0203ff00//总,A,B,C有功功率
	dcb 12//返回长度,兼容单相表长度设为0
	dcdu 0x0204ff00//总,A,B,C无功功率
	dcb 12//返回长度,兼容单相表长度设为0
	dcdu 0x0206ff00//总,A,B,C功率因数
	dcb 8//返回长度,兼容单相表长度设为0
	dcdu 0x0201ff00//A,B,C相电压
	dcb 6//返回长度,兼容单相表长度设为0
	dcdu 0x0202ff00//A,B,C相电流
	dcb 9//返回长度,兼容单相表长度设为0
	dcdu 0x02800001//零序电流
	dcb 3//返回长度
	dcdu 0x0205ff00//总,A,B,C视在功率
	dcb 12//返回长度,兼容单相表长度设为0
	
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0203ff00//总,A,B,C有功功率
	dcb 12//返回长度
//	dcdu 0x0204ff00//总,A,B,C无功功率
	dcb 12//返回长度
//	dcdu 0x0206ff00//总,A,B,C功率因数
	dcb 8//返回长度
//	dcdu 0x0201ff00//A,B,C相电压
	dcb 6//返回长度
//	dcdu 0x0202ff00//A,B,C相电流
	dcb 9//返回长度
//	dcdu 0x02800001//零序电流
	dcb 3//返回长度
//	dcdu 0x0205ff00//总,A,B,C视在功率
	dcb 12//返回长度
/*
	dcdu 0x02030000//总有功功率
	dcb 3//返回长度
	dcdu 0x02030100//A有功功率
	dcb 3//返回长度
	dcdu 0x02030200//B有功功率
	dcb 3//返回长度
	dcdu 0x02030300//C有功功率
	dcb 3//返回长度
	dcdu 0x02040000//总无功功率
	dcb 3//返回长度
	dcdu 0x02040100//A无功功率
	dcb 3//返回长度
	dcdu 0x02040200//B无功功率
	dcb 3//返回长度
	dcdu 0x02040300//C无功功率
	dcb 3//返回长度
	dcdu 0x02060000//总功率因数
	dcb 2//返回长度
	dcdu 0x02060100//A功率因数
	dcb 2//返回长度
	dcdu 0x02060200//B功率因数
	dcb 2//返回长度
	dcdu 0x02060300//C功率因数
	dcb 2//返回长度
	dcdu 0x02010100//A相电压
	dcb 2//返回长度
	dcdu 0x02010200//B相电压
	dcb 2//返回长度
	dcdu 0x02010300//C相电压
	dcb 2//返回长度
	dcdu 0x02020100//A相电流
	dcb 3//返回长度
	dcdu 0x02020200//B相电流
	dcb 3//返回长度
	dcdu 0x02020300//C相电流
	dcb 3//返回长度
	dcdu 0x02800001//零序电流
	dcb 3//返回长度
	dcdu 0x02050000//总视在功率
	dcb 3//返回长度
	dcdu 0x02050100//A视在功率
	dcb 3//返回长度
	dcdu 0x02050200//B视在功率
	dcb 3//返回长度
	dcdu 0x02050300//C视在功率
	dcb 3//返回长度
*/
	ALIGN
}

#if RMM_AFN0CF26==0//AFN0CF26断相数据抄表;0=抄电表断相记录数据,1=抄电表失压记录数据
//F26 A、B、C三相断相统计数据及最近一次断相记录
__asm void ADDR_RM_DL645_2007_F26_Lib(void)
{
	dcb 26//实时Fn
	dcb 12+4//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x13010001//A相断相次数
	dcb 3//返回长度
	dcdu 0x13010002//A相断相时间累计值
	dcb 3//返回长度
	dcdu 0x13020001//B相断相次数
	dcb 3//返回长度
	dcdu 0x13020002//B相断相时间累计值
	dcb 3//返回长度
	dcdu 0x13030001//C相断相次数
	dcb 3//返回长度
	dcdu 0x13030002//C相断相时间累计值
	dcb 3//返回长度
	dcdu 0x13010101//A相最近断相起始时刻
	dcb 6//返回长度
	dcdu 0x13012501//A相最近断相结束时刻
	dcb 6//返回长度
	dcdu 0x13020101//B相最近断相起始时刻
	dcb 6//返回长度
	dcdu 0x13022501//B相最近断相结束时刻
	dcb 6//返回长度
	dcdu 0x13030101//C相最近断相起始时刻
	dcb 6//返回长度
	dcdu 0x13032501//C相最近断相结束时刻
	dcb 6//返回长度
	//当以上命令不成功时为兼容用以下命令读
	dcdu 0x03040000//A,B,C相断相次数,累计时间
	dcb 18//返回长度
	dcdu 0x03040101//A相最近断相起始时刻,A相最近断相结束时刻
	dcb 131//返回长度
	dcdu 0x03040201//B相最近断相起始时刻,B相最近断相结束时刻
	dcb 131//返回长度
	dcdu 0x03040301//C相最近断相起始时刻,c相最近断相结束时刻
	dcb 131//返回长度
	ALIGN
}
#endif
#if RMM_AFN0CF26==1//AFN0CF26断相数据抄表;0=抄电表断相记录数据,1=抄电表失压记录数据
//	#if (USER/100)!=6//不是湖南系
//F26 A、B、C三相断相统计数据及最近一次断相记录
__asm void ADDR_RM_DL645_2007_F26_Lib(void)
{
	dcb 26//实时Fn
	dcb 16+4//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x10000001//总失压次数
	dcb 3//返回长度
	dcdu 0x10010001//A失压次数
	dcb 3//返回长度
	dcdu 0x10020001//B失压次数
	dcb 3//返回长度
	dcdu 0x10030001//C失压次数
	dcb 3//返回长度
	dcdu 0x10000002//总失压累计时间
	dcb 3//返回长度
	dcdu 0x10010002//A失压累计时间
	dcb 3//返回长度
	dcdu 0x10020002//B失压累计时间
	dcb 3//返回长度
	dcdu 0x10030002//C失压累计时间
	dcb 3//返回长度
	dcdu 0x10000101//总最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10010101//A相最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10020101//B相最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10030101//C相最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10000201//总最近失压结束时刻
	dcb 6//返回长度
	dcdu 0x10012501//A相最近失压结束时刻
	dcb 6//返回长度
	dcdu 0x10022501//B相最近失压结束时刻
	dcb 6//返回长度
	dcdu 0x10032501//C相最近失压结束时刻
	dcb 6//返回长度
	//当以上命令不成功时为兼容用以下命令读
	dcdu 0x03010000//A,B,C相失压次数,累计时间
	dcb 18//返回长度
	dcdu 0x03010101//A相最近失压起始时刻,A相最近失压结束时刻
	dcb 131//返回长度
	dcdu 0x03010201//B相最近失压起始时刻,B相最近失压结束时刻
	dcb 131//返回长度
	dcdu 0x03010301//C相最近失压起始时刻,c相最近失压结束时刻
	dcb 131//返回长度
	ALIGN
}
/*
	#endif
	#if (USER/100)==6//是湖南系
//F26 A、B、C三相断相统计数据及最近一次断相记录
__asm void ADDR_RM_DL645_2007_F26_Lib(void)
{
	dcb 26//实时Fn
	dcb 16+9//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x10000001//总失压次数
	dcb 3//返回长度
	dcdu 0x10010001//A失压次数
	dcb 3//返回长度
	dcdu 0x10020001//B失压次数
	dcb 3//返回长度
	dcdu 0x10030001//C失压次数
	dcb 3//返回长度
	dcdu 0x10000002//总失压累计时间
	dcb 3//返回长度
	dcdu 0x10010002//A失压累计时间
	dcb 3//返回长度
	dcdu 0x10020002//B失压累计时间
	dcb 3//返回长度
	dcdu 0x10030002//C失压累计时间
	dcb 3//返回长度
	dcdu 0x10000101//总最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10010101//A相最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10020101//B相最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10030101//C相最近失压起始时刻
	dcb 6//返回长度
	dcdu 0x10000201//总最近失压结束时刻
	dcb 6//返回长度
	dcdu 0x10012501//A相最近失压结束时刻
	dcb 6//返回长度
	dcdu 0x10022501//B相最近失压结束时刻
	dcb 6//返回长度
	dcdu 0x10032501//C相最近失压结束时刻
	dcb 6//返回长度
	//当以上命令不成功时为兼容用以下命令读
	dcdu 0x03010000//A相失压次数
	dcb 3//返回长度
	dcdu 0x03010002//B相失压次数
	dcb 3//返回长度
	dcdu 0x03010004//C相失压次数
	dcb 3//返回长度
	dcdu 0x03010001//A相失压时间累计值
	dcb 3//返回长度
	dcdu 0x03010003//B相失压时间累计值
	dcb 3//返回长度
	dcdu 0x03010005//C相失压时间累计值
	dcb 3//返回长度
	dcdu 0x03010101//A相最近失压起始时刻,A相最近失压结束时刻
	dcb 131//返回长度
	dcdu 0x03010201//B相最近失压起始时刻,B相最近失压结束时刻
	dcb 131//返回长度
	dcdu 0x03010301//C相最近失压起始时刻,c相最近失压结束时刻
	dcb 131//返回长度
	ALIGN
}
	#endif
*/
#endif

//F27 电能表日历时钟、编程次数及其最近一次操作时间等
__asm void ADDR_RM_DL645_2007_F27_Lib(void)
{
	dcb 27//实时Fn
	dcb 13//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x04000102//电能表日历时钟Hhmmss
	dcb 3//返回长度
	dcdu 0x04000101//电能表日历时钟YYMMDDWW
	dcb 4//返回长度
	dcdu 0x0280000A//电池工作时间
	dcb 4//返回长度
	dcdu 0x03300000//编程总次数
	dcb 3//返回长度
	dcdu 0x03300001//最近一次编程发生时刻
	dcb 50//返回长度
	dcdu 0x03300100//电表清零总次数
	dcb 3//返回长度
	dcdu 0x03300101//最近一次电表清零发生时刻
	dcb 0//返回长度
	dcdu 0x03300200//需量清零总次数
	dcb 3//返回长度
	dcdu 0x03300201//最近一次需量清零发生时刻
	dcb 0//返回长度
	dcdu 0x03300300//事件清零总次数
	dcb 3//返回长度
	dcdu 0x03300301//最近一次事件清零发生时刻
	dcb 0//返回长度
	dcdu 0x03300400//校时总次数
	dcb 3//返回长度
	dcdu 0x03300401//最近一次校时发生时刻
	dcb 16//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x04000102//电能表日历时钟Hhmmss
	dcb 3//返回长度
//	dcdu 0x04000101//电能表日历时钟YYMMDDWW
	dcb 4//返回长度
//	dcdu 0x0280000A//电池工作时间
	dcb 4//返回长度
//	dcdu 0x03300000//编程总次数
	dcb 3//返回长度
//	dcdu 0x03300001//最近一次编程发生时刻
	dcb 50//返回长度
//	dcdu 0x03300100//电表清零总次数
	dcb 3//返回长度
//	dcdu 0x03300101//最近一次电表清零发生时刻
	dcb 106//返回长度
//	dcdu 0x03300200//需量清零总次数
	dcb 3//返回长度
//	dcdu 0x03300201//最近一次需量清零发生时刻
	dcb 196//202//返回长度
//	dcdu 0x03300300//事件清零总次数
	dcb 3//返回长度
//	dcdu 0x03300301//最近一次事件清零发生时刻
	dcb 14//返回长度
//	dcdu 0x03300400//校时总次数
	dcb 3//返回长度
//	dcdu 0x03300401//最近一次校时发生时刻
	dcb 16//返回长度
	ALIGN
}
//F28 电表运行状态字及其变位标志
__asm void ADDR_RM_DL645_2007_F28_Lib(void)
{
	dcb 28//实时Fn
	dcb 1//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x040005FF//电表运行状态字1-7
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x040005FF//电表运行状态字1-7
	dcb 18//返回长度
	ALIGN
}
//F29 当前铜损、铁损有功总电能示值
__asm void ADDR_RM_DL645_2007_F29_Lib(void)
{
	dcb 29//实时Fn
	dcb 2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00850000//当前铜损有功总电能示值
	dcb 4//返回长度
	dcdu 0x00860000//当前铁损有功总电能示值
	dcb 4//返回长度
	ALIGN
}
//F30 上一结算日铜损、铁损有功总电能示值
__asm void ADDR_RM_DL645_2007_F30_Lib(void)
{
	dcb 30//实时Fn
	dcb 2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00850001//当前铜损有功总电能示值
	dcb 4//返回长度
	dcdu 0x00860001//当前铁损有功总电能示值
	dcb 4//返回长度
	ALIGN
}
//F31 当前A、B、C三相正/反向有功电能示值、组合无功1/2电能示值
__asm void ADDR_RM_DL645_2007_F31_Lib(void)
{
	dcb 31//实时Fn
	dcb 12//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00150000//当前A相正向有功电能示值
	dcb 4//返回长度
	dcdu 0x00160000//当前A相反向有功电能示值
	dcb 4//返回长度
	dcdu 0x00170000//当前A相组合无功1电能示值
	dcb 4//返回长度
	dcdu 0x00180000//当前A相组合无功2电能示值
	dcb 4//返回长度
	dcdu 0x00290000//当前B相正向有功电能示值
	dcb 4//返回长度
	dcdu 0x002A0000//当前B相反向有功电能示值
	dcb 4//返回长度
	dcdu 0x002B0000//当前B相组合无功1电能示值
	dcb 4//返回长度
	dcdu 0x002C0000//当前B相组合无功2电能示值
	dcb 4//返回长度
	dcdu 0x003D0000//当前C相正向有功电能示值
	dcb 4//返回长度
	dcdu 0x003E0000//当前C相反向有功电能示值
	dcb 4//返回长度
	dcdu 0x003F0000//当前C相组合无功1电能示值
	dcb 4//返回长度
	dcdu 0x00400000//当前C相组合无功2电能示值
	dcb 4//返回长度
	ALIGN
}
//F32 上一结算日A、B、C三相正/反向有功电能示值、组合无功1/2电能示值
__asm void ADDR_RM_DL645_2007_F32_Lib(void)
{
	dcb 32//实时Fn
	dcb 12//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00150001//上一结算日A相正向有功电能示值
	dcb 4//返回长度
	dcdu 0x00160001//上一结算日A相反向有功电能示值
	dcb 4//返回长度
	dcdu 0x00170001//上一结算日A相组合无功1电能示值
	dcb 4//返回长度
	dcdu 0x00180001//上一结算日A相组合无功2电能示值
	dcb 4//返回长度
	dcdu 0x00290001//上一结算日B相正向有功电能示值
	dcb 4//返回长度
	dcdu 0x002A0001//上一结算日B相反向有功电能示值
	dcb 4//返回长度
	dcdu 0x002B0001//上一结算日B相组合无功1电能示值
	dcb 4//返回长度
	dcdu 0x002C0001//上一结算日B相组合无功2电能示值
	dcb 4//返回长度
	dcdu 0x003D0001//上一结算日C相正向有功电能示值
	dcb 4//返回长度
	dcdu 0x003E0001//上一结算日C相反向有功电能示值
	dcb 4//返回长度
	dcdu 0x003F0001//上一结算日C相组合无功1电能示值
	dcb 4//返回长度
	dcdu 0x00400001//上一结算日C相组合无功2电能示值
	dcb 4//返回长度
	ALIGN
}

//F33 当前正向有/无功（组合无功1）电能示值、一/四象限无功电能示值（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F33_Lib(void)
{
	dcb 33//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//F34 当前反向有/无功（组合无功2）电能示值、二/三象限无功电能示值（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F34_Lib(void)
{
	dcb 34//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//F35 当月正向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F35_Lib(void)
{
	dcb 35//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//F36 当月反向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F36_Lib(void)
{
	dcb 36//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//F37 上月（上一结算日）正向有/无功（组合无功1）电能示值、一/四象限无功电能示值（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F37_Lib(void)
{
	dcb 37//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//F38 上月（上一结算日）反向有/无功（组合无功2）电能示值、二/三象限无功电能示值（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F38_Lib(void)
{
	dcb 38//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//F39 上月（上一结算日）正向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F39_Lib(void)
{
	dcb 39//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//F40 上月（上一结算日）反向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
__asm void ADDR_RM_DL645_2007_F40_Lib(void)
{
	dcb 40//实时Fn
	dcb 0//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if AFN0CF33MaxPn==0
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}

//F49 当前电压、电流相位角(外部485表,内部交采另扩展)
__asm void ADDR_RM_DL645_2007_F49_Lib(void)
{
	dcb 49//实时Fn
	dcb 1//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000010//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x0207FF00//相角
	dcb 6//返回长度
	ALIGN
}

//F57 当前A、B、C三相电压、电流2～N次谐波有效值
__asm void ADDR_RM_DL645_2007_F57_Lib(void)
{
	dcb 57//实时Fn
	dcb 6//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if MeterHarmonic==0//谐波计算0=没,1=有
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000001//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x020A04FF//A 相电压谐波有效值数据块
	dcb 21*2//返回长度
	dcdu 0x020A05FF//B 相电压谐波有效值数据块
	dcb 21*2//返回长度
	dcdu 0x020A06FF//C 相电压谐波有效值数据块
	dcb 21*2//返回长度
	dcdu 0x020B04FF//A 相电流谐波有效值数据块
	dcb 21*2//返回长度
	dcdu 0x020B05FF//B 相电流谐波有效值数据块
	dcb 21*2//返回长度
	dcdu 0x020B06FF//C 相电流谐波有效值数据块
	dcb 21*2//返回长度
	ALIGN
}
//F58 当前A、B、C三相电压、电流2～N次谐波含有率
__asm void ADDR_RM_DL645_2007_F58_Lib(void)
{
	dcb 58//实时Fn
	dcb 7//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if MeterHarmonic==0//谐波计算0=没,1=有
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000001//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x0208FF00//电压波形失真度数据块
	dcb 6//返回长度
	dcdu 0x020A01FF//A 相电压谐波含量数据块
	dcb 21*2//返回长度
	dcdu 0x020A02FF//B 相电压谐波含量数据块
	dcb 21*2//返回长度
	dcdu 0x020A03FF//C 相电压谐波含量数据块
	dcb 21*2//返回长度
	dcdu 0x020B01FF//A 相电流谐波含量数据块
	dcb 21*2//返回长度
	dcdu 0x020B02FF//B 相电流谐波含量数据块
	dcb 21*2//返回长度
	dcdu 0x020B03FF//C 相电流谐波含量数据块
	dcb 21*2//返回长度
	ALIGN
}

//F65 当前电容器投切状态
//F66 当前电容器累计补偿投入时间和次数
//F67 当日、当月电容器累计补偿的无功电能量
//F73 直流模拟量当前数据


//F129 当前正向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F129_Lib(void)
{
	dcb 129//实时Fn
#if (((USER/100)==5)&&((Project/100)==2))//上海集中器
	dcb 2//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 169//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0000FF00
	dcb 0//返回长度
	dcdu 0x0001FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0000FF00
	dcb 20//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0001FF00
	dcb 20//返回长度
#else
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 169//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0001FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0001FF00
	dcb 20//返回长度
#endif
	ALIGN
}
//F130 当前正向无功（组合无功1）电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F130_Lib(void)
{
	dcb 130//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 170//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0003FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0003FF00
	dcb 20//返回长度
	ALIGN
}
//F131 当前反向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F131_Lib(void)
{
	dcb 131//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 171//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0002FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0002FF00
	dcb 20//返回长度
	ALIGN
}
//F132 当前反向无功（组合无功2）电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F132_Lib(void)
{
	dcb 132//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 172//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0004FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0004FF00
	dcb 20//返回长度
	ALIGN
}
//F133 当前一象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F133_Lib(void)
{
	dcb 133//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 173//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0005FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0005FF00
	dcb 20//返回长度
	ALIGN
}
//F134 当前二象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F134_Lib(void)
{
	dcb 134//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 174//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0006FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0006FF00
	dcb 20//返回长度
	ALIGN
}
//F135 当前三象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F135_Lib(void)
{
	dcb 135//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 175//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0007FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0007FF00
	dcb 20//返回长度
	ALIGN
}
//F136 当前四象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F136_Lib(void)
{
	dcb 136//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 176//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0008FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0008FF00
	dcb 20//返回长度
	ALIGN
}
//F137 上月（上一结算日）正向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F137_Lib(void)
{
	dcb 137//实时Fn
#if (((USER/100)==5)&&((Project/100)==2))//上海集中器
	dcb 2//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 169//抄表日冻结Fn
 #endif
	dcb 177//月冻结Fn
	dcdu 0x0000FF01
	dcb 0//返回长度
	dcdu 0x0001FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0000FF01
	dcb 20//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0001FF01
	dcb 20//返回长度
#else
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 169//抄表日冻结Fn
 #endif
	dcb 177//月冻结Fn
	dcdu 0x0001FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0001FF01
	dcb 20//返回长度
#endif
	ALIGN
}
//F138 上月（上一结算日）正向无功（组合无功1）电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F138_Lib(void)
{
	dcb 138//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 170//抄表日冻结Fn
 #endif
	dcb 178//月冻结Fn
	dcdu 0x0003FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0003FF01
	dcb 20//返回长度
	ALIGN
}
//F139 上月（上一结算日）反向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F139_Lib(void)
{
	dcb 139//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 171//抄表日冻结Fn
 #endif
	dcb 179//月冻结Fn
	dcdu 0x0002FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0002FF01
	dcb 20//返回长度
	ALIGN
}
//F140 上月（上一结算日）反向无功（组合无功2）电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F140_Lib(void)
{
	dcb 140//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 172//抄表日冻结Fn
 #endif
	dcb 180//月冻结Fn
	dcdu 0x0004FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0004FF01
	dcb 20//返回长度
	ALIGN
}
//F141 上月（上一结算日）一象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F141_Lib(void)
{
	dcb 141//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 173//抄表日冻结Fn
 #endif
	dcb 181//月冻结Fn
	dcdu 0x0005FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0005FF01
	dcb 20//返回长度
	ALIGN
}
//F142 上月（上一结算日）二象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F142_Lib(void)
{
	dcb 142//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 174//抄表日冻结Fn
 #endif
	dcb 182//月冻结Fn
	dcdu 0x0006FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0006FF01
	dcb 20//返回长度
	ALIGN
}
//F143 上月（上一结算日）三象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F143_Lib(void)
{
	dcb 143//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 175//抄表日冻结Fn
 #endif
	dcb 183//月冻结Fn
	dcdu 0x0007FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0007FF01
	dcb 20//返回长度
	ALIGN
}
//F144 上月（上一结算日）四象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F144_Lib(void)
{
	dcb 144//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 176//抄表日冻结Fn
 #endif
	dcb 184//月冻结Fn
	dcdu 0x0008FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0008FF01
	dcb 20//返回长度
	ALIGN
}
//F145 当月正向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F145_Lib(void)
{
	dcb 145//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 189//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0101FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0101FF00
	dcb 40//返回长度
	ALIGN
}
//F146 当月正向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F146_Lib(void)
{
	dcb 146//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 190//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0103FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0103FF00
	dcb 40//返回长度
	ALIGN
}
//F147 当月反向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F147_Lib(void)
{
	dcb 147//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 191//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0102FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0102FF00
	dcb 40//返回长度
	ALIGN
}
//F148 当月反向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F148_Lib(void)
{
	dcb 148//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00010001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 192//抄表日冻结Fn
 #else
  dcb 0//抄表日冻结Fn
 #endif
	dcb 0//月冻结Fn
	dcdu 0x0104FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0104FF00
	dcb 40//返回长度
	ALIGN
}
//F149 上月（上一结算日）正向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F149_Lib(void)
{
	dcb 149//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 189//抄表日冻结Fn
 #endif
	dcb 193//月冻结Fn
	dcdu 0x0101FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0101FF01
	dcb 40//返回长度
	ALIGN
}
//F150 上月（上一结算日）正向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F150_Lib(void)
{
	dcb 150//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 190//抄表日冻结Fn
 #endif
	dcb 194//月冻结Fn
	dcdu 0x0103FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
	dcdu 0x0103FF01
	dcb 40//返回长度
	ALIGN
}
//F151 上月（上一结算日）反向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F151_Lib(void)
{
	dcb 151//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 191//抄表日冻结Fn
 #endif
	dcb 195//月冻结Fn
	dcdu 0x0102FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0102FF01
	dcb 40//返回长度
	ALIGN
}
//F152 上月（上一结算日）反向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F152_Lib(void)
{
	dcb 152//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 192//抄表日冻结Fn
 #endif
	dcb 196//月冻结Fn
	dcdu 0x0104FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0104FF01
	dcb 40//返回长度
	ALIGN
}
//F153 第一时区冻结正向有功电能示值（总、费率1～M）

//F154 第二时区冻结正向有功电能示值（总、费率1～M）

//F155 第三时区冻结正向有功电能示值（总、费率1～M）

//F156 第四时区冻结正向有功电能示值（总、费率1～M）

//F157 第五时区冻结正向有功电能示值（总、费率1～M）

//F158 第六时区冻结正向有功电能示值（总、费率1～M）

//F159 第七时区冻结正向有功电能示值（总、费率1～M）

//F160 第八时区冻结正向有功电能示值（总、费率1～M）


//F161 电能表远程控制通断电状态及记录
__asm void ADDR_RM_DL645_2007_F161_Lib(void)
{
	dcb 161//实时Fn
	dcb 5//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x04000503//电表运行状态字3
	dcb 2//返回长度
	dcdu 0x1E0002FF//上1-10次合闸操作者代码
	dcb 40//返回长度
	dcdu 0x1E0001FF//上1-10次合闸发生时刻
	dcb 60//返回长度
	dcdu 0x1D0002FF//上1-10次跳闸操作者代码
	dcb 40//返回长度
	dcdu 0x1D0001FF//上1-10次跳闸发生时刻
	dcb 60//返回长度
	ALIGN
}
//F162 电能表日历时钟
__asm void ADDR_RM_DL645_2007_F162_Lib(void)
{
	dcb 162//实时Fn
	dcb 2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x04000102//电能表日历时钟Hhmmss
	dcb 3//返回长度
	dcdu 0x04000101//电能表日历时钟YYMMDDWW
	dcb 4//返回长度
	ALIGN
}

//F165 电能表开关操作次数及时间
__asm void ADDR_RM_DL645_2007_F165_Lib(void)
{
	dcb 165//实时Fn
#if ERC37==1
	dcb 6//通信标识个数
#else
	dcb 4//通信标识个数
#endif
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 213//月冻结Fn
	dcdu 0x03300000//编程总次数
	dcb 3//返回长度
	dcdu 0x03300001//最近一次编程发生时刻
	dcb 50//返回长度
	dcdu 0x03300E00//电能表尾盖打开次数
	dcb 3//返回长度
	dcdu 0x03300E01//最近一次尾盖打开时间
	dcb 60//返回长度
#if ERC37==1
	dcdu 0x03300D00//电能表开表盖打开次数(仅用于事件记录)
	dcb 3//返回长度
	dcdu 0x03300D01//最近一次开表盖记录(仅用于事件记录)
	dcb 60//返回长度
#endif	
	ALIGN
}
//F166 电能表参数修改次数及时间
__asm void ADDR_RM_DL645_2007_F166_Lib(void)
{
	dcb 166//实时Fn
	dcb 4//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 214//月冻结Fn
	dcdu 0x03300400//电能表时钟修改次数	见附录A.08	次	3
	dcb 3//返回长度
	dcdu 0x03300401//电能表最近一次时钟修改前和后时间
	dcb 16//返回长度
	dcdu 0x03300500//电能表时段参数修改次数
	dcb 3//返回长度
	dcdu 0x03300501//最近一次电能表时段参数修改时间
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x03300400//电能表时钟修改次数	见附录A.08	次	3
	dcb 3//返回长度
//	dcdu 0x03300401//电能表最近一次时钟修改前和后时间
	dcb 16//返回长度
//	dcdu 0x03300500//电能表时段参数修改次数
	dcb 3//返回长度
//	dcdu 0x03300501//最近一次电能表时段参数修改时间
	dcb 0xff//返回长度
}
//F167 电能表购、用电信息
__asm void ADDR_RM_DL645_2007_F167_Lib(void)
{
	dcb 167//实时Fn
	dcb 9//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//210//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 215//月冻结Fn
	dcdu 0x03330201//上1次购电后总购电费次数
	dcb 2//返回长度
	dcdu 0x00900200//（当前）剩余金额
	dcb 4//返回长度
	dcdu 0x03330601//上1次购电后累计购电金额
	dcb 4//返回长度
	dcdu 0x03320201//上1次购电后总购电量次数
	dcb 2//返回长度
	dcdu 0x00900100//（当前）剩余电量
	dcb 4//返回长度
	dcdu 0x00900101//（当前）透支电量
	dcb 4//返回长度
	dcdu 0x03320601//上1次购电后累计购电量
	dcb 4//返回长度
	dcdu 0x04000F04//赊欠门限电量(透支电量限值)
	dcb 4//返回长度
	dcdu 0x04000F01//报警电量(报警电量1)
	dcb 4//返回长度
	//故障电量

	ALIGN
}
//F168 电能表结算信息


//F177 当前组合有功电能示值（总、费率1~M）
__asm void ADDR_RM_DL645_2007_F177_Lib(void)
{
	dcb 177//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x0000FF00
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0000FF00
	dcb 20//返回长度
	ALIGN
}
//F178 上1 结算日组合有功电能示值（总、费率1~M）
__asm void ADDR_RM_DL645_2007_F178_Lib(void)
{
	dcb 178//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x0000FF01
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0000FF01
	dcb 20//返回长度
	ALIGN
}




//扩展 上2月正向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD1_Lib(void)
{
	dcb 0xD1//实时Fn
#if (((USER/100)==5)&&((Project/100)==2))//上海集中器
	dcb 2//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 177//月冻结Fn
	dcdu 0x0000FF02
	dcb 0//返回长度
	dcdu 0x0001FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0000FF02
	dcb 20//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0001FF02
	dcb 20//返回长度
#else
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 177//月冻结Fn
	dcdu 0x0001FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0001FF02
	dcb 20//返回长度
#endif
	ALIGN
}
//扩展 上2月正向无功（组合无功1）电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD2_Lib(void)
{
	dcb 0xD2//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 178//月冻结Fn
	dcdu 0x0003FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0003FF01
	dcb 20//返回长度
	ALIGN
}
//扩展 上2月反向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD3_Lib(void)
{
	dcb 0xD3//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 179//月冻结Fn
	dcdu 0x0002FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0002FF01
	dcb 20//返回长度
	ALIGN
}
//扩展 上2月反向无功（组合无功2）电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD4_Lib(void)
{
	dcb 0xD4//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 180//月冻结Fn
	dcdu 0x0004FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0004FF01
	dcb 20//返回长度
	ALIGN
}
//扩展 上2月一象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD5_Lib(void)
{
	dcb 0xD5//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 181//月冻结Fn
	dcdu 0x0005FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0005FF01
	dcb 20//返回长度
	ALIGN
}
//扩展 上2月二象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD6_Lib(void)
{
	dcb 0xD6//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 182//月冻结Fn
	dcdu 0x0006FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0006FF01
	dcb 20//返回长度
	ALIGN
}
//扩展 上2月三象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD7_Lib(void)
{
	dcb 0xD7//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 183//月冻结Fn
	dcdu 0x0007FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0007FF01
	dcb 20//返回长度
	ALIGN
}
//扩展 上2月四象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD8_Lib(void)
{
	dcb 0xD8//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 184//月冻结Fn
	dcdu 0x0008FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0008FF01
	dcb 20//返回长度
	ALIGN
}
//扩展 上2月正向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xD9_Lib(void)
{
	dcb 0xD9//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 193//月冻结Fn
	dcdu 0x0101FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0101FF01
	dcb 40//返回长度
	ALIGN
}
//扩展 上2月正向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xDA_Lib(void)
{
	dcb 0xDA//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 194//月冻结Fn
	dcdu 0x0103FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
	dcdu 0x0103FF01
	dcb 40//返回长度
	ALIGN
}
//扩展 上2月反向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xDB_Lib(void)
{
	dcb 0xDB//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 195//月冻结Fn
	dcdu 0x0102FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0102FF01
	dcb 40//返回长度
	ALIGN
}
//扩展 上2月反向无功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_F0xDC_Lib(void)
{
	dcb 0xDC//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_AddMonth)+(RMM_Carrier_AddMonth<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 196//月冻结Fn
	dcdu 0x0104FF02
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0104FF01
	dcb 40//返回长度
	ALIGN
}



#if ERC8==1
//扩展1 ERC8电能表参数变更事件用数据
__asm void ADDR_RM_DL645_2007_FE1_Lib(void)
{
	dcb 0xE1//实时Fn
	dcb 13//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x04010001//第1套第1日时段表
	dcb 0//42//返回长度
	dcdu 0x04010002//第1套第2日时段表
	dcb 0//42//返回长度
	dcdu 0x04020001//第2套第1日时段表
	dcb 0//42//返回长度
	dcdu 0x04020002//第2套第2日时段表
	dcb 0//42//返回长度
	dcdu 0x04000B01//每月第1结算日
	dcb 2//返回长度
	dcdu 0x04000B02//每月第2结算日
	dcb 2//返回长度
	dcdu 0x04000B03//每月第3结算日
	dcb 2//返回长度
	dcdu 0x0400040A//电表无功常数
	dcb 3//返回长度
	dcdu 0x04000306//电流互感器变比
	dcb 3//返回长度
	dcdu 0x04000307//电压互感器变比
	dcb 3//返回长度
	dcdu 0x04000409//电表有功常数(互感器变比有些表可能没有，为正确跳过下2项，故读有功常数在此)
	dcb 3//返回长度
	dcdu 0x03300001//最近一次编程发生时刻(当Fn=27不抄时)
	dcb 50//返回长度
	dcdu 0x03300200//需量清零总次数(当Fn=27不抄时)
	dcb 3//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x04010001//第1套第1日时段表
	dcb 42//返回长度
//	dcdu 0x04010002//第1套第2日时段表
	dcb 42//返回长度
//	dcdu 0x04020001//第2套第1日时段表
	dcb 42//返回长度
//	dcdu 0x04020002//第2套第2日时段表
	dcb 42//返回长度
//	dcdu 0x04000B01//每月第1结算日
	dcb 2//返回长度
//	dcdu 0x04000B02//每月第2结算日
	dcb 2//返回长度
//	dcdu 0x04000B03//每月第3结算日
	dcb 2//返回长度
//	dcdu 0x0400040A//电表无功常数
	dcb 3//返回长度
//	dcdu 0x04000306//电流互感器变比
	dcb 3//返回长度
//	dcdu 0x04000307//电压互感器变比
	dcb 3//返回长度
//	dcdu 0x04000409//电表有功常数
	dcb 3//返回长度
//	dcdu 0x03300001//最近一次编程发生时刻
	dcb 50//返回长度
//	dcdu 0x03300200//需量清零总次数
	dcb 3//返回长度
	ALIGN
}
#endif
#if ERC13==1
//扩展2 ERC13电表故障信息事件用数据
__asm void ADDR_RM_DL645_2007_FE2_Lib(void)
{
	dcb 0xE2//实时Fn
	dcb 8//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn

	dcdu 0x13010001//A断相次数
	dcb 3//返回长度
	dcdu 0x13020001//B断相次数
	dcb 3//返回长度
	dcdu 0x13030001//C断相次数
	dcb 3//返回长度
	dcdu 0x10000001//失压总次数
	dcb 3//返回长度
	dcdu 0x03110000//掉电总次数
	dcb 3//返回长度
	
	dcdu 0x03300000//编程总次数(当Fn=27不抄时)
	dcb 3//返回长度
	dcdu 0x03300200//需量清零总次数(当Fn=27不抄时)
	dcb 3//返回长度
	dcdu 0x04000501//电表运行状态字1(当Fn=28不抄时)
	dcb 2//返回长度
	ALIGN
}
#endif
//扩展3 日冻结正反有无功,4个象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL645_2007_FE3_Lib(void)
{
	dcb 0xE3//实时Fn
	dcb 10//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*(RMM_RS485_DateCongeal&1))+((RMM_Carrier_DateCongeal&1)<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00001000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
#if (USER/100)!=11//不是吉林系
	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	dcdu 0x05060101//上1次日正向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060301//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060201//上1次日反向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060401//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060501//上1次日1象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060601//上1次日2象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060701//上1次日3象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060801//上1次日4象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060001//（上1次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//	dcdu 0x05060101//上1次日正向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060301//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060201//上1次日反向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060401//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060501//上1次日1象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060601//上1次日2象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060701//上1次日3象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060801//上1次日4象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060001//（上1次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#else
	//是吉林系
	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	dcdu 0x05060101//上1次日正向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000301//上一次定时冻结//0x05060301//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060201//上1次日反向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000401//上一次定时冻结//0x05060401//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000501//上一次定时冻结//0x05060501//上1次日1象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000601//上一次定时冻结//0x05060601//上1次日2象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000701//上一次定时冻结//0x05060701//上1次日3象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000801//上一次定时冻结//0x05060801//上1次日4象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060001//（上1次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//	dcdu 0x05060101//上1次日正向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060301//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060201//上1次日反向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060401//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060501//上1次日1象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060601//上1次日2象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060701//上1次日3象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060801//上1次日4象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060001//（上1次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#endif
	ALIGN
}

//扩展 RS485用读全部6类负荷曲线
__asm void ADDR_RM_DL645_2007_FE4_Lib(void)
{
	dcb 0xE4//实时Fn
	dcb 96*2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*((RMM_RS485_IntegralCongeal&0x2)>>1))//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x06000001
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x06000001
	dcb 103//返回长度
	ALIGN
}
//扩展 载波用读1类负荷曲线(电压、电流、频率)
__asm void ADDR_RM_DL645_2007_FE5_Lib(void)
{
	dcb 0xE5//实时Fn
	dcb 96*2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb ((RMM_Carrier_IntegralCongeal&0x2)<<1)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x06010001
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x06010001
	dcb 33//返回长度
	ALIGN
}
//扩展 载波用读2类负荷曲线(有无功功率)
__asm void ADDR_RM_DL645_2007_FE6_Lib(void)
{
	dcb 0xE6//实时Fn
	dcb 96*2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb ((RMM_Carrier_IntegralCongeal&0x2)<<1)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x06020001
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x06020001
	dcb 40//返回长度
	ALIGN
}
//扩展 载波用读3类负荷曲线(功率因数)
__asm void ADDR_RM_DL645_2007_FE7_Lib(void)
{
	dcb 0xE7//实时Fn
	dcb 96*2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb ((RMM_Carrier_IntegralCongeal&0x2)<<1)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x06030001
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x06030001
	dcb 24//返回长度
	ALIGN
}
//扩展 载波用读4类负荷曲线(正反有功,組合无功1和2总电能)
__asm void ADDR_RM_DL645_2007_FE8_Lib(void)
{
	dcb 0xE8//实时Fn
	dcb 96*2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb ((RMM_Carrier_IntegralCongeal&0x2)<<1)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x06040001
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x06040001
	dcb 32//返回长度
	ALIGN
}
//扩展 载波用读5类负荷曲线(1-4象限无功总电能)
__asm void ADDR_RM_DL645_2007_FE9_Lib(void)
{
	dcb 0xE9//实时Fn
	dcb 96*2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb ((RMM_Carrier_IntegralCongeal&0x2)<<1)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x06050001
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x06050001
	dcb 32//返回长度
	ALIGN
}
/*
//扩展 载波用读6类负荷曲线(当前有功需量,当前无功需量)
__asm void ADDR_RM_DL645_2007_FEA_Lib(void)
{
	dcb 0xEA//实时Fn
	dcb 96*2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb ((RMM_Carrier_IntegralCongeal&0x2)<<1)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x06060001
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x06060001
	dcb 22//返回长度
	ALIGN
}
*/

//扩展11 日冻结正向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_FEB_Lib(void)
{
	dcb 0xEB//实时Fn
	dcb 2//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*(RMM_RS485_DateCongeal&1))+((RMM_Carrier_DateCongeal&1)<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00001000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 185//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
#if (USER/100)!=11//不是吉林系
	dcdu 0x05060901
	dcb 0//返回长度
	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#else
	//是吉林系
	dcdu 0x05000901//上1次定时冻结//0x05060901
	dcb 0//返回长度
	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#endif
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060901
	dcb 40//返回长度
//	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	ALIGN
}
//扩展12 日冻结反向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL645_2007_FEC_Lib(void)
{
	dcb 0xEC//实时Fn
	dcb 2//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*(RMM_RS485_DateCongeal&1))+((RMM_Carrier_DateCongeal&1)<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00001000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 187//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
#if (USER/100)!=11//不是吉林系
	dcdu 0x05060A01
	dcb 0//返回长度
	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#else
	//是吉林系
	dcdu 0x05000A01//上1次定时冻结//0x05060A01
	dcb 0//返回长度
	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#endif
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060A01
	dcb 40//返回长度
//	dcdu 0x05060001//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	ALIGN
}

//扩展13 上1-24整点电表冻结的正反有功电能示值
__asm void ADDR_RM_DL645_2007_FED_Lib(void)
{
	dcb 0xED//实时Fn
	dcb 24//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*(RMM_RS485_IntegralCongeal&1))+((RMM_Carrier_IntegralCongeal&1)<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000100//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x0504FF01//上1次
	dcb 0//返回长度
	dcdu 0x0504FF02//上2次
	dcb 0//返回长度
	dcdu 0x0504FF03//上3次
	dcb 0//返回长度
	dcdu 0x0504FF04//上4次
	dcb 0//返回长度
	dcdu 0x0504FF05//上5次
	dcb 0//返回长度
	dcdu 0x0504FF06//上6次
	dcb 0//返回长度
	dcdu 0x0504FF07//上7次
	dcb 0//返回长度
	dcdu 0x0504FF08//上8次
	dcb 0//返回长度
	dcdu 0x0504FF09//上9次
	dcb 0//返回长度
	dcdu 0x0504FF0a//上10次
	dcb 0//返回长度
	dcdu 0x0504FF0b//上11次
	dcb 0//返回长度
	dcdu 0x0504FF0c//上12次
	dcb 0//返回长度
	dcdu 0x0504FF0d//上13次
	dcb 0//返回长度
	dcdu 0x0504FF0e//上14次
	dcb 0//返回长度
	dcdu 0x0504FF0f//上15次
	dcb 0//返回长度
	dcdu 0x0504FF10//上16次
	dcb 0//返回长度
	dcdu 0x0504FF11//上17次
	dcb 0//返回长度
	dcdu 0x0504FF12//上18次
	dcb 0//返回长度
	dcdu 0x0504FF13//上19次
	dcb 0//返回长度
	dcdu 0x0504FF14//上20次
	dcb 0//返回长度
	dcdu 0x0504FF15//上21次
	dcb 0//返回长度
	dcdu 0x0504FF16//上22次
	dcb 0//返回长度
	dcdu 0x0504FF17//上23次
	dcb 0//返回长度
	dcdu 0x0504FF18//上24次
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0504FF01//上1次
	dcb 16//返回长度
//	dcdu 0x0504FF02//上2次
	dcb 16//返回长度
//	dcdu 0x0504FF03//上3次
	dcb 16//返回长度
//	dcdu 0x0504FF04//上4次
	dcb 16//返回长度
//	dcdu 0x0504FF05//上5次
	dcb 16//返回长度
//	dcdu 0x0504FF06//上6次
	dcb 16//返回长度
//	dcdu 0x0504FF07//上7次
	dcb 16//返回长度
//	dcdu 0x0504FF08//上8次
	dcb 16//返回长度
//	dcdu 0x0504FF09//上9次
	dcb 16//返回长度
//	dcdu 0x0504FF0a//上10次
	dcb 16//返回长度
//	dcdu 0x0504FF0b//上11次
	dcb 16//返回长度
//	dcdu 0x0504FF0c//上12次
	dcb 16//返回长度
//	dcdu 0x0504FF0d//上13次
	dcb 16//返回长度
//	dcdu 0x0504FF0e//上14次
	dcb 16//返回长度
//	dcdu 0x0504FF0f//上15次
	dcb 16//返回长度
//	dcdu 0x0504FF10//上16次
	dcb 16//返回长度
//	dcdu 0x0504FF11//上17次
	dcb 16//返回长度
//	dcdu 0x0504FF12//上18次
	dcb 16//返回长度
//	dcdu 0x0504FF13//上19次
	dcb 16//返回长度
//	dcdu 0x0504FF14//上20次
	dcb 16//返回长度
//	dcdu 0x0504FF15//上21次
	dcb 16//返回长度
//	dcdu 0x0504FF16//上22次
	dcb 16//返回长度
//	dcdu 0x0504FF17//上23次
	dcb 16//返回长度
//	dcdu 0x0504FF18//上24次
	dcb 16//返回长度
	ALIGN
}

//扩展14 补抄上2日日冻结数据
__asm void ADDR_RM_DL645_2007_FEE_Lib(void)
{
	dcb 0xEE//实时Fn
	#if (((USER/100)==5)&&(Project==300))//上海专变
	dcb 12//通信标识个数
	#else
	dcb 10//通信标识个数
	#endif
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_Congeal)+(RMM_Carrier_Congeal<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_01000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
#if (USER/100)!=11//不是吉林系
	dcdu 0x05060002//（上2次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	dcdu 0x05060102//上2次日正向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060302//上2次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060202//上2次日反向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060402//上2次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060502//上2次日1象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060602//上2次日2象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060702//上2次日3象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060802//上2次日4象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060002//（上2次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	#if (((USER/100)==5)&&(Project==300))//上海专变
	dcdu 0x05060902//上2次日冻结正向有功最大需量及发生时间
	dcb 0//返回长度
	dcdu 0x05060A02//上2次日冻结反向有功最大需量及发生时间
	dcb 0//返回长度
	#endif
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060002//（上2次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//	dcdu 0x05060102//上2次日正向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060302//上2次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060202//上2次日反向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060402//上2次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060502//上2次日1象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060602//上2次日2象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060702//上2次日3象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060802//上2次日4象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060002//（上2次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	#if (((USER/100)==5)&&(Project==300))//上海专变
//	dcdu 0x05060902//上2次日冻结正向有功最大需量及发生时间
	dcb 40//返回长度
//	dcdu 0x05060A02//上2次日冻结反向有功最大需量及发生时间
	dcb 40//返回长度
	#endif
#else
	//是吉林系
	dcdu 0x05060002//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	dcdu 0x05060102//上1次日正向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000302//上一次定时冻结//0x05060301//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060202//上1次日反向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000402//上一次定时冻结//0x05060401//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000502//上一次定时冻结//0x05060501//上1次日1象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000602//上一次定时冻结//0x05060601//上1次日2象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000702//上一次定时冻结//0x05060701//上1次日3象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000802//上一次定时冻结//0x05060801//上1次日4象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060002//（上1次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060002//（上2次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//	dcdu 0x05060102//上2次日正向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060302//上2次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060202//上2次日反向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060402//上2次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060502//上2次日1象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060602//上2次日2象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060702//上2次日3象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060802//上2次日4象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060002//（上2次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#endif
	ALIGN
}

//扩展15 补抄上3日日冻结数据
__asm void ADDR_RM_DL645_2007_FEF_Lib(void)
{
	dcb 0xEF//实时Fn
	#if (((USER/100)==5)&&(Project==300))//上海专变
	dcb 12//通信标识个数
	#else
	dcb 10//通信标识个数
	#endif
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*RMM_RS485_Congeal)+(RMM_Carrier_Congeal<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_01000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
#if (USER/100)!=11//不是吉林系
	dcdu 0x05060003//（上3次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	dcdu 0x05060103//上3次日正向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060303//上3次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060203//上3次日反向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060403//上3次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060503//上3次日1象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060603//上3次日2象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060703//上3次日3象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060803//上3次日4象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060003//（上3次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	#if (((USER/100)==5)&&(Project==300))//上海专变
	dcdu 0x05060903//上3次日冻结正向有功最大需量及发生时间
	dcb 0//返回长度
	dcdu 0x05060A03//上3次日冻结反向有功最大需量及发生时间
	dcb 0//返回长度
	#endif
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060003//（上3次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//	dcdu 0x05060103//上3次日正向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060303//上3次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060203//上3次日反向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060403//上3次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060503//上3次日1象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060603//上3次日2象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060703//上3次日3象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060803//上3次日4象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060003//（上3次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	#if (((USER/100)==5)&&(Project==300))//上海专变
//	dcdu 0x05060903//上3次日冻结正向有功最大需量及发生时间
	dcb 40//返回长度
//	dcdu 0x05060A03//上3次日冻结反向有功最大需量及发生时间
	dcb 40//返回长度
	#endif
#else
	//是吉林系
	dcdu 0x05060003//（上1次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
	dcdu 0x05060103//上1次日正向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000303//上一次定时冻结//0x05060301//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060203//上1次日反向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000403//上一次定时冻结//0x05060401//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000503//上一次定时冻结//0x05060501//上1次日1象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000603//上一次定时冻结//0x05060601//上1次日2象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000703//上一次定时冻结//0x05060701//上1次日3象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05000803//上一次定时冻结//0x05060801//上1次日4象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x05060003//（上1次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060003//（上3次）日冻结时间YYMMDDhhmm
	dcb 5//返回长度
//	dcdu 0x05060103//上3次日正向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060303//上3次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060203//上3次日反向有功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060403//上3次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060503//上3次日1象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060603//上3次日2象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060703//上3次日3象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060803//上3次日4象限无功电能示值（总、费率1～M）
	dcb 20//返回长度
//	dcdu 0x05060003//（上3次）再次确认日冻结时间YYMMDDhhmm
	dcb 5//返回长度
#endif
	ALIGN
}

#if ERC40==1
//扩展16 恒定磁场干扰总次数
__asm void ADDR_RM_DL645_2007_FF0_Lib(void)
{
	dcb 0xF0//实时Fn
	dcb 2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x03350000//恒定磁场干扰总次数
	dcb 3//返回长度
	dcdu 0x03350001//(上1次) 恒定磁场干扰记录
	dcb 28//返回长度
	ALIGN
}
#endif

//扩展17 当前电压、电流相位角(扩展用于终端内部交采)
__asm void ADDR_RM_DL645_2007_FF1_Lib(void)
{
	dcb 0xF1//实时Fn
	dcb 1//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000001//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x020CFF00//相角(UA总是0,其他相对UA)(扩展用于终端内部交采)
	dcb 12//返回长度
	ALIGN
}

#if (USER/100)==2//用户标识:山东版
//扩展 ERC9电流回路异常事件用数据
__asm void ADDR_RM_DL645_2007_FF2_Lib(void)
{
	dcb 0xF2//实时Fn
	dcb 6//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x1A010001//A相断流总次数
	dcb 3//返回长度
	dcdu 0x1A020001//B相断流总次数
	dcb 3//返回长度
	dcdu 0x1A030001//C相断流总次数
	dcb 3//返回长度
	dcdu 0x0201ff00//A,B,C相电压(当事件产生时实时读)
	dcb 6//返回长度
	dcdu 0x0202ff00//A,B,C相电流(当事件产生时实时读)
	dcb 9//返回长度
	dcdu 0x00010000//(当前)正向有功总电能(当事件产生时实时读)
	dcb 4//返回长度
	ALIGN
}
#endif
#if (((USER/100)==2)||((USER/100)==5))//用户标识:山东,上海
//扩展 ERC10电压回路异常事件用数据
__asm void ADDR_RM_DL645_2007_FF3_Lib(void)
{
	dcb 0xF3//实时Fn
	dcb 12//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x03050000//全失压总次数,累计时间
	dcb 6//返回长度
	dcdu 0x10010001//A相失压次数	见附录A.10	次	3
	dcb 3//返回长度
	dcdu 0x10020001//B相失压次数	见附录A.10	次	3
	dcb 3//返回长度
	dcdu 0x10030001//C相失压次数	见附录A.10	次	3
	dcb 3//返回长度
	dcdu 0x03010000//A,B,C失压总次数累计时间(老命令当上命令抄不到时抄)
	dcb 18//返回长度
	dcdu 0x13010001//A断相次数
	dcb 3//返回长度
	dcdu 0x13020001//B断相次数
	dcb 3//返回长度
	dcdu 0x13030001//C断相次数
	dcb 3//返回长度
	dcdu 0x03040000//A,B,C断相总次数累计时间(老命令当上命令抄不到时抄)
	dcb 18//返回长度
	
	dcdu 0x0201ff00//A,B,C相电压(当事件产生时实时读)
	dcb 6//返回长度
	dcdu 0x0202ff00//A,B,C相电流(当事件产生时实时读)
	dcb 9//返回长度
	dcdu 0x00010000//(当前)正向有功总电能(当事件产生时实时读)
	dcb 4//返回长度
	ALIGN
}
#endif
#if (USER/100)==2//用户标识:山东版
//扩展 ERC29电能表飞走事件,ERC28电能表超差事件用数据
__asm void ADDR_RM_DL645_2007_FF4_Lib(void)
{
	dcb 0xF4//实时Fn
	dcb 1//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x02030000//瞬时总有功功率
	dcb 3//返回长度
	ALIGN
}
#endif

//扩展 F246当前掉电记录数据
__asm void ADDR_RM_DL645_2007_FF6_Lib(void)
{
	dcb 0xF6//实时Fn
	dcb 11//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x03110000//掉电总次数
	dcb 3//返回长度
	dcdu 0x03110001//(上1次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110002//(上2次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110003//(上3次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110004//(上4次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110005//(上5次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110006//(上6次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110007//(上7次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110008//(上8次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x03110009//(上9次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	dcdu 0x0311000A//(上10次)掉电发生时刻，结束时刻
	dcb 12//返回长度
	ALIGN
}
#if (USER/100)==5//用户标识:上海
//ERC68电能表负荷开关误动作事件记录数据
__asm void ADDR_RM_DL645_2007_FF7_Lib(void)
{
	dcb 0xF7//实时Fn
	dcb 2//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x03360000//误动作总次数
	dcb 3//返回长度
	dcdu 0x03360001//(上1次)负荷开关误动作记录
	dcb 29//返回长度
	ALIGN
}
//显示用失压全失压数据
__asm void ADDR_RM_DL645_2007_FF8_Lib(void)
{
	dcb 0xF8//实时Fn
	dcb 27//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x10000001//总失压次数	见附录A.10	次	3
	dcb 3//返回长度
	dcdu 0x10000002//失压时间累计值	见附录A.10	min	3
	dcb 3//返回长度
	dcdu 0x10010002//A相失压时间累计值	见附录A.10	min	3
	dcb 3//返回长度
	dcdu 0x10020002//B相失压时间累计值	见附录A.10	min	3
	dcb 3//返回长度
	dcdu 0x10030002//C相失压时间累计值	见附录A.10	min	3
	dcb 3//返回长度
	dcdu 0x10000101//最近1次失压起始时刻	秒分时日月年	6
	dcb 6//返回长度
	dcdu 0x10000201//最近1次失压结束时刻	秒分时日月年	6
	dcb 6//返回长度
	dcdu 0x100101ff//A相最近1-10次失压起始时刻	秒分时日月年	6*10
	dcb 60//返回长度
	dcdu 0x100125ff//A相最近1-10次失压结束时刻	秒分时日月年	6*10
	dcb 60//返回长度
	dcdu 0x100201ff//B相最近1-10次失压起始时刻	秒分时日月年	6*10
	dcb 60//返回长度
	dcdu 0x100225ff//B相最近1-10次失压结束时刻	秒分时日月年	6*10
	dcb 60//返回长度
	dcdu 0x100301ff//C相最近1-10次失压起始时刻	秒分时日月年	6*10
	dcb 60//返回长度
	dcdu 0x100325ff//C相最近1-10次失压结束时刻	秒分时日月年	6*10
	dcb 60//返回长度
	
	dcdu 0x03050001//（上1次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050002//（上2次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050003//（上3次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050004//（上4次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050005//（上5次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050006//（上6次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050007//（上7次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050008//（上8次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x03050009//（上9次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x0305000a//（上10次）全失压发生时刻，电流值，结束时刻
	dcb 15//返回长度
	dcdu 0x16000001//电压不平衡总次数(ERC17用户)
	dcb 3//返回长度
	dcdu 0x16001201//电压最大不平衡率(ERC17用户)
	dcb 3//返回长度
	dcdu 0x03090000//(上命令不通时用老抄)电压不平衡总次数,总累计时间(ERC17用)
	dcb 6//返回长度
	dcdu 0x03090001//(上命令不通时用老抄)电压最大不平衡率(ERC17用)
	dcb 78//返回长度
	
	ALIGN
}
#endif
#if (USER/100)==11//吉林系
__asm void ADDR_RM_DL645_2007_FF9_Lib(void)
{
	dcb 0xF9//实时Fn
	dcb 3//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00001001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 27//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x03100100//（当月）A 相电压合格率统计数据
	dcb 25//返回长度
	dcdu 0x03100200//（当月）B 相电压合格率统计数据
	dcb 25//返回长度
	dcdu 0x03100300//（当月）C 相电压合格率统计数据
	dcb 25//返回长度
	ALIGN
}
__asm void ADDR_RM_DL645_2007_FFA_Lib(void)
{
	dcb 0xFA//实时Fn
	dcb 3//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 35//月冻结Fn
	dcdu 0x03100101//（上1月）A 相电压合格率统计数据
	dcb 25//返回长度
	dcdu 0x03100201//（上1月）B 相电压合格率统计数据
	dcb 25//返回长度
	dcdu 0x03100301//（上1月）C 相电压合格率统计数据
	dcb 25//返回长度
	ALIGN
}
__asm void ADDR_RM_DL645_2007_FFB_Lib(void)
{
	dcb 0xFB//实时Fn
	dcb 24//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 89//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x05200101//上1日0点电压冻结A,B,C相数据 00:00、 00:15、00:30、00:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200102//上1日1点电压冻结A,B,C相数据 01:00、 01:15、01:30、01:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200103//上1日2点电压冻结A,B,C相数据 02:00、 02:15、02:30、02:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200104//上1日3点电压冻结A,B,C相数据 03:00、 03:15、03:30、03:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200105//上1日4点电压冻结A,B,C相数据 04:00、 04:15、04:30、04:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200106//上1日5点电压冻结A,B,C相数据 05:00、 05:15、05:30、05:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200107//上1日6点电压冻结A,B,C相数据 06:00、 06:15、06:30、06:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200108//上1日7点电压冻结A,B,C相数据 07:00、 07:15、07:30、07:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200109//上1日8点电压冻结A,B,C相数据 08:00、 08:15、08:30、08:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x0520010A//上1日9点电压冻结A,B,C相数据 09:00、 09:15、09:30、09:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x0520010B//上1日10点电压冻结A,B,C相数据 10:00、 10:15、10:30、10:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x0520010C//上1日11点电压冻结A,B,C相数据 11:00、 11:15、11:30、11:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x0520010D//上1日12点电压冻结A,B,C相数据 12:00、 12:15、12:30、12:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x0520010E//上1日13点电压冻结A,B,C相数据 13:00、 13:15、13:30、13:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x0520010F//上1日14点电压冻结A,B,C相数据 14:00、 14:15、14:30、14:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200110//上1日15点电压冻结A,B,C相数据 15:00、 15:15、15:30、15:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200111//上1日16点电压冻结A,B,C相数据 16:00、 16:15、16:30、16:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200112//上1日17点电压冻结A,B,C相数据 17:00、 17:15、17:30、17:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200113//上1日18点电压冻结A,B,C相数据 18:00、 18:15、18:30、18:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200114//上1日19点电压冻结A,B,C相数据 19:00、 19:15、19:30、19:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200115//上1日20点电压冻结A,B,C相数据 20:00、 20:15、20:30、20:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200116//上1日21点电压冻结A,B,C相数据 21:00、 21:15、21:30、21:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200117//上1日22点电压冻结A,B,C相数据 22:00、 22:15、22:30、22:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3
	dcdu 0x05200118//上1日23点电压冻结A,B,C相数据 23:00、 23:15、23:30、23:45
	dcb 0//返回长度2*4*P,P：单相表为1，三相表为3

//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05200101//上1日0点电压冻结A,B,C相数据 00:00、 00:15、00:30、00:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200102//上1日1点电压冻结A,B,C相数据 01:00、 01:15、01:30、01:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200103//上1日2点电压冻结A,B,C相数据 02:00、 02:15、02:30、02:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200104//上1日3点电压冻结A,B,C相数据 03:00、 03:15、03:30、03:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200105//上1日4点电压冻结A,B,C相数据 04:00、 04:15、04:30、04:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200106//上1日5点电压冻结A,B,C相数据 05:00、 05:15、05:30、05:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200107//上1日6点电压冻结A,B,C相数据 06:00、 06:15、06:30、06:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200108//上1日7点电压冻结A,B,C相数据 07:00、 07:15、07:30、07:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200109//上1日8点电压冻结A,B,C相数据 08:00、 08:15、08:30、08:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x0520010A//上1日9点电压冻结A,B,C相数据 09:00、 09:15、09:30、09:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x0520010B//上1日10点电压冻结A,B,C相数据 10:00、 10:15、10:30、10:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x0520010C//上1日11点电压冻结A,B,C相数据 11:00、 11:15、11:30、11:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x0520010D//上1日12点电压冻结A,B,C相数据 12:00、 12:15、12:30、12:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x0520010E//上1日13点电压冻结A,B,C相数据 13:00、 13:15、13:30、13:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x0520010F//上1日14点电压冻结A,B,C相数据 14:00、 14:15、14:30、14:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200110//上1日15点电压冻结A,B,C相数据 15:00、 15:15、15:30、15:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200111//上1日16点电压冻结A,B,C相数据 16:00、 16:15、16:30、16:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200112//上1日17点电压冻结A,B,C相数据 17:00、 17:15、17:30、17:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200113//上1日18点电压冻结A,B,C相数据 18:00、 18:15、18:30、18:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200114//上1日19点电压冻结A,B,C相数据 19:00、 19:15、19:30、19:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200115//上1日20点电压冻结A,B,C相数据 20:00、 20:15、20:30、20:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200116//上1日21点电压冻结A,B,C相数据 21:00、 21:15、21:30、21:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200117//上1日22点电压冻结A,B,C相数据 22:00、 22:15、22:30、22:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
//	dcdu 0x05200118//上1日23点电压冻结A,B,C相数据 23:00、 23:15、23:30、23:45
	dcb 24//返回长度2*4*P,P：单相表为1，三相表为3
	ALIGN
}
#endif


const u32 DL645_2007_RMLib[]=
{
//F0 通用
	(u32)ADDR_RM_DL645_2007_F0_Lib,
//F1 重点户曲线(仅对无曲线冻结的单相表)
	(u32)ADDR_RM_DL645_2007_F1_Lib,
//F2 电能表主动上报事件(Fn计数固定值=2)
	(u32)ADDR_RM_DL645_2007_F2_Lib,
//F3 周期抄读电能表事件
	(u32)ADDR_RM_DL645_2007_F3_Lib,


//F129第1个抄,用以判断通信是否正常
//0 F129 当前正向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F129_Lib,
//1 F130 当前正向无功（组合无功1）电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F130_Lib,
//2 F131 当前反向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F131_Lib,
//3 F132 当前反向无功（组合无功2）电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F132_Lib,
//4 F133 当前一象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F133_Lib,
//5 F134 当前二象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F134_Lib,
//6 F135 当前三象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F135_Lib,
//7 F136 当前四象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F136_Lib,
//8 F137 上月（上一结算日）正向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F137_Lib,
//9 F138 上月（上一结算日）正向无功（组合无功1）电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F138_Lib,
//10 F139 上月（上一结算日）反向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F139_Lib,
//11 F140 上月（上一结算日）反向无功（组合无功2）电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F140_Lib,
//12 F141 上月（上一结算日）一象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F141_Lib,
//13 F142 上月（上一结算日）二象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F142_Lib,
//14 F143 上月（上一结算日）三象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F143_Lib,
//15 F144 上月（上一结算日）四象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F144_Lib,
//16 F145 当月正向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F145_Lib,
//17 F146 当月正向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F146_Lib,
//18 F147 当月反向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F147_Lib,
//19 F148 当月反向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F148_Lib,
//20 F149 上月（上一结算日）正向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F149_Lib,
//21 F150 上月（上一结算日）正向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F150_Lib,
//22 F151 上月（上一结算日）反向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F151_Lib,
//23 F152 上月（上一结算日）反向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F152_Lib,

//24 F28 电表运行状态字及其变位标志
	(u32)ADDR_RM_DL645_2007_F28_Lib,
//25 F25 当前三相及总有/无功功率、功率因数，三相电压、电流、零序电流、视在功率
	(u32)ADDR_RM_DL645_2007_F25_Lib,
//26 F26 A、B、C三相断相统计数据及最近一次断相记录
	(u32)ADDR_RM_DL645_2007_F26_Lib,
//27 F27 电能表日历时钟、编程次数及其最近一次操作时间
	(u32)ADDR_RM_DL645_2007_F27_Lib,
//28 F29 当前铜损、铁损有功总电能示值
	(u32)ADDR_RM_DL645_2007_F29_Lib,
//29 F30 上一结算日铜损、铁损有功总电能示值
	(u32)ADDR_RM_DL645_2007_F30_Lib,
//30 F31 当前A、B、C三相正/反向有功电能示值、组合无功1/2电能示值
	(u32)ADDR_RM_DL645_2007_F31_Lib,
//31 F32 上一结算日A、B、C三相正/反向有功电能示值、组合无功1/2电能示值
	(u32)ADDR_RM_DL645_2007_F32_Lib,

//32 F49 当前电压、电流相位角(外部458表)
	(u32)ADDR_RM_DL645_2007_F49_Lib,
//扩展17 当前电压、电流相位角(扩展用于终端内部交采)
	(u32)ADDR_RM_DL645_2007_FF1_Lib,

//33 F57 当前A、B、C三相电压、电流2～N次谐波有效值
	(u32)ADDR_RM_DL645_2007_F57_Lib,
//34 F58 当前A、B、C三相电压、电流2～N次谐波含有率
	(u32)ADDR_RM_DL645_2007_F58_Lib,
////35 F65 当前电容器投切状态
//	0,
////36 F66 当前电容器累计补偿投入时间和次数
//	0,
////37 F67 当日、当月电容器累计补偿的无功电能量
//	0,
////38 F73 直流模拟量当前数据
//	0,
//
////39 F153 第一时区冻结正向有功电能示值（总、费率1～M）
//	0,
////40 F154 第二时区冻结正向有功电能示值（总、费率1～M）
//	0,
////41 F155 第三时区冻结正向有功电能示值（总、费率1～M）
//	0,
////42 F156 第四时区冻结正向有功电能示值（总、费率1～M）
//	0,
////43 F157 第五时区冻结正向有功电能示值（总、费率1～M）
//	0,
////44 F158 第六时区冻结正向有功电能示值（总、费率1～M）
//	0,
////45 F159 第七时区冻结正向有功电能示值（总、费率1～M）
//	0,
////46 F160 第八时区冻结正向有功电能示值（总、费率1～M）
//	0,
//47 F161 电能表远程控制通断电状态及记录
	(u32)ADDR_RM_DL645_2007_F161_Lib,
//48 F162 电能表日历时钟
	(u32)ADDR_RM_DL645_2007_F162_Lib,
//49 F165 电能表开关操作次数及时间
	(u32)ADDR_RM_DL645_2007_F165_Lib,
//50 F166 电能表参数修改次数及时间
	(u32)ADDR_RM_DL645_2007_F166_Lib,
//51 F167 电能表购、用电信息
	(u32)ADDR_RM_DL645_2007_F167_Lib,
//52 F168 电能表结算信息
	0,

//53 F177 当前组合有功电能示值（总、费率1~M）
	(u32)ADDR_RM_DL645_2007_F177_Lib,
//54 F178 上1 结算日组合有功电能示值（总、费率1~M）
	(u32)ADDR_RM_DL645_2007_F178_Lib,

//F33～F40抄表数据组合总是放在最后
//55 F33 当前正向有/无功（组合无功1）电能示值、一/四象限无功电能示值（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F33_Lib,
//56 F34 当前反向有/无功（组合无功2）电能示值、二/三象限无功电能示值（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F34_Lib,
//57 F35 当月正向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F35_Lib,
//58 F36 当月反向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F36_Lib,
//59 F37 上月（上一结算日）正向有/无功（组合无功1）电能示值、一/四象限无功电能示值（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F37_Lib,
//60 F38 上月（上一结算日）反向有/无功（组合无功2）电能示值、二/三象限无功电能示值（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F38_Lib,
//61 F39 上月（上一结算日）正向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F39_Lib,
//62 F40 上月（上一结算日）反向有/无功最大需量及发生时间（总、费率1～M，1≤M≤12）
	(u32)ADDR_RM_DL645_2007_F40_Lib,
	



//扩展0xD1 上2月正向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD1_Lib,
//扩展0xD2 上2月正向无功（组合无功1）电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD2_Lib,
//扩展0xD3 上2月反向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD3_Lib,
//扩展0xD4 上2月反向无功（组合无功2）电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD4_Lib,
//扩展0xD5 上2月一象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD5_Lib,
//扩展0xD6 上2月二象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD6_Lib,
//扩展0xD7 上2月三象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD7_Lib,
//扩展0xD8 上2月四象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD8_Lib,
//扩展0xD9 上2月正向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xD9_Lib,
//扩展0xDA 上2月正向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xDA_Lib,
//扩展0xDB 上2月反向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xDB_Lib,
//扩展0xDC 上2月反向无功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_F0xDC_Lib,

#if ERC8==1
//63 扩展1 ERC8电能表参数变更事件用数据
	(u32)ADDR_RM_DL645_2007_FE1_Lib,
#endif
#if ERC13==1
//64 扩展2 ERC13电表故障信息事件用数据
	(u32)ADDR_RM_DL645_2007_FE2_Lib,
#endif
//65 扩展3 日冻结正反有无功,4个象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_FE3_Lib,
//扩展 RS485用读全部6类负荷曲线
	(u32)ADDR_RM_DL645_2007_FE4_Lib,
//扩展 载波用读1类负荷曲线(电压、电流、频率)
	(u32)ADDR_RM_DL645_2007_FE5_Lib,
//扩展 载波用读2类负荷曲线(有无功功率)
	(u32)ADDR_RM_DL645_2007_FE6_Lib,
//扩展 载波用读3类负荷曲线(功率因数)
	(u32)ADDR_RM_DL645_2007_FE7_Lib,
//扩展 载波用读4类负荷曲线(正反有功,組合无功1和2总电能)
	(u32)ADDR_RM_DL645_2007_FE8_Lib,
//扩展 载波用读5类负荷曲线(1-4象限无功总电能)
	(u32)ADDR_RM_DL645_2007_FE9_Lib,
//扩展 载波用读6类负荷曲线(当前有功需量,当前无功需量)
	//(u32)ADDR_RM_DL645_2007_FEA_Lib,
//66 扩展11 日冻结正向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_FEB_Lib,
//67 扩展12 日冻结反向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL645_2007_FEC_Lib,
//68 扩展13 上1-24整点电表冻结的正反有功电能示值
	(u32)ADDR_RM_DL645_2007_FED_Lib,
//69 扩展14 补抄上2日日冻结数据
	(u32)ADDR_RM_DL645_2007_FEE_Lib,
//70 扩展15 补抄上3日日冻结数据
	(u32)ADDR_RM_DL645_2007_FEF_Lib,
#if ERC40==1
//71 扩展16 (上1次) 恒定磁场干扰记录
	(u32)ADDR_RM_DL645_2007_FF0_Lib,
#endif
#if (USER/100)==2//用户标识:山东版
//72 扩展 ERC9电流回路异常事件用数据
	(u32)ADDR_RM_DL645_2007_FF2_Lib,
#endif
#if (((USER/100)==2)||((USER/100)==5))//用户标识:山东,上海
//73 扩展 ERC10电压回路异常事件用数据
	(u32)ADDR_RM_DL645_2007_FF3_Lib,
#endif
#if (USER/100)==2//用户标识:山东版
//74 扩展 ERC29电能表飞走事件,ERC28电能表超差事件用数据
	(u32)ADDR_RM_DL645_2007_FF4_Lib,
#endif
//扩展 F246当前掉电记录数据
	(u32)ADDR_RM_DL645_2007_FF6_Lib,
#if (USER/100)==5//用户标识:上海
//ERC68电能表负荷开关误动作事件记录数据
	(u32)ADDR_RM_DL645_2007_FF7_Lib,
//显示用失压全失压数据
	(u32)ADDR_RM_DL645_2007_FF8_Lib,
#endif
#if (USER/100)==11//吉林系
//日 电压合格率统计数据
	(u32)ADDR_RM_DL645_2007_FF9_Lib,
//月 电压合格率统计数据
	(u32)ADDR_RM_DL645_2007_FFA_Lib,
//上1日A电压曲线
	(u32)ADDR_RM_DL645_2007_FFB_Lib,
#endif
};


u32 Get_RM_DL645_2007_MaxFn(void)
{
	return (sizeof(DL645_2007_RMLib)/4);
}


u32 Get_RM_DL645_2007_FnCount(u32 Fn)//得到Fn值的相应抄表计数号;返回0xffffffff表示没找到
{
	u32 i;
	u32 MaxFnCount;
	u8 * p8RMLib;

	MaxFnCount=Get_RM_DL645_2007_MaxFn();
	for(i=0;i<MaxFnCount;i++)
	{
		p8RMLib=(u8 *)DL645_2007_RMLib[i];
		if(Fn==p8RMLib[0])
		{
			return i;
		}
	}
	return 0xffffffff;
}















