
//ÖÕ¶ËÀà1Êý¾Ý¿â
#include "Project.h"
#include "Terminal_AFN0C_RealTimeData_Fn.h"


/*
typedef __packed struct
{
  vu32 Addr;//Êý¾ÝµØÖ·
	vu8 project;//Ö§³ÖÖ§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
  vu8 PnType;//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
  vu16 PnLen;//Ã¿PnÊý¾Ý³¤¶È
  vu16 PnMax;//×î´óPn
  vu8 Init;//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
  vu8 InitValue;//³õÊ¼Öµ
}Terminal_Class1DataLib_TypeDef;

typedef __packed struct
{
  vu32 SourAddr;//Ô­Ê¼Êý¾ÝµØÖ·
  vu32 DestAddr;//Ä¿µÄÊý¾ÝµØÖ·
	vu8 project;//Ö§³ÖÖ§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
  vu8 PnType;//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
  vu16 SourPnLen;//Ô­Ê¼Ã¿PnÊý¾Ý³¤¶È
  vu16 DestPnLen;//Ä¿µÄÃ¿PnÊý¾Ý³¤¶È
  vu16 PnMax;//×î´óPn
}Terminal_HourCongealLib_TypeDef;
*/



const Terminal_Class1DataLib_TypeDef	Terminal_Class1DataLib[]=
{
	{0,0,0,0,0,0,0},//f0
	
	{//f1 (ÖÕ¶Ë°æ±¾ÐÅÏ¢,²âÊÔÈí¼þÖÐ¸½¼Ó);p0
		ADDR_AFN0CF1,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		30,//Ô­Ê¼Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f2 ÖÕ¶ËÈÕÀúÊ±ÖÓ;p0
		ADDR_AFN0CF2,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		6,//Ô­Ê¼Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
	{//f3 ÖÕ¶Ë²ÎÊý×´Ì¬;p0
		ADDR_AFN0CF3,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,
		31,
		0,
		1,
		0,
	},
	{//f4 ÖÕ¶ËÉÏÐÐÍ¨ÐÅ×´Ì¬;p0
		ADDR_AFN0CF4,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,
		1,
		0,
		0,
		0,
	},
	{//f5 ÖÕ¶Ë¿ØÖÆÉèÖÃ×´Ì¬;p0
		ADDR_AFN0CF5,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,
		2+(6*AFN0CF5MaxPn),
		0,
		0,
		0,
	},
	{//f6 ÖÕ¶Ëµ±Ç°¿ØÖÆ×´Ì¬;p0
		ADDR_AFN0CF6,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,
		3+(8*AFN0CF6MaxPn),
		0,
		0,
		0,
	},
	{//f7 ÖÕ¶ËÊÂ¼þ¼ÆÊýÆ÷µ±Ç°Öµ;p0
		ADDR_AFN0CF7_FM,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,
		2,
		0,
		1,
		0,
	},
	{//f8 ÖÕ¶ËÊÂ¼þ±êÖ¾×´Ì¬;p0
		ADDR_AFN0CF8,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,
		8,
		0,
		1,
		0,
	},

	{//f9 ÖÕ¶Ë×´Ì¬Á¿¼°±äÎ»±êÖ¾;p0
		ADDR_AFN0CF9,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		2,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f10 ÖÕ¶ËÓëÖ÷Õ¾µ±ÈÕ¡¢ÔÂÍ¨ÐÅÁ÷Á¿;p0
		ADDR_AFN0CF10,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,
		8,
		0,
		1,
		0,
	},
	{//f11 ÖÕ¶Ë¼¯ÖÐ³­±í×´Ì¬ÐÅÏ¢;p0
		ADDR_AFN0CF11,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
#if ((Project/100)==2)//·½°¸0=ÖÇÄÜ±í,100=ÍøÂç±í,200=¼¯ÖÐÆ÷,300=×¨±äÖÕ¶Ë,400=¹«±äÖÕ¶Ë,500=¼¯ÖÐÆ÷¢òÐÍ,600=Í¨ÐÅÄ£¿é,700=
		1+(19*3),//Ã¿PnÊý¾Ý³¤¶È
#else
		1+(19*2),//Ã¿PnÊý¾Ý³¤¶È
#endif
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f12 ¿ØÖÆÊä³ö»ØÂ·¿ª¹Ø½ÓÈë×´Ì¬Á¿¼°±äÎ»±êÖ¾;p0
		ADDR_AFN0CF12,//Êý¾ÝµØÖ·
		0x08,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		2,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f13 ËÑË÷µ½µÄµç±íÐÅÏ¢
		ADDR_AFN0CF13,//Êý¾ÝµØÖ·
		0x3c,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		2+2+13,//2+2+(13*MaxRS485AddCarrierPn),//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f14 ÎÄ¼þ´«ÊäÎ´ÊÕµ½Êý¾Ý¶Î
		ADDR_AFN0CF14+2,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		2+128,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},

	{0,0,0,0,0,0,0},//f15
	{0,0,0,0,0,0,0},//f16
	
	{//f17 µ±Ç°×Ü¼ÓÓÐ¹¦¹¦ÂÊ;×Ü¼Ó×éºÅ
		ADDR_AFN0CF17,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		2,
		AFN0CF17MaxPn,
		0,
		0,
	},
	{//f18 µ±Ç°×Ü¼ÓÎÞ¹¦¹¦ÂÊ;×Ü¼Ó×éºÅ
		ADDR_AFN0CF18,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		2,
		AFN0CF18MaxPn,
		0,
		0,
	},
	{//f19 µ±ÈÕ×Ü¼ÓÓÐ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;×Ü¼Ó×éºÅ
		ADDR_AFN0CF19,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF19MaxPn,
		1,
		0,
	},
	{//f20 µ±ÈÕ×Ü¼ÓÎÞ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;×Ü¼Ó×éºÅ
		ADDR_AFN0CF20,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF20MaxPn,
		1,
		0,
	},
	{//f21 µ±ÔÂ×Ü¼ÓÓÐ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;×Ü¼Ó×éºÅ
		ADDR_AFN0CF21,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF21MaxPn,
		1,
		0,
	},
	{//f22 µ±ÔÂ×Ü¼ÓÎÞ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;×Ü¼Ó×éºÅ
		ADDR_AFN0CF22,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF22MaxPn,
		1,
		0,
	},
	{//f23 ÖÕ¶Ëµ±Ç°Ê£ÓàµçÁ¿£¨·Ñ£©;×Ü¼Ó×éºÅ
		ADDR_AFN0CF23,
		0x08,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		4,
		AFN0CF23MaxPn,
		1,
		0,
	},
	{//f24 µ±Ç°¹¦ÂÊÏÂ¸¡¿Ø¿Øºó×Ü¼ÓÓÐ¹¦¹¦ÂÊ¶³½áÖµ;×Ü¼Ó×éºÅ
		ADDR_AFN0CF24,
		0x08,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		2,
		AFN0CF24MaxPn,
		1,
		0,
	},
	
	{//f25 µ±Ç°ÈýÏà¼°×ÜÓÐ/ÎÞ¹¦¹¦ÂÊ¡¢¹¦ÂÊÒòÊý£¬ÈýÏàµçÑ¹¡¢µçÁ÷¡¢ÁãÐòµçÁ÷¡¢ÊÓÔÚ¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF25,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		67,
		AFN0CF25MaxPn,
		0,
		0xee,
	},
	{//f26 ÈýÏà¶ÏÏàÍ³¼ÆÊý¾Ý¼°×î½üÒ»´Î¶ÏÏà¼ÇÂ¼	;²âÁ¿µãºÅ
		ADDR_AFN0CF26,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		61,
		AFN0CF26MaxPn,
		0,
		0xee,
	},
	{//f27 µçÄÜ±íÈÕÀúÊ±ÖÓ¡¢±à³Ì´ÎÊý¼°Æä×î½üÒ»´Î²Ù×÷Ê±¼ä;²âÁ¿µãºÅ
		ADDR_AFN0CF27,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		60,
		AFN0CF27MaxPn,
		0,
		0xee,
	},
	{//f28 µç±íÔËÐÐ×´Ì¬×Ö¼°Æä±äÎ»±êÖ¾;²âÁ¿µãºÅ
		ADDR_AFN0CF28,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		33,
		AFN0CF28MaxPn,
		0,
		0xee,
	},
	{//f29 µ±Ç°Í­Ëð¡¢ÌúËðÓÐ¹¦×ÜµçÄÜÊ¾Öµ;²âÁ¿µãºÅ
		ADDR_AFN0CF29,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		15,
		AFN0CF29MaxPn,
		0,
		0xee,
	},
	{//f30 ÉÏÒ»½áËãÈÕÍ­Ëð¡¢ÌúËðÓÐ¹¦×ÜµçÄÜÊ¾Öµ;²âÁ¿µãºÅ
		ADDR_AFN0CF30,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		15,
		AFN0CF30MaxPn,
		0,
		0xee,
	},
	{//f31 µ±Ç°A¡¢B¡¢CÈýÏàÕý/·´ÏòÓÐ¹¦µçÄÜÊ¾Öµ¡¢×éºÏÎÞ¹¦1/2µçÄÜÊ¾Öµ;²âÁ¿µãºÅ
		ADDR_AFN0CF31,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		59,
		AFN0CF31MaxPn,
		0,
		0xee,
	},
	{//f32 ÉÏÒ»½áËãÈÕA¡¢B¡¢CÈýÏàÕý/·´ÏòÓÐ¹¦µçÄÜÊ¾Öµ¡¢×éºÏÎÞ¹¦1/2µçÄÜÊ¾Öµ;²âÁ¿µãºÅ
		ADDR_AFN0CF32,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		59,
		AFN0CF32MaxPn,
		0,
		0xee,
	},
	
	{//f33 µ±Ç°ÕýÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢Ò»/ËÄÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©	;²âÁ¿µãºÅ
		ADDR_AFN0CF33,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(17*(1+TMaxTariff)),
		AFN0CF33MaxPn,
		0,
		0xee,
	},
	{//f34 µ±Ç°·´ÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢¶þ/ÈýÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©;²âÁ¿µãºÅ
		ADDR_AFN0CF34,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(17*(1+TMaxTariff)),
		AFN0CF34MaxPn,
		0,
		0xee,
	},
	{//f35 µ±ÔÂÕýÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©;²âÁ¿µãºÅ
		ADDR_AFN0CF35,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(14*(1+TMaxTariff)),
		AFN0CF35MaxPn,
		0,
		0xee,
	},
	{//f36 µ±ÔÂ·´ÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©;²âÁ¿µãºÅ
		ADDR_AFN0CF36,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(14*(1+TMaxTariff)),
		AFN0CF36MaxPn,
		0,
		0xee,
	},
	{//f37 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕýÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢Ò»/ËÄÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©;²âÁ¿µãºÅ	
		ADDR_AFN0CF37,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(17*(1+TMaxTariff)),
		AFN0CF37MaxPn,
		0,
		0xee,
	},
	{//f38 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢¶þ/ÈýÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©;²âÁ¿µãºÅ
		ADDR_AFN0CF38,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(17*(1+TMaxTariff)),
		AFN0CF38MaxPn,
		0,
		0xee,
	},
	{//f39 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕýÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©;²âÁ¿µãºÅ
		ADDR_AFN0CF39,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(14*(1+TMaxTariff)),
		AFN0CF39MaxPn,
		0,
		0xee,
	},
	{//f40 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©;²âÁ¿µãºÅ
		ADDR_AFN0CF40,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(14*(1+TMaxTariff)),
		AFN0CF40MaxPn,
		0,
		0xee,
	},

	{//f41 µ±ÈÕÕýÏòÓÐ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ
		ADDR_AFN0CF41,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF41MaxPn,
		1,
		0,
	},
	{//f42 µ±ÈÕÕýÏòÎÞ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ
		ADDR_AFN0CF42,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF42MaxPn,
		1,
		0,
	},
	{//f43 µ±ÈÕ·´ÏòÓÐ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ
		ADDR_AFN0CF43,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF43MaxPn,
		1,
		0,
	},
	{//f44 µ±ÈÕ·´ÏòÎÞ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ	
		ADDR_AFN0CF44,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF44MaxPn,
		1,
		0,
	},
	{//f45 µ±ÔÂÕýÏòÓÐ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ
		ADDR_AFN0CF45,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF45MaxPn,
		1,
		0,
	},
	{//f46 µ±ÔÂÕýÏòÎÞ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ
		ADDR_AFN0CF46,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF46MaxPn,
		1,
		0,
	},
	{//f47 µ±ÔÂ·´ÏòÓÐ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ
		ADDR_AFN0CF47,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF47MaxPn,
		1,
		0,
	},
	{//f48 µ±ÔÂ·´ÏòÎÞ¹¦µçÄÜÁ¿£¨×Ü¡¢·ÑÂÊ1¡«M£©;²âÁ¿µãºÅ
		ADDR_AFN0CF48,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+(4*(1+TMaxTariff)),
		AFN0CF48MaxPn,
		1,
		0,
	},
	
	{//f49 µ±Ç°µçÑ¹¡¢µçÁ÷ÏàÎ»½Ç;²âÁ¿µãºÅ
		ADDR_AFN0CF49,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		12,
		AFN0CF49MaxPn,
		0,
		0xee,
	},
	{0,0,0,0,0,0,0},//f50
	{0,0,0,0,0,0,0},//f51
	{0,0,0,0,0,0,0},//f52
	{0,0,0,0,0,0,0},//f53
	{0,0,0,0,0,0,0},//f54
	{0,0,0,0,0,0,0},//f55
	{0,0,0,0,0,0,0},//f56
	{//f57 µ±Ç°A¡¢B¡¢CÈýÏàµçÑ¹¡¢µçÁ÷2¡«N´ÎÐ³²¨ÓÐÐ§Öµ;²âÁ¿µãºÅ
		ADDR_AFN0CF57,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+216,
		AFN0CF57MaxPn,
		0,
		0xee,
	},
	{//f58 µ±Ç°A¡¢B¡¢CÈýÏàµçÑ¹¡¢µçÁ÷2¡«N´ÎÐ³²¨º¬ÓÐÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF58,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		1+222,AFN0CF58MaxPn,
		0,
		0xee,
	},
	{0,0,0,0,0,0,0},//f59
	{0,0,0,0,0,0,0},//f60
	{0,0,0,0,0,0,0},//f61
	{0,0,0,0,0,0,0},//f62
	{0,0,0,0,0,0,0},//f63
	{0,0,0,0,0,0,0},//f64

	{//f65 µ±Ç°µçÈÝÆ÷Í¶ÇÐ×´Ì¬;²âÁ¿µãºÅ
		ADDR_AFN0CF65,
		0x14,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		CnType,
		3,
		AFN0CF65MaxPn,
		0,
		0,
	},
	{//f66 µ±Ç°µçÈÝÆ÷ÀÛ¼Æ²¹³¥Í¶ÈëÊ±¼äºÍ´ÎÊý;²âÁ¿µãºÅ
		ADDR_AFN0CF66,
		0x14,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		CnType,
		72,
		AFN0CF66MaxPn,
		1,
		0,
	},
	{//f67 µ±ÈÕ¡¢µ±ÔÂµçÈÝÆ÷ÀÛ¼Æ²¹³¥µÄÎÞ¹¦µçÄÜÁ¿;²âÁ¿µãºÅ
		ADDR_AFN0CF67,
		0x14,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		CnType,
		8,
		AFN0CF67MaxPn,
		1,
		0,
	},
	{0,0,0,0,0,0,0},//f68
	{0,0,0,0,0,0,0},//f69
	{0,0,0,0,0,0,0},//f70
	{0,0,0,0,0,0,0},//f71
	{0,0,0,0,0,0,0},//f72

	{//f73 Ö±Á÷Ä£ÄâÁ¿µ±Ç°Êý¾Ý;Ö±Á÷Ä£ÄâÁ¿¶Ë¿ÚºÅ
		ADDR_AFN0CF73,//Êý¾ÝµØÖ·
		0x14,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		DnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		2,//Ã¿PnÊý¾Ý³¤¶È
		AFN0CF73MaxPn,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
	
	{0,0,0,0,0,0,0},//f74
	{0,0,0,0,0,0,0},//f75
	{0,0,0,0,0,0,0},//f76
	{0,0,0,0,0,0,0},//f77
	{0,0,0,0,0,0,0},//f78
	{0,0,0,0,0,0,0},//f79
	{0,0,0,0,0,0,0},//f80
	{//f81 Ð¡Ê±¶³½á×Ü¼ÓÓÐ¹¦¹¦ÂÊ;×Ü¼Ó×éºÅ
		ADDR_AFN0CF81,//Êý¾ÝµØÖ·
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		2*MaxHourCongeal,//Ã¿PnÊý¾Ý³¤¶È
		AFN0CF81MaxPn,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
	{//f82 Ð¡Ê±¶³½á×Ü¼ÓÎÞ¹¦¹¦ÂÊ;×Ü¼Ó×éºÅ
		ADDR_AFN0CF82,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		2*MaxHourCongeal,
		AFN0CF82MaxPn,
		0,
		0xee,
	},
	{//f83 Ð¡Ê±¶³½á×Ü¼ÓÓÐ¹¦×ÜµçÄÜÁ¿;×Ü¼Ó×éºÅ
		ADDR_AFN0CF83,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		4*MaxHourCongeal,
		AFN0CF83MaxPn,
		0,
		0xee,
	},
	{//f84 Ð¡Ê±¶³½á×Ü¼ÓÎÞ¹¦×ÜµçÄÜÁ¿;×Ü¼Ó×éºÅ
		ADDR_AFN0CF84,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		GnType,
		4*MaxHourCongeal,
		AFN0CF84MaxPn,
		0,
		0xee,
	},
	{0,0,0,0,0,0,0},//f85
	{0,0,0,0,0,0,0},//f86
	{0,0,0,0,0,0,0},//f87
	{0,0,0,0,0,0,0},//f88
	{//f89 Ð¡Ê±¶³½áÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF89,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF89MaxPn,
		0,
		0xee,
	},
	{//f90 Ð¡Ê±¶³½áAÏàÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF90,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF90MaxPn,
		0,
		0xee,
	},
	{//f91 Ð¡Ê±¶³½áBÏàÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF91,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF91MaxPn,
		0,
		0xee,
	},
	{//f92 Ð¡Ê±¶³½áCÏàÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF92,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF92MaxPn,
		0,
		0xee,
	},
	{//f93 Ð¡Ê±¶³½áÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF93,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF93MaxPn,
		0,
		0xee,
	},
	{//f94 Ð¡Ê±¶³½áAÏàÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF94,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF94MaxPn,
		0,
		0xee,
	},
	{//f95 Ð¡Ê±¶³½áBÏàÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF95,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF95MaxPn,
		0,
		0xee,
	},
	{//f96 Ð¡Ê±¶³½áCÏàÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
		ADDR_AFN0CF96,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF96MaxPn,
		0,
		0xee,
	},
	{//f97 Ð¡Ê±¶³½áAÏàµçÑ¹;²âÁ¿µãºÅ
		ADDR_AFN0CF97,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		2*MaxHourCongeal,
		AFN0CF97MaxPn,
		0,
		0xee,
	},
	{//f98 Ð¡Ê±¶³½áBÏàµçÑ¹;²âÁ¿µãºÅ
		ADDR_AFN0CF98,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		2*MaxHourCongeal,
		AFN0CF98MaxPn,
		0,
		0xee
	},
	{//f99 Ð¡Ê±¶³½áCÏàµçÑ¹;²âÁ¿µãºÅ
		ADDR_AFN0CF99,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		2*MaxHourCongeal,
		AFN0CF99MaxPn,
		0,
		0xee,
	},
	{//f100 Ð¡Ê±¶³½áAÏàµçÁ÷;²âÁ¿µãºÅ
		ADDR_AFN0CF100,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF100MaxPn,
		0,
		0xee,
	},
	{//f101	Ð¡Ê±¶³½áBÏàµçÁ÷	²âÁ¿µãºÅ
		ADDR_AFN0CF101,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF101MaxPn,
		0,
		0xee
	},
	{//f102	Ð¡Ê±¶³½áCÏàµçÁ÷	²âÁ¿µãºÅ
		ADDR_AFN0CF102,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF102MaxPn,
		0,
		0xee,
	},
	{//f103	Ð¡Ê±¶³½áÁãÐòµçÁ÷	²âÁ¿µãºÅ
		ADDR_AFN0CF103,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		3*MaxHourCongeal,
		AFN0CF103MaxPn,
		0,
		0xee,
	},
	{0,0,0,0,0,0},//f104
	{//F105	Ð¡Ê±¶³½áÕýÏòÓÐ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
		ADDR_AFN0CF105,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF105MaxPn,
		0,
		0xee,
	},
	{//F106	Ð¡Ê±¶³½áÕýÏòÎÞ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
		ADDR_AFN0CF106,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF106MaxPn,
		0,
		0xee,
	},
	{//F107	Ð¡Ê±¶³½á·´ÏòÓÐ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
		ADDR_AFN0CF107,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF107MaxPn,
		0,
		0xee,
	},
	{//F108	Ð¡Ê±¶³½á·´ÏòÎÞ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
		ADDR_AFN0CF108,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF108MaxPn,
		0,
		0xee,
	},
	{//F109	Ð¡Ê±¶³½áÕýÏòÓÐ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
		ADDR_AFN0CF109,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF109MaxPn,
		0,
		0xee,
	},
	{//F110	Ð¡Ê±¶³½áÕýÏòÎÞ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
		ADDR_AFN0CF110,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF110MaxPn,
		0,
		0xee,
	},
	{//F111	Ð¡Ê±¶³½á·´ÏòÓÐ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
		ADDR_AFN0CF111,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF111MaxPn,
		0,
		0xee,
	},
	{//F112	Ð¡Ê±¶³½á·´ÏòÎÞ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
		ADDR_AFN0CF112,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		4*MaxHourCongeal,
		AFN0CF112MaxPn,
		0,
		0xee,
	},
	{//F113	Ð¡Ê±¶³½á×Ü¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
		ADDR_AFN0CF113,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		2*MaxHourCongeal,
		AFN0CF113MaxPn,
		0,
		0xee,
	},
	{//F114	Ð¡Ê±¶³½áAÏà¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
		ADDR_AFN0CF114,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		2*MaxHourCongeal,
		AFN0CF114MaxPn,
		0,
		0xee,
	},
	{//F115	Ð¡Ê±¶³½áBÏà¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
		ADDR_AFN0CF115,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		2*MaxHourCongeal,
		AFN0CF115MaxPn,
		0,
		0xee,
	},
	{//F116	Ð¡Ê±¶³½áCÏà¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
		ADDR_AFN0CF116,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		2*MaxHourCongeal,
		AFN0CF116MaxPn,
		0,
		0xee,
	},
	{0,0,0,0,0,0,0},//f117
	{0,0,0,0,0,0,0},//f118
	{0,0,0,0,0,0,0},//f119
	{0,0,0,0,0,0,0},//f120
	{//F121	Ð¡Ê±¶³½áÖ±Á÷Ä£ÄâÁ¿	Ö±Á÷Ä£ÄâÁ¿¶Ë¿ÚºÅ
		ADDR_AFN0CF121,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		DnType,
		2*MaxHourCongeal,
		AFN0CF121MaxPn,
		0,
		0xee,
	},
	{0,0,0,0,0,0,0},//f122
	{0,0,0,0,0,0,0},//f123
	{0,0,0,0,0,0,0},//f124
	{0,0,0,0,0,0,0},//f125
	{0,0,0,0,0,0,0},//f126
	{0,0,0,0,0,0,0},//f127
	{0,0,0,0,0,0,0},//f128
	
	{//F129	µ±Ç°ÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF129,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF129MaxPn,
		0,
		0xee,
	},
	{//F130	µ±Ç°ÕýÏòÎÞ¹¦£¨×éºÏÎÞ¹¦1£©µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF130,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF130MaxPn,
		0,
		0xee,
	},
	{//F131	µ±Ç°·´ÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF131,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF131MaxPn,
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
	{//F132	µ±Ç°·´ÏòÎÞ¹¦£¨×éºÏÎÞ¹¦1£©µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF132,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF132MaxPn,
		0,
		0xee,
	},
	{//F133	µ±Ç°Ò»ÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF133,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF133MaxPn,
		0,
		0xee,
	},
	{//F134	µ±Ç°¶þÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF134,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF134MaxPn,
		0,
		0xee,
	},
	{//F135	µ±Ç°ÈýÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF135,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF135MaxPn,
		0,
		0xee,
	},
	{//F136	µ±Ç°ËÄÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF136,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF136MaxPn,
		0,
		0xee,
	},
	{//F137	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF137,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF137MaxPn,
		0,
		0xee,
	},
	{//F138	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕýÏòÎÞ¹¦£¨×éºÏÎÞ¹¦1£©µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF138,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF138MaxPn,
		0,
		0xee,
	},
	{//F139	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF139,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF139MaxPn,
		0,
		0xee,
	},
	{//F140	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÎÞ¹¦£¨×éºÏÎÞ¹¦1£©µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF140,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF140MaxPn,
		0,
		0xee,
	},
	{//F141	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©Ò»ÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF141,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF141MaxPn,
		0,
		0xee,
	},
	{//F142	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©¶þÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF142,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF142MaxPn,
		0,
		0xee,
	},
	{//F143	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÈýÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF143,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF143MaxPn,
		0,
		0xee,
	},
	{//F144	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ËÄÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF144,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(4*(1+TMaxTariff)),
		AFN0CF144MaxPn,
		0,
		0xee,
	},
	{//F145	µ±ÔÂÕýÏòÓÐ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF145,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF145MaxPn,
		0,
		0xee,
	},
	{//F146	µ±ÔÂÕýÏòÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF146,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF146MaxPn,
		0,
		0xee,
	},
	{//F147	µ±ÔÂ·´ÏòÓÐ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF147,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF147MaxPn,
		0,
		0xee,
	},
	{//F148	µ±ÔÂ·´ÏòÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF148,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF148MaxPn,
		0,
		0xee,
	},
	{//F149	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕýÏòÓÐ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF149,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF149MaxPn,
		0,
		0xee,
	},
	{//F150	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕýÏòÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF150,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF150MaxPn,
		0,
		0xee,
	},
	{//F151	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÓÐ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF151,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF151MaxPn,
		0,
		0xee,
	},
	{//F152	ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF152,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(7*(1+TMaxTariff)),
		AFN0CF152MaxPn,
		0,
		0xee,
	},
	{//F153	µÚÒ»Ê±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF153,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF153MaxPn,
		0,
		0xee,
	},
	{//F154	µÚ¶þÊ±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF154,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF154MaxPn,
		0,
		0xee,
	},
	{//F155	µÚÈýÊ±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF155,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF155MaxPn,
		0,
		0xee,
	},
	{//F156	µÚËÄÊ±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF156,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF156MaxPn,
		0,
		0xee,
	},
	{//F157	µÚÎåÊ±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF157,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF157MaxPn,
		0,
		0xee,
	},
	{//F158	µÚÁùÊ±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF158,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF158MaxPn,
		0,
		0xee,
	},
	{//F159	µÚÆßÊ±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF159,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF159MaxPn,
		0,
		0xee,
	},
	{//F160	µÚ°ËÊ±Çø¶³½áÕýÏòÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£©	²âÁ¿µãºÅ
		ADDR_AFN0CF160,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(5*(1+TMaxTariff)),
		AFN0CF160MaxPn,
		0,
		0xee,
	},
	{//F161	µçÄÜ±íÔ¶³Ì¿ØÖÆÍ¨¶Ïµç×´Ì¬¼°¼ÇÂ¼	²âÁ¿µãºÅ
		ADDR_AFN0CF161,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		5+13,
		AFN0CF161MaxPn,
		0,
		0xee,
	},
	{//F162 µçÄÜ±íÈÕÀúÊ±ÖÓ
		ADDR_AFN0CF162,//Êý¾ÝµØÖ·
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		12,//Ã¿PnÊý¾Ý³¤¶È
		AFN0CF162MaxPn,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},

	{0,0,0,0,0,0,0},//f163
	{0,0,0,0,0,0,0},//f164
	{//F165	µçÄÜ±í¿ª¹Ø²Ù×÷´ÎÊý¼°Ê±¼ä	²âÁ¿µãºÅ
		ADDR_AFN0CF165,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		5+18,
		AFN0CF165MaxPn,
		0,
		0xee,
	},
	{//F166	µçÄÜ±í²ÎÊýÐÞ¸Ä´ÎÊý¼°Ê±¼ä	²âÁ¿µãºÅ
		ADDR_AFN0CF166,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		5+24,
		AFN0CF166MaxPn,
		0,
		0xee,
	},
	{//F167	µçÄÜ±í¹º¡¢ÓÃµçÐÅÏ¢	²âÁ¿µãºÅ
		ADDR_AFN0CF167,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		5+36,
		AFN0CF167MaxPn,
		0,
		0xee,
	},
	{//F168	µçÄÜ±í½áËãÐÅÏ¢	²âÁ¿µãºÅ
		ADDR_AFN0CF168,
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		6+(10*(1+TMaxTariff)),
		AFN0CF168MaxPn,
		0,
		0xee,
	},
	{//F169	¼¯ÖÐ³­±íÖÐ¼ÌÂ·ÓÉÐÅÏ¢	²âÁ¿µãºÅ
		ADDR_AFN0CF169,
		0x04,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,
		0,
		AFN0CF169MaxPn,
		0,
		0xee,
	},
	{//F170	¼¯ÖÐ³­±íµç±í³­¶ÁÐÅÏ¢	²âÁ¿µãºÅ
		ADDR_AFN0CF170,
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		18,//Ã¿PnÊý¾Ý³¤¶È
		AFN0CF170MaxPn,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
	{//F171
	#if (USER/100)==6//ÓÃ»§:ºþÄÏÏµÀ©Õ¹,×Ô¶¯ËÑµ½µÄÎ´Öªµç±í
		ADDR_AFN0CF13,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		14,//Ã¿PnÊý¾Ý³¤¶È(²»¾«È·Öµ)
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#else
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#endif
	},

	{0,0,0,0,0,0,0},//f172
	{0,0,0,0,0,0,0},//f173
	{0,0,0,0,0,0,0},//f174
	{0,0,0,0,0,0,0},//f175
	{0,0,0,0,0,0,0},//f176
	
	{//f177 µ±Ç°×éºÏÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1~M£©²âÁ¿µãºÅ
		ADDR_AFN0CF177,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		6+(5*(1+TMaxTariff)),//Ã¿PnÊý¾Ý³¤¶È
		AFN0CF177MaxPn,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
	{//f178 ÉÏ1½áËãÈÕ×éºÏÓÐ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1~M£©²âÁ¿µãºÅ
		ADDR_AFN0CF178,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		6+(5*(1+TMaxTariff)),//Ã¿PnÊý¾Ý³¤¶È
		AFN0CF178MaxPn,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
#if (USER/100)==11//¼ªÁÖ
	{//f179 µ±ÈÕµçÑ¹Í³¼ÆÊý¾Ý
		ADDR_AFN0DF27_SOUR_ReadMeter,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		66+27,//Ã¿PnÊý¾Ý³¤¶È
		AFN0DF27MaxPn_ReadMeter,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#else
	{//f179 µ±ÈÕµçÑ¹Í³¼ÆÊý¾Ý
		ADDR_AFN0DF27_SOUR,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		66+27,//Ã¿PnÊý¾Ý³¤¶È
		AFN0DF27MaxPn,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#endif
	{//f180 µ±ÔÂµçÑ¹Í³¼ÆÊý¾Ý
		ADDR_AFN0DF35_SOUR,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		66+27,//Ã¿PnÊý¾Ý³¤¶È
		AFN0DF35MaxPn,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},

	{//f181
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f182
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f183
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f184
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f185
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f186
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f187
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f188
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f189
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f190
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f191
	#if (USER/100)==5//ÉÏº£
		//ÖÕ¶Ëµ±Ç°ÏßµçÑ¹
		ADDR_AFN0CF191_Per+14,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		11,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#else
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#endif
	},
	{//f192
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f193
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f194
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f195
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f196
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f197
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f198
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f199
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f200
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#if (USER/100)==11//¼ªÁÖ
	{//f201
		ADDR_AFN0CF201,//Êý¾ÝµØÖ·
		0xff,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		2,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
#else
	{//f201
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#endif
	{//f202
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f203
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f204
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f205
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f206
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f207
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f208
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f209
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f210
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f211
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f212
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f213
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f214
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f215
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f216
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f217
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f218
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f219
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f220
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f221
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f222
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f223
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f224
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f225
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f226
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f227
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f228
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f229
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f230
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f231
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f232
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f233
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f234
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f235
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f236
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f237
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f238
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f239
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f240
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f241
	#if (USER/100)==5//ÉÏº£
		//µ±Ç°µÇÂ¼Ö÷Õ¾ÐÅÏ¢£¨×î½üÒ»´Î£©
		ADDR_AFN0CF241,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		6,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	#else
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#endif
	},
	{//f242
	#if (USER/100)==5//ÉÏº£
		//µ±ÈÕµÇÂ¼Ö÷Õ¾ÐÅÏ¢
		ADDR_AFN0CF242,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		4,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#else
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#endif
	},
	{//f243
	#if (USER/100)==5//ÉÏº£
		//µ±ÈÕÐÅºÅÇ¿¶È
		ADDR_AFN0CF243,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		24,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xFF,//³õÊ¼Öµ
	#else
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	#endif
	},
	{//f244
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f245ÖÕ¶ËÊÂ¼þ·ÖÀàÊý¾Ý
		ADDR_AFN0CF245,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		1+1,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f246µ±Ç°µôµç¼ÇÂ¼Êý¾Ý
		ADDR_AFN0CF246,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		103,//Ã¿PnÊý¾Ý³¤¶È
		F246MaxPn,//(PnÓ³Éä)
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0xee,//³õÊ¼Öµ
	},
	{//f247µ±Ç°ÖÕ¶Ëµç³Ø×´Ì¬
		ADDR_AFN0CF247,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		1,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0x01,//³õÊ¼Öµ
	},
	{//f248
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#if ((USER/100)==8)||((USER/100)==7)//ÓÃ»§±íÊ¾£ºÍ¨ÓÃ¡¢Õã½­
	{//f249
		ADDR_AFN0CF249_Ext,//Êý¾ÝµØÖ·
		0xC,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		10,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f250
		ADDR_AFN0CF250_Ext,//Êý¾ÝµØÖ·
		0xC,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		pnType,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		1+10*31,//Ã¿PnÊý¾Ý³¤¶È
		MaxRS485AddCarrierPn,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#else
	{//f249
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f250
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#endif
	{//f251
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
	{//f252
		0,//Êý¾ÝµØÖ·
		0,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		0,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		0,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		0,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#if (USER/100)==3//ÓÃ»§±êÊ¶£º¸£½¨
	{//f253 ÏÖ³¡ÐÅºÅÐÅÏ¢
		ADDR_AFN0CF253,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		13,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#endif
#if (USER/100)==3//ÓÃ»§±êÊ¶£º¸£½¨
	{//f254 ±¾µØÍ¨ÐÅÄ£¿éÐÅÏ¢
		ADDR_AFN0CF254,//Êý¾ÝµØÖ·
		0xFF,//Ö§³Ö·½°¸:B7=,B6=Í¨ÐÅÄ£¿é,B5=2ÐÍ¼¯ÖÐÆ÷,B4=¹«±äÖÕ¶Ë,B3=×¨±äÖÕ¶Ë,B2=1ÐÍ¼¯ÖÐÆ÷,B1=ÍøÂç±í,B0=ÖÇÄÜ±í
		p0Type,//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
		16,//Ã¿PnÊý¾Ý³¤¶È
		0,//×î´óPn
		1,//ÉÏµç³õÊ¼»¯0=³õÊ¼»¯,1=²»³õÊ¼»¯
		0,//³õÊ¼Öµ
	},
#endif



//ÒÔÏÂÏî½öÓÃÓÚÊý¾Ý³õÊ¼»¯
	{ADDR_ERC8_SOUR,0,pnType,ERC8_SOUR_Pn_LEN,ERC8MaxPn,0,0xee},//ERC8ÊÂ¼þµçÄÜ±íÔ­Ê¼²ÎÊý
	{ADDR_ERC13_SOUR,0,pnType,ERC13_SOUR_Pn_LEN,ERC13MaxPn,0,0xee},//ERC13µç±í¹ÊÕÏÐÅÏ¢ÊÂ¼þÔ­Ê¼Êý¾Ý
	{ADDR_AFN0CF83_SOUR,0,GnType,4,AFN0CF83MaxPn,0,0xee},//Ð¡Ê±¶³½á×Ü¼ÓÓÐ¹¦×ÜµçÁ¿Ô­Ê¼
	{ADDR_AFN0CF84_SOUR,0,GnType,4,AFN0CF84MaxPn,0,0xee},//Ð¡Ê±¶³½á×Ü¼ÓÎÞ¹¦×ÜµçÁ¿Ô­Ê¼
	{ADDR_AFN0CF105_SOUR,0,pnType,5,AFN0CF105MaxPn,0,0xee},//Ð¡Ê±¶³½áÕýÏòÓÐ¹¦×ÜµçÁ¿Ô­Ê¼
	{ADDR_AFN0CF106_SOUR,0,pnType,4,AFN0CF106MaxPn,0,0xee},//Ð¡Ê±¶³½áÕýÏòÎÞ¹¦×ÜµçÁ¿Ô­Ê¼
	{ADDR_AFN0CF107_SOUR,0,pnType,5,AFN0CF107MaxPn,0,0xee},//Ð¡Ê±¶³½á·´ÏòÓÐ¹¦×ÜµçÁ¿Ô­Ê¼
	{ADDR_AFN0CF108_SOUR,0,pnType,4,AFN0CF108MaxPn,0,0xee},//Ð¡Ê±¶³½á·´ÏòÎÞ¹¦×ÜµçÁ¿Ô­Ê¼
};


u32 Get_Class1Data_MaxFn(void)
{
  return((sizeof(Terminal_Class1DataLib)/sizeof(Terminal_Class1DataLib_TypeDef))-8);
}

u32 Get_InitClass1Data_MaxFn(void)
{
  return((sizeof(Terminal_Class1DataLib)/sizeof(Terminal_Class1DataLib_TypeDef)));
}

void AFN0C_Configure(void)//ÖÕ¶ËÖ§³ÖµÄ1ÀàÊý¾ÝÅäÖÃ,³ö¿Ú:Êý¾ÝÔÚADDR_DATABUFF
{
//ADDR_DATABUFF¶¨ÒåÈçÏÂ:
//µÚ0Byte Ö§³ÖµÄÓÃ»§´óÀàºÅ±êÖ¾		BS16	2
//´óÀàºÅ0
//µÚ2Byte Ö§³ÖµÄÐÅÏ¢Àà×éÊýn(0¡«31)	BIN	1
//µÚ3Byte F1-F8
//µÚ4Byte F9-F16
//µÚ5Byte F17-F24
//...
//´óÀàºÅ1-15Í¬´óÀàºÅ0ÔÚ´Ë²»ÌîÈë
	u32 i;
	u32 x;
	u32 y;
	u32 MaxFn;
	u8 *p8;
	
	p8=(u8*)(ADDR_DATABUFF);
	p8[0]=0xff;//Ö§³ÖµÄÓÃ»§´óÀàºÅ±êÖ¾		BS16	2
	p8[1]=0xff;
	p8[2]=0;//Ö§³ÖµÄÐÅÏ¢Àà×éÊýn(0¡«31)=0
	x=0;
	y=0;
	MaxFn=Get_Class1Data_MaxFn();
	for(i=1;i<MaxFn;i++)
	{
		if(Terminal_Class1DataLib[i].project&(1<<(Project/100)))
		{
			if(Terminal_Class1DataLib[i].PnType==p0Type)//p0Type=ÖÕ¶ËÐÅÏ¢µã,pnType=²âÁ¿µãºÅ,GnType=×Ü¼Ó×éºÅ,CnType=µçÈÝÆ÷²âÁ¿µãºÅ,DnType=Ö±Á÷Ä£ÄâÁ¿ºÅ,RnType=¿ØÖÆÂÖ´ÎºÅ,TnType=ÈÎÎñºÅ,EnType=ÊÂ¼þERCºÅ
			{
				y|=(1<<x);
			}
			else
			{
				if(Terminal_Class1DataLib[i].PnMax!=0)
				{
					y|=(1<<x);
				}
			}
		}
		x++;
		if(x>=8)
		{
			p8[p8[2]+3]=y;
			p8[2]++;
			x=0;
			y=0;
		}
	}
	if(y!=0)
	{
		p8[p8[2]+3]=y;
		p8[2]++;
	}
	//ÒÔÏÂÊý¾Ý¿ÉÓÉ¸÷·ÖÏî×éºÏµÃµ½×ÜÊÇÓÐµÄ
	//F33²âÁ¿µãÕýÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢Ò»/ËÄÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
	//F34²âÁ¿µã·´ÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢¶þ/ÈýÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
	//F35²âÁ¿µãÕýÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
	//F36²âÁ¿µã·´ÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
	//F37ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©²âÁ¿µãÕýÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢Ò»/ËÄÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
	//F38ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©²âÁ¿µã·´ÏòÓÐ/ÎÞ¹¦µçÄÜÊ¾Öµ¡¢¶þ/ÈýÏóÏÞÎÞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12©
	//F39ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©²âÁ¿µãÕýÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
	//F40ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©²âÁ¿µã·´ÏòÓÐ/ÎÞ¹¦×î´óÐèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12
	p8[7]|=0xff;
}


const Terminal_HourCongealLib_TypeDef	Terminal_HourCongealLib[]=
{
	{ADDR_AFN0CF17,ADDR_AFN0CF81_BUFF,0xFF,pnType,2,2,MaxTotalAddGroup},//1 f81 Ð¡Ê±¶³½á×Ü¼ÓÓÐ¹¦¹¦ÂÊ;×Ü¼Ó×éºÅ
	{ADDR_AFN0CF18,ADDR_AFN0CF82_BUFF,0xFF,pnType,2,2,MaxTotalAddGroup},//2 f82 Ð¡Ê±¶³½á×Ü¼ÓÎÞ¹¦¹¦ÂÊ;×Ü¼Ó×éºÅ
	{ADDR_DATABUFF,ADDR_AFN0CF83_BUFF,0xFF,pnType,4,4,MaxTotalAddGroup},//3 f83 Ð¡Ê±¶³½á×Ü¼ÓÓÐ¹¦×ÜµçÄÜÁ¿;×Ü¼Ó×éºÅ
	{ADDR_DATABUFF,ADDR_AFN0CF84_BUFF,0xFF,pnType,4,4,MaxTotalAddGroup},//4 f84 Ð¡Ê±¶³½á×Ü¼ÓÎÞ¹¦×ÜµçÄÜÁ¿;×Ü¼Ó×éºÅ
	{ADDR_AFN0CF25+5,ADDR_AFN0CF89_BUFF,0xFF,pnType,67,3,AFN0CF89MaxPn},//5 f89 Ð¡Ê±¶³½áÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+3,ADDR_AFN0CF90_BUFF,0xFF,pnType,67,3,AFN0CF90MaxPn},//6 f90 Ð¡Ê±¶³½áAÏàÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+6,ADDR_AFN0CF91_BUFF,0xFF,pnType,67,3,AFN0CF91MaxPn},//7 f91 Ð¡Ê±¶³½áBÏàÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+9,ADDR_AFN0CF92_BUFF,0xFF,pnType,67,3,AFN0CF92MaxPn},//8 f92 Ð¡Ê±¶³½áCÏàÓÐ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+12,ADDR_AFN0CF93_BUFF,0xFF,pnType,67,3,AFN0CF93MaxPn},//9 f93 Ð¡Ê±¶³½áÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+15,ADDR_AFN0CF94_BUFF,0xFF,pnType,67,3,AFN0CF94MaxPn},//10 f94 Ð¡Ê±¶³½áAÏàÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+18,ADDR_AFN0CF95_BUFF,0xFF,pnType,67,3,AFN0CF95MaxPn},//11 f95 Ð¡Ê±¶³½áBÏàÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+21,ADDR_AFN0CF96_BUFF,0xFF,pnType,67,3,AFN0CF96MaxPn},//12 f96 Ð¡Ê±¶³½áCÏàÎÞ¹¦¹¦ÂÊ;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+32,ADDR_AFN0CF97_BUFF,0xFF,pnType,67,2,AFN0CF97MaxPn},//13 f97 Ð¡Ê±¶³½áAÏàµçÑ¹;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+34,ADDR_AFN0CF98_BUFF,0xFF,pnType,67,2,AFN0CF98MaxPn},//14 f98 Ð¡Ê±¶³½áBÏàµçÑ¹;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+36,ADDR_AFN0CF99_BUFF,0xFF,pnType,67,2,AFN0CF99MaxPn},//15 f99 Ð¡Ê±¶³½áCÏàµçÑ¹;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+38,ADDR_AFN0CF100_BUFF,0xFF,pnType,67,3,AFN0CF100MaxPn},//16 f100 Ð¡Ê±¶³½áAÏàµçÁ÷;²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+41,ADDR_AFN0CF101_BUFF,0xFF,pnType,67,3,AFN0CF101MaxPn},//17 f101	Ð¡Ê±¶³½áBÏàµçÁ÷	²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+44,ADDR_AFN0CF102_BUFF,0xFF,pnType,67,3,AFN0CF102MaxPn},//18 f102	Ð¡Ê±¶³½áCÏàµçÁ÷	²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+47,ADDR_AFN0CF103_BUFF,0xFF,pnType,67,3,AFN0CF103MaxPn},//19 f103	Ð¡Ê±¶³½áÁãÐòµçÁ÷	²âÁ¿µãºÅ
	{ADDR_DATABUFF,ADDR_AFN0CF105_BUFF,0xFF,pnType,4,4,AFN0CF105MaxPn},//20 F105	Ð¡Ê±¶³½áÕýÏòÓÐ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
	{ADDR_DATABUFF,ADDR_AFN0CF106_BUFF,0xFF,pnType,4,4,AFN0CF106MaxPn},//21 F106	Ð¡Ê±¶³½áÕýÏòÎÞ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
	{ADDR_DATABUFF,ADDR_AFN0CF107_BUFF,0xFF,pnType,4,4,AFN0CF107MaxPn},//22 F107	Ð¡Ê±¶³½á·´ÏòÓÐ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
	{ADDR_DATABUFF,ADDR_AFN0CF108_BUFF,0xFF,pnType,4,4,AFN0CF108MaxPn},//23 F108	Ð¡Ê±¶³½á·´ÏòÎÞ¹¦×ÜµçÄÜÁ¿	²âÁ¿µãºÅ
	{ADDR_AFN0CF129+6+1,ADDR_AFN0CF109_BUFF,0xFF,pnType,6+(5*(1+TMaxTariff)),4,AFN0CF109MaxPn},//24 F109	Ð¡Ê±¶³½áÕýÏòÓÐ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
	{ADDR_AFN0CF130+6,ADDR_AFN0CF110_BUFF,0xFF,pnType,6+(4*(1+TMaxTariff)),4,AFN0CF110MaxPn},//25 F110	Ð¡Ê±¶³½áÕýÏòÎÞ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
	{ADDR_AFN0CF131+6+1,ADDR_AFN0CF111_BUFF,0xFF,pnType,6+(5*(1+TMaxTariff)),4,AFN0CF111MaxPn},//26 F111	Ð¡Ê±¶³½á·´ÏòÓÐ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
	{ADDR_AFN0CF132+6,ADDR_AFN0CF112_BUFF,0xFF,pnType,6+(4*(1+TMaxTariff)),4,AFN0CF112MaxPn},//27 F112	Ð¡Ê±¶³½á·´ÏòÎÞ¹¦×ÜµçÄÜÊ¾Öµ	²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+24,ADDR_AFN0CF113_BUFF,0xFF,pnType,67,2,AFN0CF113MaxPn},//28 F113	Ð¡Ê±¶³½á×Ü¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+26,ADDR_AFN0CF114_BUFF,0xFF,pnType,67,2,AFN0CF114MaxPn},//29 F114	Ð¡Ê±¶³½áAÏà¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+28,ADDR_AFN0CF115_BUFF,0xFF,pnType,67,2,AFN0CF115MaxPn},//30 F115	Ð¡Ê±¶³½áBÏà¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
	{ADDR_AFN0CF25+5+30,ADDR_AFN0CF116_BUFF,0xFF,pnType,67,2,AFN0CF116MaxPn},//31 F116	Ð¡Ê±¶³½áCÏà¹¦ÂÊÒòÊý	²âÁ¿µãºÅ
	{ADDR_AFN0CF73,ADDR_AFN0CF121_BUFF,0xFF,pnType,2,2,AFN0CF121MaxPn},//32 F121	Ð¡Ê±¶³½áÖ±Á÷Ä£ÄâÁ¿	Ö±Á÷Ä£ÄâÁ¿¶Ë¿ÚºÅ

};


u32 Get_HourCongeal_MaxFn(void)
{
  return(sizeof(Terminal_HourCongealLib)/sizeof(Terminal_HourCongealLib_TypeDef));
}






