#include "Project.h"
#include "Terminal_ReadMeter_DL698_Lib.h"

__asm void ADDR_RM_DL698_F0_Lib(void)
{
	dcb 0//实时Fn
	dcb 0//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000000//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	ALIGN
}
//20170427 和电科院沟通过，专变抄689要求，等级事件就做一级事件和二级里面的掉电。
//把现在不要求的数据项先置0，后续要求了再打开
__asm void ADDR_RM_DL698_F3_Lib(void)
{
	dcb 3//实时Fn
	dcb 78//通信标识个数

	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
#if EventProject==0//事件记录采集方案:0=原能走台体标准,1=按新智能电能表及采集终端事件记录采集规则
	dcb 0//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#else
	dcb 2_00000110//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
#endif
	dcb 2_00000000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	

	dcdu 0x301B0400//0x03300D00  //  B10开表盖次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x301B0200//0x03300D01//B10开表盖
	dcb 60//返回长度
	
	dcdu 0//0x301C0400//0x03300E00// 3 B11开端钮盖次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x301C0200//0x03300E01//B11开端钮盖
	dcb 60//返回长度

	dcdu 0//0x30000a00//0x10010001// B16 A相 B项 C项失压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30000700//0x1001FF01//B16 A相失压
	dcb 195//返回长度
	dcdu 0//0x30000a00//0x10010001// B16 A相 B项 C项失压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30000800//0x1001FF01//B16 B相失压
	dcb 195//返回长度
	dcdu 0//0x30000a00//0x10010001// B16 A相 B项 C项失压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30000900//0x1001FF01//B16 C相失压
	dcb 195//返回长度


	dcdu 0//0x30010a00//0x11010001//9 B17 A相  B项 C项欠压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30010700//0x1101FF01//B17 A相欠压
	dcb 195//返回长度
	dcdu 0//0x30010a00//0x11010001//9 B17 A相  B项 C项欠压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30010800//0x1101FF01//B17 b相欠压
	dcb 195//返回长度
	dcdu 0//0x30010a00//0x11010001//9 B17 A相  B项 C项欠压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30010900//0x1101FF01//B17 c相欠压
	dcb 195//返回长度
	

	dcdu 0//0x30020a00//0x12010001//10 B18 A相  B项 C项过压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30020700//0x1201FF01//B18 A相过压
	dcb 195//返回长度
	dcdu 0//0x30020a00//0x12010001//10 B18 A相  B项 C项过压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30020800//0x1201FF01//B18 B相过压
	dcb 195//返回长度
	dcdu 0//0x30020a00//0x12010001//10 B18 A相  B项 C项过压次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30020900//0x1201FF01//B18 C相过压
	dcb 195//返回长度
	

	dcdu 0//0x30040a00//0x18010001//11 B19 A相  B项 C项失流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30040700//0x1801FF01//B19 A相失流
	dcb 179//返回长度
	dcdu 0//0x30040a00//0x18010001//11 B19 A相  B项 C项失流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30040800//0x1801FF01//B19 B相失流
	dcb 179//返回长度
	dcdu 0//0x30040a00//0x18010001//11 B19 A相  B项 C项失流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30040900//0x1801FF01//B19 C相失流
	dcb 179//返回长度
	
	dcdu 0//0x30050a00//0x19010001//12 B20 A相  B项 C项过流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30050700//0x1901FF01//B20 A相过流
	dcb 179//返回长度
	dcdu 0//0x30050a00//0x19010001//12 B20 A相  B项 C项过流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30050800//0x1901FF01//B20 B相过流
	dcb 179//返回长度
	dcdu 0//0x30050a00//0x19010001//12 B20 A相  B项 C项过流次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30050900//0x1901FF01//B20 C相过流
	dcb 179//返回长度
	
	dcdu 0//0x30030a00//0x13010001//15 B23 A相  B项 C项断相次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30030700//0x1301FF01//B23 A相断相
	dcb 195//返回长度
	dcdu 0//0x30030a00//0x13010001//15 B23 A相  B项 C项断相次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30030800//0x1301FF01//B23 B相断相
	dcb 195//返回长度
	dcdu 0//0x30030a00//0x13010001//15 B23 A相  B项 C项断相次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30030900//0x1301FF01//B23 C相断相
	dcb 195//返回长度

	dcdu 0//0x300F0400//0x14000001//35 B64 电压逆相序次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x300F0200//0x1400FF01//B64 电压逆相序
	dcb 140//返回长度
	
	dcdu 0//0x301D0400//0x16000001//37 B66 电压不平衡次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x301D0200//0x1600FF01//B66 电压不平衡
	dcb 143//返回长度
	
	dcdu 0x30110400//0x03110000//40 B69 掉电次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0x30110200//0x03110001//B69 掉电
	dcb 12//返回长度

	dcdu 0//0x300D0400//0x03050000//45 B74 全失压次数
	dcb 6//总次数3总累计时间3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x300D0200//0x03050001//B74 全失压
	dcb 15//返回长度

	
	dcdu 0//0x30160400//0x03300400//50 B84 校时次数
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0//0x30160200//0x03300401//B84 校时
	dcb 16//返回长度
	
	dcdu 0x20140200//电表状态字 时钟电池欠压   停电抄表电池欠压
	dcb 3//返回长度
	dcdu 0
	dcb 0
	dcdu 0
	dcb 16//返回长度
	
	
	ALIGN
}

__asm void ADDR_RM_DL698_F27_Lib(void)
{
	dcb 27//实时Fn
	dcb 12//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x40000200//电能表日期时间 date_time_s
	dcb 7//返回长度  YYYYMMDDhhmmss
	dcdu 0x20130200//时钟电池工作时间 double-long-unsigned 分钟
	dcb 4//返回长度
	dcdu 0x30120400//编程总次数 当前记录数  long-unsigned
	dcb 2//返回长度
	dcdu 0x30120200//最近一次编程发生时刻
	dcb 4//返回长度
	dcdu 0x30130400//电表清零总次数 long-unsigned
	dcb 2//返回长度
	dcdu 0x30130200//最近一次电表清零发生时刻
	dcb 0//返回长度
	dcdu 0x30140400//需量清零总次数 long-unsigned
	dcb 2//返回长度
	dcdu 0x30140200//最近一次需量清零发生时刻
	dcb 0//返回长度
	dcdu 0x30150400//事件清零总次数 long-unsigned
	dcb 2//返回长度
	dcdu 0x30150200//最近一次事件清零发生时刻
	dcb 0//返回长度
	dcdu 0x30160400//校时总次数 long-unsigned
	dcb 2//返回长度
	dcdu 0x30160200//最近一次校时发生时刻
	dcb 16//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x40000200//电能表日历时钟Hhmmss
	dcb 7//返回长度
//	dcdu 0x20130200//电池工作时间
	dcb 4//返回长度
//	dcdu 0x30120400//编程总次数
	dcb 2//返回长度
//	dcdu 0x30120201//最近一次编程发生时刻
	dcb 50//返回长度
//	dcdu 0x30130400//电表清零总次数
	dcb 2//返回长度
//	dcdu 0x30130201//最近一次电表清零发生时刻
	dcb 106//返回长度
//	dcdu 0x30140400//需量清零总次数
	dcb 2//返回长度
//	dcdu 0x30140201//最近一次需量清零发生时刻
	dcb 196//202//返回长度
//	dcdu 0x30150400//事件清零总次数
	dcb 2//返回长度
//	dcdu 0x30150201//最近一次事件清零发生时刻
	dcb 14//返回长度
//	dcdu 0x30160400//校时总次数
	dcb 2//返回长度
//	dcdu 0x30160201//最近一次校时发生时刻
	dcb 16//返回长度
	ALIGN
}



//F129 当前正向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F129_Lib(void)
{
	dcb 129//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
  	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00100200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00100200
	dcb 27//返回长度01 05 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 
	ALIGN
}



//F130 当前正向无功（组合无功1）电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F130_Lib(void)
{
	dcb 130//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00300200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00300200
	dcb 27//返回长度 01 05 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 
	ALIGN
}


//F131 当前反向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F131_Lib(void)
{
	dcb 131//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
  	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00200200
	dcb 0//返回长度
	dcb 27//返回长度 01 05 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 
	ALIGN
}


//F132 当前反向无功（组合无功2）电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F132_Lib(void)
{
	dcb 132//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
    dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00400200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00400200
	dcb 27//返回长度//返回长度 01 05 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 
	ALIGN
}



//F133 当前一象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F133_Lib(void)
{
	dcb 133//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
  	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00500200
	dcb 0//返回长度
	dcb 27//返回长度01 05 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 06 xx xx xx xx 
	ALIGN
}

//F134 当前二象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F134_Lib(void)
{
	dcb 134//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
  	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00600200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00600200
	dcb 27//返回长度
	ALIGN
}

//F135 当前三象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F135_Lib(void)
{
	dcb 135//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
  	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00700200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00700200
	dcb 20//返回长度
	ALIGN
}
//F136 当前四象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F136_Lib(void)
{
	dcb 136//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
  	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x00800200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00700200
	dcb 20//返回长度
	ALIGN
}

//F149 上月（上一结算日）正向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL698_F149_Lib(void)
{
	dcb 149//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  	dcb 189//抄表日冻结Fn
 #endif
	dcb 193//月冻结Fn
	dcdu 0x10100200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x10100200
	dcb 40//返回长度
	ALIGN
}

//F151 上月（上一结算日）反向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL698_F151_Lib(void)
{
	dcb 151//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  	dcb 191//抄表日冻结Fn
 #endif
	dcb 195//月冻结Fn
	dcdu 0x10200200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x10200200
	dcb 40//返回长度
	ALIGN
}



//F162 电能表日历时钟
__asm void ADDR_RM_DL698_F162_Lib(void)
{
	dcb 162//实时Fn
	dcb 1//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x40000200//电能表日历时钟 date_time_s
	dcb 7//返回长度YYYYMMDDhhmmss

	ALIGN
}
//F165 电能表开关操作次数及时间
__asm void ADDR_RM_DL698_F165_Lib(void)
{
	dcb 165//实时Fn
	dcb 4//通信标识个数
	dcb 0//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00000001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn

	dcdu 0x301b0400//电能表尾盖打开次数
	dcb 3//返回长度
	dcdu 0x301b0200//最近一次尾盖打开时间
	dcb 60//返回长度

	dcdu 0x301c0400//电能表开表盖打开次数(仅用于事件记录)
	dcb 3//返回长度
	dcdu 0x301c0200//最近一次开表盖记录(仅用于事件记录)
	dcb 60//返回长度

	ALIGN
}

//扩展11 日冻结正向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL698_FEB_Lib(void)
{
	dcb 0xEB//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*(RMM_RS485_DateCongeal&1))+((RMM_Carrier_DateCongeal&1)<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00001000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 185//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x10100200
	dcb 0//返回长度

//当正确返回长度=0时的预计返回字节数
//	dcdu 0x10100200
	dcb 40//返回长度

	ALIGN
}
//扩展12 日冻结反向有功最大需量及发生时间（总、费率1～M）
__asm void ADDR_RM_DL698_FEC_Lib(void)
{
	dcb 0xEC//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*(RMM_RS485_DateCongeal&1))+((RMM_Carrier_DateCongeal&1)<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00001000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 187//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn
	dcdu 0x10200200
	dcb 0//返回长度


//当正确返回长度=0时的预计返回字节数
//	dcdu 0x05060A01
	dcb 40//返回长度

	ALIGN
}




//扩展3 日冻结正反有无功,4个象限无功电能示值（总、费率1～M）
//RSD用方法一: OAD + DATA   20210200  1C XX XX XX XX XX XX XX 
//RCSD 的个数是一，
//参照读取一个记录型对象属性组帧
__asm void ADDR_RM_DL698_FE3_Lib(void)
{
	dcb 0xE3//实时Fn
	dcb 8//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb (0x2*(RMM_RS485_DateCongeal&1))+((RMM_Carrier_DateCongeal&1)<<2)//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
	dcb 2_00001000//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
	dcb 0//抄表日冻结Fn
	dcb 0//月冻结Fn

	dcdu 0x00100200//上1次日正向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x00300200//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x00200200//上1次日反向有功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x00400200//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x00500200//上1次日1象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x00600200//上1次日2象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x00700200//上1次日3象限无功电能示值（总、费率1～M）
	dcb 0//返回长度
	dcdu 0x00800200//上1次日4象限无功电能示值（总、费率1～M）
	dcb 0//返回长度

//当正确返回长度=0时的预计返回字节数

//	dcdu 0x00100200//上1次日正向有功电能示值（总、费率1～M）
	dcb 27//返回长度
//	dcdu 0x00300200//上1次日正向无功（组合无功1）电能示值（总、费率1～M）
	dcb 27//返回长度
//	dcdu 0x00100200//上1次日反向有功电能示值（总、费率1～M）
	dcb 27//返回长度
//	dcdu 0x00400200//上1次日反向无功（组合无功2）电能示值（总、费率1～M）
	dcb 27//返回长度
//	dcdu 0x00500200//上1次日1象限无功电能示值（总、费率1～M）
	dcb 27//返回长度
//	dcdu 0x00600200//上1次日2象限无功电能示值（总、费率1～M）
	dcb 27//返回长度
//	dcdu 0x00700200//上1次日3象限无功电能示值（总、费率1～M）
	dcb 27//返回长度
//	dcdu 0x00800200//上1次日4象限无功电能示值（总、费率1～M）
	dcb 27//返回长度
	ALIGN
}


//F137 上月（上一结算日）正向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F137_Lib(void)
{
	dcb 137//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 169//抄表日冻结Fn
 #endif
	dcb 177//月冻结Fn
	dcdu 0x00100200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00100200
	dcb 20//返回长度
	ALIGN
}
//F138 上月（上一结算日）正向无功（组合无功1）电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F138_Lib(void)
{
	dcb 138//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 170//抄表日冻结Fn
 #endif
	dcb 178//月冻结Fn
	dcdu 0x00300200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x0003FF01
	dcb 20//返回长度
	ALIGN
}
//F139 上月（上一结算日）反向有功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F139_Lib(void)
{
	dcb 139//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 171//抄表日冻结Fn
 #endif
	dcb 179//月冻结Fn
	dcdu 0x00200200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00200200
	dcb 20//返回长度
	ALIGN
}
//F140 上月（上一结算日）反向无功（组合无功2）电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F140_Lib(void)
{
	dcb 140//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 172//抄表日冻结Fn
 #endif
	dcb 180//月冻结Fn
	dcdu 0x00400200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00400200
	dcb 20//返回长度
	ALIGN
}
//F141 上月（上一结算日）一象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F141_Lib(void)
{
	dcb 141//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 173//抄表日冻结Fn
 #endif
	dcb 181//月冻结Fn
	dcdu 0x00500200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00500200
	dcb 20//返回长度
	ALIGN
}
//F142 上月（上一结算日）二象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F142_Lib(void)
{
	dcb 142//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 174//抄表日冻结Fn
 #endif
	dcb 182//月冻结Fn
	dcdu 0x00600200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00600200
	dcb 20//返回长度
	ALIGN
}
//F143 上月（上一结算日）三象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F143_Lib(void)
{
	dcb 143//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 175//抄表日冻结Fn
 #endif
	dcb 183//月冻结Fn
	dcdu 0x00700200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00700200
	dcb 20//返回长度
	ALIGN
}
//F144 上月（上一结算日）四象限无功电能示值（总、费率1～M）
__asm void ADDR_RM_DL698_F144_Lib(void)
{
	dcb 144//实时Fn
	dcb 1//通信标识个数
	dcb 1//数据头,0=终端抄表时间,1=终端抄表时间+费率数
	dcb 2_00000111//抄表支持:B2=载波抄表,B1=RS485抄表,B0=内部交采抄表
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 2_00100001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #else
	dcb 2_00110001//数据分类:B6=补抄上2-3日冻结,B5=月冻结,B4=抄表日冻结,B3=日冻结,B2=曲线冻结,B1=小时冻结,B0=实时
 #endif
	dcb 0//小时冻结Fn
	dcb 0//曲线冻结Fn
	dcb 0//日冻结Fn
 #if RMDateCongealSour==0//抄表日冻结原始数据:0=当前实时值,1=上结算日冻结值
	dcb 0//抄表日冻结Fn
 #else
  dcb 176//抄表日冻结Fn
 #endif
	dcb 184//月冻结Fn
	dcdu 0x00800200
	dcb 0//返回长度
//当正确返回长度=0时的预计返回字节数
//	dcdu 0x00800200
	dcb 20//返回长度
	ALIGN
}


const u32 DL698_RMLib[]=
{
	//一类数据
	(u32)ADDR_RM_DL698_F27_Lib,//电能表日历时钟、编程次数及最近一次操作时间
	(u32)ADDR_RM_DL698_F3_Lib,
	(u32)ADDR_RM_DL698_F129_Lib,//当前正向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F130_Lib,//当前正向无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F131_Lib,//当前反向有功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F132_Lib,//当前反向无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F133_Lib,//当前一象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F134_Lib,//当前二象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F135_Lib,//当前三象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F136_Lib,//当前四象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F165_Lib,
	(u32)ADDR_RM_DL698_F162_Lib,//电能表日历时钟

	//二类数据
	//日冻结
	(u32)ADDR_RM_DL698_FE3_Lib,
	(u32)ADDR_RM_DL698_FEB_Lib,//扩展11 日冻结正向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL698_FEC_Lib,//扩展12 日冻结反向有功最大需量及发生时间（总、费率1～M）
	
	//月冻结
	(u32)ADDR_RM_DL698_F137_Lib,
	(u32)ADDR_RM_DL698_F138_Lib,
	(u32)ADDR_RM_DL698_F139_Lib,
	(u32)ADDR_RM_DL698_F140_Lib,
	(u32)ADDR_RM_DL698_F141_Lib,
	(u32)ADDR_RM_DL698_F142_Lib,
	(u32)ADDR_RM_DL698_F143_Lib,
	(u32)ADDR_RM_DL698_F144_Lib,//F144 上月（上一结算日）四象限无功电能示值（总、费率1～M）
	(u32)ADDR_RM_DL698_F149_Lib,//F149 上月（上一结算日）正向有功最大需量及发生时间（总、费率1～M）
	(u32)ADDR_RM_DL698_F151_Lib,//F151 上月（上一结算日）反向有功最大需量及发生时间（总、费率1～M）
	
};



u32 Get_RM_DL698_MaxFn(void)
{
	return (sizeof(DL698_RMLib)/4);
}


u32 Get_RM_DL698_FnCount(u32 Fn)//得到Fn值的相应抄表计数号;返回0xffffffff表示没找到
{
	u32 i;
	u32 MaxFnCount;
	u8 * p8RMLib;

	MaxFnCount=Get_RM_DL698_MaxFn();
	for(i=0;i<MaxFnCount;i++)
	{
		p8RMLib=(u8 *)DL698_RMLib[i];
		if(Fn==p8RMLib[0])
		{
			return i;
		}
	}
	return 0xffffffff;
}

