
#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_GET_iMeterLIB.h"



__align(4) const DL698_iMeterLIB_TypeDef  DL698_iMeterLIB[]=
{
//电能量类
//组合有功电能
	0x0000,//OI
  ADDR_00000000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//正向有功电能	
	0x0010,//OI
  ADDR_00010000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A正向有功电能
	0x0011,//OI
  ADDR_00150000+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B正向有功电能
	0x0012,//OI
  ADDR_00290000+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C正向有功电能	
	0x0013,//OI
  ADDR_003D0000+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//反向有功电能
	0x0020,//OI
  ADDR_00020000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A反向有功电能
	0x0021,//OI
  ADDR_00150000+5+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B反向有功电能
	0x0022,//OI
  ADDR_00290000+5+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C反向有功电能
	0x0023,//OI
  ADDR_003D0000+5+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类

//组合无功1电能
	0x0030,//OI
  ADDR_00030000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//A相组合无功1电能
	0x0031,//OI
  ADDR_00150000+10+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类

//B相组合无功1电能
	0x0032,//OI
  ADDR_00290000+10+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//C相组合无功1电能
	0x0033,//OI
  ADDR_003D0000+10+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类

//组合无功2电能
	0x0040,//OI
  ADDR_00040000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类

//A相组合无功2电能
	0x0041,//OI
  ADDR_00150000+15+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类

//B相组合无功2电能
	0x0042,//OI
  ADDR_00290000+15+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//C相组合无功2电能
	0x0043,//OI
  ADDR_003D0000+15+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//第一象限无功电能
	0x0050,//OI
  ADDR_00050000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//A相第一象限无功电能
	0x0051,//OI
  ADDR_00150000+20+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//B相第一象限无功电能
	0x0052,//OI
  ADDR_00290000+20+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//C相第一象限无功电能
	0x0053,//OI
  ADDR_003D0000+20+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//第二象限无功电能
	0x0060,//OI
  ADDR_00060000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//A相第二象限无功电能
	0x0061,//OI
  ADDR_00150000+25+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//B相第二象限无功电能
	0x0062,//OI
  ADDR_00290000+25+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//C相第二象限无功电能
	0x0063,//OI
  ADDR_003D0000+25+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//第三象限无功电能
	0x0070,//OI
  ADDR_00070000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//A相第三象限无功电能
	0x0071,//OI
  ADDR_00150000+30+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//B相第三象限无功电能
	0x0072,//OI
  ADDR_00290000+30+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//C相第三象限无功电能
	0x0073,//OI
  ADDR_003D0000+30+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//第四象限无功电能
	0x0080,//OI
  ADDR_00080000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//A相第四象限无功电能
	0x0081,//OI
  ADDR_00150000+35+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//B相第四象限无功电能
	0x0082,//OI
  ADDR_00290000+35+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类
	
//C相四象限无功电能
	0x0083,//OI
  ADDR_003D0000+35+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kvarh,//单位
	1,//接口类	
	
//正向视在电能
	0x0090,//OI
  ADDR_00090000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类
	
//A相正向视在电能
	0x0091,//OI
  ADDR_00150000+40+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类
	
//B相正向视在电能
	0x0092,//OI
  ADDR_00290000+40+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类
	
//C相正向视在电能
	0x0093,//OI
  ADDR_003D0000+40+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类	

//反向视在电能
	0x00A0,//OI
  ADDR_000A0000+1,//原始数据地址
	5,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类
	
//A相反向视在电能
	0x00A1,//OI
  ADDR_00150000+45+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类
	
//B相反向视在电能
	0x00A2,//OI
  ADDR_00290000+45+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类
	
//C相反向视在电能
	0x00A3,//OI
  ADDR_003D0000+45+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kVAh,//单位
	1,//接口类	
	
//正向有功基波总电能
	0x0110,//OI
  ADDR_00800000+5+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A相正向有功基波电能
	0x0111,//OI
  ADDR_00150000+55+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B相正向有功基波电能
	0x0112,//OI
  ADDR_00290000+55+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C相正向有功基波电能
	0x0113,//OI
  ADDR_003D0000+55+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类	
	
//反向有功基波总电能
	0x0120,//OI
  ADDR_00800000+10+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A相反向有功基波电能
	0x0121,//OI
  ADDR_00150000+60+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B相反向有功基波电能
	0x0122,//OI
  ADDR_00290000+60+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C相反向有功基波电能
	0x0123,//OI
  ADDR_003D0000+60+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类		

//正向有功谐波总电能
	0x0210,//OI
  ADDR_00800000+15+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A相正向有功谐波电能
	0x0211,//OI
  ADDR_00150000+65+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B相正向有功谐波电能
	0x0212,//OI
  ADDR_00290000+65+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C相正向有功谐波电能
	0x0213,//OI
  ADDR_003D0000+65+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类		
	
//反向有功谐波总电能
	0x0220,//OI
  ADDR_00800000+20+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A相反向有功谐波电能
	0x0221,//OI
  ADDR_00150000+70+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B相反向有功谐波电能
	0x0222,//OI
  ADDR_00290000+70+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C相反向有功谐波电能
	0x0223,//OI
  ADDR_003D0000+70+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//铜损有功总电能补偿量
	0x0300,//OI
  ADDR_00800000+25+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A相铜损有功电能补偿量
	0x0301,//OI
  ADDR_00150000+75+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B相铜损有功电能补偿量
	0x0302,//OI
  ADDR_00290000+75+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C相铜损有功电能补偿量
	0x0303,//OI
  ADDR_003D0000+75+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类

//铁损有功总电能补偿量
	0x0400,//OI
  ADDR_00800000+30+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A相铁损有功电能补偿量
	0x0401,//OI
  ADDR_00150000+80+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B相铁损有功电能补偿量
	0x0402,//OI
  ADDR_00290000+80+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C相铁损有功电能补偿量
	0x0403,//OI
  ADDR_003D0000+80+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类

//关联总电能
	0x0500,//OI
  ADDR_00800000+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//A相关联电能
	0x0501,//OI
  ADDR_00150000+50+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//B相关联电能
	0x0502,//OI
  ADDR_00290000+50+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类
	
//C相关联电能
	0x0503,//OI
  ADDR_003D0000+50+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-2,//换算
  Unit_kWh,//单位
	1,//接口类

	
//最大需量类
//正向有功最大需量
	0x1010,//OI
  ADDR_01010000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kW,//单位
	2,//接口类

////A相正向有功最大需量
//	0x1011,//OI
////B相正向有功最大需量
//	0x1012,//OI
////C相正向有功最大需量
//	0x1013,//OI
	
//反向有功最大需量
	0x1020,//OI
  ADDR_01020000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kW,//单位
	2,//接口类

////A相反向有功最大需量
//	0x1021,//OI
////B相反向有功最大需量
//	0x1022,//OI
////C相反向有功最大需量
//	0x1023,//OI
	
//组合无功1最大需量
	0x1030,//OI
  ADDR_01030000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long,//数据类型
	-4,//换算
  Unit_kvar,//单位
	2,//接口类
	
////A相组合无功1最大需量
//	0x1031,//OI
////B相组合无功1最大需量
//	0x1032,//OI
////C相组合无功1最大需量
//	0x1033,//OI

//组合无功2最大需量
	0x1040,//OI
  ADDR_01040000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long,//数据类型
	-4,//换算
  Unit_kvar,//单位
	2,//接口类

////A相组合无功2最大需量
//	0x1041,//OI
////B相组合无功2最大需量
//	0x1042,//OI
////C相组合无功2最大需量
//	0x1043,//OI	
	
//第一象限最大需量
	0x1050,//OI
  ADDR_01050000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kvar,//单位
	2,//接口类

////A相第一象限最大需量
//	0x1051,//OI
////B相第一象限最大需量
//	0x1052,//OI
////C相第一象限最大需量
//	0x1053,//OI

//第二象限最大需量
	0x1060,//OI
  ADDR_01060000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kvar,//单位
	2,//接口类

////A相第二象限最大需量
//	0x1061,//OI
////B相第二象限最大需量
//	0x1062,//OI
////C相第二象限最大需量
//	0x1063,//OI

//第三象限最大需量
	0x1070,//OI
  ADDR_01070000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kvar,//单位
	2,//接口类

////A相第三象限最大需量
//	0x1071,//OI
////B相第三象限最大需量
//	0x1072,//OI
////C相第三象限最大需量
//	0x1073,//OI

//第四象限最大需量
	0x1080,//OI
  ADDR_01080000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kvar,//单位
	2,//接口类

////A相第四象限最大需量
//	0x1081,//OI
////B相第四象限最大需量
//	0x1082,//OI
////C相第四象限最大需量
//	0x1083,//OI

//正向视在最大需量
	0x1090,//OI
  ADDR_01090000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kVA,//单位
	2,//接口类

////A相正向视在最大需量
//	0x1091,//OI
////B相正向视在最大需量
//	0x1092,//OI
////C相正向视在最大需量
//	0x1093,//OI

//反向视在最大需量
	0x10A0,//OI
  ADDR_010A0000,//原始数据地址
	8,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1+MMaxTariff,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_kVA,//单位
	2,//接口类

////A相反向视在最大需量
//	0x10A1,//OI
////B相反向视在最大需量
//	0x10A2,//OI
////C相反向视在最大需量
//	0x10A3,//OI

////冻结周期内正向有功最大需量
//	0x1110,//OI
////冻结周期内A相正向有功最大需量
//	0x1111,//OI
////冻结周期内B相正向有功最大需量
//	0x1112,//OI
////冻结周期内C相正向有功最大需量
//	0x1113,//OI
////冻结周期内反向有功最大需量
//	0x1120,//OI
////冻结周期内A相反向有功最大需量
//	0x1121,//OI
////冻结周期内B相反向有功最大需量
//	0x1122,//OI
////冻结周期内C相反向有功最大需量
//	0x1123,//OI
////冻结周期内组合无功1最大需量
//	0x1130,//OI
////冻结周期内A相组合无功1最大需量
//	0x1131,//OI
////冻结周期内B相组合无功1最大需量
//	0x1132,//OI
////冻结周期内C相组合无功1最大需量
//	0x1133,//OI
////冻结周期内组合无功2最大需量
//	0x1140,//OI
////冻结周期内A相组合无功2最大需量
//	0x1141,//OI
////冻结周期内B相组合无功2最大需量
//	0x1142,//OI
////冻结周期内C相组合无功2最大需量
//	0x1143,//OI
////冻结周期内第一象限最大需量
//	0x1150,//OI
////冻结周期内A相第一象限最大需量
//	0x1151,//OI
////冻结周期内B相第一象限最大需量
//	0x1152,//OI
////冻结周期内C相第一象限最大需量
//	0x1153,//OI
////冻结周期内第二象限最大需量
//	0x1160,//OI
////冻结周期内A相第二象限最大需量
//	0x1161,//OI
////冻结周期内B相第二象限最大需量
//	0x1162,//OI
////冻结周期内C相第二象限最大需量
//	0x1163,//OI
////冻结周期内第三象限最大需量
//	0x1170,//OI
////冻结周期内A相第三象限最大需量
//	0x1171,//OI
////冻结周期内B相第三象限最大需量
//	0x1172,//OI
////冻结周期内C相第三象限最大需量
//	0x1173,//OI
////冻结周期内第四象限最大需量
//	0x1180,//OI
////冻结周期内A相第四象限最大需量
//	0x1181,//OI
////冻结周期内B相第四象限最大需量
//	0x1182,//OI
////冻结周期内C相第四象限最大需量
//	0x1183,//OI
////冻结周期内正向视在最大需量
//	0x1190,//OI
////冻结周期内A相正向视在最大需量
//	0x1191,//OI
////冻结周期内B相正向视在最大需量
//	0x1192,//OI
////冻结周期内C相正向视在最大需量
//	0x1193,//OI
////冻结周期内反向视在最大需量
//	0x11A0,//OI
////冻结周期内A相反向视在最大需量
//	0x11A1,//OI
////冻结周期内B相反向视在最大需量
//	0x11A2,//OI
////冻结周期内C相反向视在最大需量
//	0x11A3,//OI


//变量类
//电压
	0x2000,//OI
  ADDR_UA+2,//原始数据地址
	4,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	3,//数组数
	DataType_long_unsigned,//数据类型
	-1,//换算
  Unit_V,//单位
	3,//接口类

//电流
	0x2001,//OI
  ADDR_IA+1,//原始数据地址
	4,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	3,//数组数
	DataType_double_long,//数据类型
	-3,//换算
  Unit_A,//单位
	3,//接口类
	
//电压相角
	0x2002,//OI
  ADDR_ANGLE_UA,//原始数据地址
	2,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	3,//数组数
	DataType_long_unsigned,//数据类型
	-1,//换算
  Unit_0,//单位
	3,//接口类
	
//电压电流相角
	0x2003,//OI
  ADDR_ANGLE_UIA,//原始数据地址
	2,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	3,//数组数
	DataType_long_unsigned,//数据类型
	-1,//换算
  Unit_0,//单位
	3,//接口类
	
//有功功率
	0x2004,//OI
  ADDR_PT+1,//原始数据地址
	4,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	4,//数组数
	DataType_double_long,//数据类型
	-1,//换算
  Unit_W,//单位
	4,//接口类
	
//无功功率
	0x2005,//OI
  ADDR_QT+1,//原始数据地址
	4,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	4,//数组数
	DataType_double_long,//数据类型
	-1,//换算
  Unit_var,//单位
	4,//接口类

//视在功率
	0x2006,//OI
  ADDR_ST+1,//原始数据地址
	4,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	4,//数组数
	DataType_double_long,//数据类型
	-1,//换算
  Unit_VA,//单位
	4,//接口类

//一分钟平均有功功率
	0x2007,//OI
  ADDR_PARPT,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-1,//换算
  Unit_W,//单位
	4,//接口类

//一分钟平均无功功率
//一分钟平均视在功率

//功率因数
	0x200A,//OI
  ADDR_COST,//原始数据地址
	2,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	4,//数组数
	DataType_long,//数据类型
	-3,//换算
  255,//单位(无)
	4,//接口类

//电压波形失真度
//电流波形失真度

//电压谐波含有量（总及2…n次）
	0x200D,//OI
  ADDR_FFT_UA,//原始数据地址
	2,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	21,//数组数
	DataType_long,//数据类型
	-2,//换算
  Unit__bfb,//单位
	5,//接口类

//电流谐波含有量（总及2…n次）
	0x200E,//OI
  ADDR_FFT_IA,//原始数据地址
	2,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	21,//数组数
	DataType_long,//数据类型
	-2,//换算
  Unit__bfb,//单位
	5,//接口类

//电网频率
	0x200F,//OI
  ADDR_FREQUENCY,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_long_unsigned,//数据类型
	-2,//换算
  Unit_Hz,//单位
	6,//接口类

//时钟电池电压
	0x2011,//OI
  ADDR_URTC,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_long_unsigned,//数据类型
	-2,//换算
  Unit_V,//单位
	6,//接口类

//电表运行状态字
	0x2014,//OI
  ADDR_04000501,//原始数据地址
	2,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	7,//数组数
	DataType_bit_string,//数据类型
	0,//换算
  255,//单位
	6,//接口类

//当前有功需量
	0x2017,//OI
  ADDR_PMAX,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-4,//换算
  Unit_kW,//单位
	6,//接口类

//当前无功需量
	0x2018,//OI
  ADDR_QMAX,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-4,//换算
  Unit_kvar,//单位
	6,//接口类
	
//当前视在需量
	0x2019,//OI
  ADDR_SMAX,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long,//数据类型
	-4,//换算
  Unit_kVA,//单位
	6,//接口类
	
//当前电价
	0x201A,//OI
  ADDR_02800020,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_rmb_kWh,//单位
	6,//接口类

//当前费率电价
	0x201B,//OI
  ADDR_02800021,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_rmb_kWh,//单位
	6,//接口类

//当前阶梯电价
	0x201C,//OI
  ADDR_0280000B,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_double_long_unsigned,//数据类型
	-4,//换算
  Unit_rmb_kWh,//单位
	6,//接口类

//电压不平衡率
	0x2026,//OI
  ADDR_UNPH+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_long_unsigned,//数据类型
	-2,//换算
  Unit__bfb,//单位
	6,//接口类
	
//电流不平衡率
	0x2027,//OI
  ADDR_IBPH+1,//原始数据地址
	0,//当数组的每组有固定间隔时为每组的固定间隔长度,否则为0
	1,//数组数
	DataType_long_unsigned,//数据类型
	-2,//换算
  Unit__bfb,//单位
	6,//接口类

};




DL698_iMeterLIB_TypeDef *Get_DL698_iMeter_pLib(u32 OI)//得到iMeter_pLib指针;入口:OI;返回:Lib指针(=0表示无相应的OI)
{
	u32 i;
	DL698_iMeterLIB_TypeDef *pLib;

	pLib=(DL698_iMeterLIB_TypeDef *)DL698_iMeterLIB;
	for(i=0;i<sizeof(DL698_iMeterLIB)/sizeof(DL698_iMeterLIB_TypeDef);i++)
	{
		if(OI==pLib[0].OI)
		{
			return pLib;
		}
		pLib++;
	}
	return 0;
}





