

#ifndef ERC_Project2_USER0xx_H
#define ERC_Project2_USER0xx_H
//	#if EventProject==0//事件记录采集方案:0=原能走台体标准,1=按新智能电能表及采集终端事件记录采集规则
#define ERC1     1//数据初始化和版本变更记录;f=1数据初始化,f=2版本变更,f=3数据初始化同时版本变更
#define ERC2     1//参数丢失记录;f=1终端参数丢失,f=2测量点参数丢失,f=3终端参数丢失同时测量点参数丢失
#define ERC3     1//参数变更记录,入口接收缓冲首址
#define ERC4     1//状态量变位记录;入口sc=状态变位,ss=变位后状态
#define ERC5     0//遥控跳闸记录;入口n=跳闸轮次(0-7),kw1=跳闸时功率(总加功率),kw2=跳闸后2分钟的功率(总加功率)
#define ERC6     0//功控跳闸记录;入口Pn总加组号(从1开始),Bin跳闸轮次,Type功控类别,kw1跳闸前功率,kw2跳闸后2分钟功率,kw3跳闸时功率定值
#define ERC7     0//电控跳闸记录;入口Pn总加组号(从1开始),Bin跳闸轮次,Type电控类别,kwh1跳闸时电能量,kwh2跳闸时电能量定值
#define ERC8     1//电能表参数变更,入口Pn=测量点号(0开始),Fn抄表数据缓冲地址
#define ERC9     1//电流回路异常.反向,入口:Pn测量点号(从1开始)
#define ERC10     1//电压回路异常(断相、失压),入口:Pn测量点号(从1开始)
#define ERC11     1//相序异常,入口:Pn测量点号(从1开始),f=0恢复=1产生
#define ERC12     1//电能表时间超差,入口:Pn测量点号(从1开始)
#define ERC13     1//电表故障信息,入口Pn=测量点号(0开始),Fn抄表数据缓冲地址
#define ERC14     1//终端停/上电事件
#define ERC15     1//ERC15谐波越限告警
#define ERC16     0//ERC16直流模拟量越限
#define ERC17     1//电压/电流不平衡度越限,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志,unu=压不平衡度,uni=电流不平衡度
#define ERC18     0//ERC18电容器投切自锁记录
#define ERC19     0//购电参数设置记录
#define ERC20     1//消息认证错误记录,入口:PWH_PWL消息认证码,MSA=启动站地址
#define ERC21     1//ERC21终端故障记录
#define ERC22     1//有功总电能量差动越限计算和事件记录
#define ERC23     0//电控告警记录;入口Pn总加组号,Bin跳闸轮次,Type电控类别,kwh1告警时电能量,kwh2告警时电能量定值
#define ERC24     1//电压越限记录,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志
#define ERC25     1//电流越限记录,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志
#define ERC26     1//视在功率越限记录,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志,kva1=发生时的视在功率,kva2=发生时的视在功率限值
#define ERC27     1//电能表示度下降记录(在类1数据存贮前检查事件),入口Pn=测量点号(1开始),Fn抄表数据缓冲地址
#define ERC28     1//ERC28电能量超差记录
#define ERC29     1//电能表飞走,超差(在类1数据存贮前检查事件),入口Pn=测量点号(1开始),Fn抄表数据缓冲地址
#define ERC30     1//电能表停走事件,入口:Pn=测量点号(1开始)
#define ERC31     1//终端485抄表失败事件,入口测量点号,f=1产生=0恢复
#define ERC32     1//通信流量超门限事件,n1=当月已发生的通信流量,n2=月通信流量门限
#define ERC33     1//电能表运行状态字变位事件(在类1数据存贮前写事件),入口Pn=测量点号(1开始),Fn抄表数据缓冲地址
#define ERC34     0//ERC34 CT异常事件
#define ERC35     1//发现未知电表事件;入口Port=端口号,n=未知电表数,DataAddr=未知电表通信地址等每表8字节数据存放的地址
#define ERC36     0//控制输出回路开关接入状态量变位记录
#define ERC37     1//电能表开表盖事件记录
#define ERC38     1//电能表开端钮盒事件记录
#define ERC39     1//补抄失败事件记录
#define ERC40     1//磁场异常事件记录
#define ERC41     1//对时事件记录
#define ERC45     1//终端电池失效
#define ERC68     0//电能表负荷开关误动作
/*
	#else//#if EventProject==0//事件记录采集方案:0=原能走台体标准,1=按新智能电能表及采集终端事件记录采集规则
#define ERC1     1//数据初始化和版本变更记录;f=1数据初始化,f=2版本变更,f=3数据初始化同时版本变更
#define ERC2     0//参数丢失记录;f=1终端参数丢失,f=2测量点参数丢失,f=3终端参数丢失同时测量点参数丢失
#define ERC3     1//参数变更记录,入口接收缓冲首址
#define ERC4     1//状态量变位记录;入口sc=状态变位,ss=变位后状态
#define ERC5     0//遥控跳闸记录;入口n=跳闸轮次(0-7),kw1=跳闸时功率(总加功率),kw2=跳闸后2分钟的功率(总加功率)
#define ERC6     0//功控跳闸记录;入口Pn总加组号(从1开始),Bin跳闸轮次,Type功控类别,kw1跳闸前功率,kw2跳闸后2分钟功率,kw3跳闸时功率定值
#define ERC7     0//电控跳闸记录;入口Pn总加组号(从1开始),Bin跳闸轮次,Type电控类别,kwh1跳闸时电能量,kwh2跳闸时电能量定值
#define ERC8     0//电能表参数变更,入口Pn=测量点号(0开始),Fn抄表数据缓冲地址
#define ERC9     1//电流回路异常.反向,入口:Pn测量点号(从1开始)
#define ERC10     1//电压回路异常(断相、失压),入口:Pn测量点号(从1开始)
#define ERC11     1//相序异常,入口:Pn测量点号(从1开始),f=0恢复=1产生
#define ERC12     1//电能表时间超差,入口:Pn测量点号(从1开始)
#define ERC13     0//电表故障信息,入口Pn=测量点号(0开始),Fn抄表数据缓冲地址
#define ERC14     1//终端停/上电事件
#define ERC15     0//ERC15谐波越限告警
#define ERC16     0//ERC16直流模拟量越限
#define ERC17     1//电压/电流不平衡度越限,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志,unu=压不平衡度,uni=电流不平衡度
#define ERC18     0//ERC18电容器投切自锁记录
#define ERC19     0//购电参数设置记录
#define ERC20     1//消息认证错误记录,入口:PWH_PWL消息认证码,MSA=启动站地址
#define ERC21     0//ERC21终端故障记录
#define ERC22     0//有功总电能量差动越限计算和事件记录
#define ERC23     0//电控告警记录;入口Pn总加组号,Bin跳闸轮次,Type电控类别,kwh1告警时电能量,kwh2告警时电能量定值
#define ERC24     1//电压越限记录,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志
#define ERC25     1//电流越限记录,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志
#define ERC26     0//视在功率越限记录,入口:Pn测量点号(从1开始),ss=0恢复=1产生,f=异常标志,kva1=发生时的视在功率,kva2=发生时的视在功率限值
#define ERC27     0//电能表示度下降记录(在类1数据存贮前检查事件),入口Pn=测量点号(1开始),Fn抄表数据缓冲地址
#define ERC28     0//ERC28电能量超差记录
#define ERC29     0//电能表飞走,超差(在类1数据存贮前检查事件),入口Pn=测量点号(1开始),Fn抄表数据缓冲地址
#define ERC30     0//电能表停走事件,入口:Pn=测量点号(1开始)
#define ERC31     0//终端485抄表失败事件,入口测量点号,f=1产生=0恢复
#define ERC32     1//通信流量超门限事件,n1=当月已发生的通信流量,n2=月通信流量门限
#define ERC33     0//电能表运行状态字变位事件(在类1数据存贮前写事件),入口Pn=测量点号(1开始),Fn抄表数据缓冲地址
#define ERC34     0//ERC34 CT异常事件
#define ERC35     1//发现未知电表事件;入口Port=端口号,n=未知电表数,DataAddr=未知电表通信地址等每表8字节数据存放的地址
#define ERC36     0//控制输出回路开关接入状态量变位记录
#define ERC37     0//电能表开表盖事件记录
#define ERC38     0//电能表开端钮盒事件记录
#define ERC39     0//补抄失败事件记录
#define ERC40     0//磁场异常事件记录
#define ERC41     1//对时事件记录
#define ERC45     1//终端电池失效
#define ERC68     0//电能表负荷开关误动作
	#endif
*/

#endif
